Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1465 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 33 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xbd6c9): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x8b926): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x868f0): C:/Users/Hesham/Desktop/NTI/STM32IDE/STM32F303RE_Auto_Parking_System/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 34 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 11 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x1020f): unsigned int
 <1><38>: Abbrev Number: 11 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5d67a): long long int
 <1><3f>: Abbrev Number: 11 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x12632): long double
 <1><46>: Abbrev Number: 11 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x66b39): signed char
 <1><4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x3bb36): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 11 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x94db3): unsigned char
 <1><60>: Abbrev Number: 11 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x98b53): short int
 <1><67>: Abbrev Number: 4 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0xa7152): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 11 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0xc3f0e): short unsigned int
 <1><7a>: Abbrev Number: 11 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0x10d92): long int
 <1><81>: Abbrev Number: 4 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x82520): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 11 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x4e860): long unsigned int
 <1><94>: Abbrev Number: 11 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x2a1ad): long long unsigned int
 <1><9b>: Abbrev Number: 4 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x3bb38): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 16 (DW_TAG_const_type)
    <a8>   DW_AT_type        : <0x9b>
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x95f15): uint16_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 36
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x67>
 <1><b8>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 4 (DW_TAG_typedef)
    <be>   DW_AT_name        : (indirect string, offset: 0x95540): uint32_t
    <c2>   DW_AT_decl_file   : 3
    <c3>   DW_AT_decl_line   : 48
    <c4>   DW_AT_decl_column : 20
    <c5>   DW_AT_type        : <0x81>
 <1><c9>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ca>   DW_AT_type        : <0xbd>
 <1><ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cf>   DW_AT_byte_size   : 4
    <cf>   DW_AT_type        : <0xd3>
 <1><d3>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <d4>   DW_AT_prototyped  : 1
    <d4>   DW_AT_sibling     : <0xde>
 <2><d8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <d9>   DW_AT_type        : <0xde>
 <2><dd>: Abbrev Number: 0
 <1><de>: Abbrev Number: 35 (DW_TAG_pointer_type)
    <df>   DW_AT_byte_size   : 4
 <1><e0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e1>   DW_AT_type        : <0x9b>
 <1><e5>: Abbrev Number: 11 (DW_TAG_base_type)
    <e6>   DW_AT_byte_size   : 1
    <e7>   DW_AT_encoding    : 8	(unsigned char)
    <e8>   DW_AT_name        : (indirect string, offset: 0x41f4c): char
 <1><ec>: Abbrev Number: 16 (DW_TAG_const_type)
    <ed>   DW_AT_type        : <0xe5>
 <1><f1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
    <f2>   DW_AT_type        : <0xec>
 <1><f6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <f7>   DW_AT_byte_size   : 16
    <f8>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 348
    <fb>   DW_AT_decl_column : 9
    <fb>   DW_AT_sibling     : <0x136>
 <2><ff>: Abbrev Number: 6 (DW_TAG_member)
    <100>   DW_AT_name        : CCR
    <104>   DW_AT_decl_file   : 4
    <104>   DW_AT_decl_line   : 350
    <106>   DW_AT_decl_column : 17
    <106>   DW_AT_type        : <0xc9>
    <10a>   DW_AT_data_member_location: 0
 <2><10b>: Abbrev Number: 3 (DW_TAG_member)
    <10c>   DW_AT_name        : (indirect string, offset: 0x61953): CNDTR
    <110>   DW_AT_decl_file   : 4
    <111>   DW_AT_decl_line   : 351
    <113>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0xc9>
    <118>   DW_AT_data_member_location: 4
 <2><119>: Abbrev Number: 3 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0xc5739): CPAR
    <11e>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 352
    <121>   DW_AT_decl_column : 17
    <122>   DW_AT_type        : <0xc9>
    <126>   DW_AT_data_member_location: 8
 <2><127>: Abbrev Number: 3 (DW_TAG_member)
    <128>   DW_AT_name        : (indirect string, offset: 0x71882): CMAR
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 353
    <12f>   DW_AT_decl_column : 17
    <130>   DW_AT_type        : <0xc9>
    <134>   DW_AT_data_member_location: 12
 <2><135>: Abbrev Number: 0
 <1><136>: Abbrev Number: 13 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0xa6471): DMA_Channel_TypeDef
    <13b>   DW_AT_decl_file   : 4
    <13c>   DW_AT_decl_line   : 354
    <13e>   DW_AT_decl_column : 3
    <13f>   DW_AT_type        : <0xf6>
 <1><143>: Abbrev Number: 20 (DW_TAG_structure_type)
    <144>   DW_AT_byte_size   : 8
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 356
    <148>   DW_AT_decl_column : 9
    <148>   DW_AT_sibling     : <0x167>
 <2><14c>: Abbrev Number: 6 (DW_TAG_member)
    <14d>   DW_AT_name        : ISR
    <151>   DW_AT_decl_file   : 4
    <151>   DW_AT_decl_line   : 358
    <153>   DW_AT_decl_column : 17
    <153>   DW_AT_type        : <0xc9>
    <157>   DW_AT_data_member_location: 0
 <2><158>: Abbrev Number: 3 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x8fabc): IFCR
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 359
    <160>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xc9>
    <165>   DW_AT_data_member_location: 4
 <2><166>: Abbrev Number: 0
 <1><167>: Abbrev Number: 13 (DW_TAG_typedef)
    <168>   DW_AT_name        : (indirect string, offset: 0x4b072): DMA_TypeDef
    <16c>   DW_AT_decl_file   : 4
    <16d>   DW_AT_decl_line   : 360
    <16f>   DW_AT_decl_column : 3
    <170>   DW_AT_type        : <0x143>
 <1><174>: Abbrev Number: 20 (DW_TAG_structure_type)
    <175>   DW_AT_byte_size   : 44
    <176>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 474
    <179>   DW_AT_decl_column : 9
    <179>   DW_AT_sibling     : <0x202>
 <2><17d>: Abbrev Number: 3 (DW_TAG_member)
    <17e>   DW_AT_name        : (indirect string, offset: 0x8550d): MODER
    <182>   DW_AT_decl_file   : 4
    <183>   DW_AT_decl_line   : 476
    <185>   DW_AT_decl_column : 17
    <186>   DW_AT_type        : <0xc9>
    <18a>   DW_AT_data_member_location: 0
 <2><18b>: Abbrev Number: 3 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x9e8d3): OTYPER
    <190>   DW_AT_decl_file   : 4
    <191>   DW_AT_decl_line   : 477
    <193>   DW_AT_decl_column : 17
    <194>   DW_AT_type        : <0xc9>
    <198>   DW_AT_data_member_location: 4
 <2><199>: Abbrev Number: 3 (DW_TAG_member)
    <19a>   DW_AT_name        : (indirect string, offset: 0xb24db): OSPEEDR
    <19e>   DW_AT_decl_file   : 4
    <19f>   DW_AT_decl_line   : 478
    <1a1>   DW_AT_decl_column : 17
    <1a2>   DW_AT_type        : <0xc9>
    <1a6>   DW_AT_data_member_location: 8
 <2><1a7>: Abbrev Number: 3 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x8478d): PUPDR
    <1ac>   DW_AT_decl_file   : 4
    <1ad>   DW_AT_decl_line   : 479
    <1af>   DW_AT_decl_column : 17
    <1b0>   DW_AT_type        : <0xc9>
    <1b4>   DW_AT_data_member_location: 12
 <2><1b5>: Abbrev Number: 6 (DW_TAG_member)
    <1b6>   DW_AT_name        : IDR
    <1ba>   DW_AT_decl_file   : 4
    <1ba>   DW_AT_decl_line   : 480
    <1bc>   DW_AT_decl_column : 17
    <1bc>   DW_AT_type        : <0xc9>
    <1c0>   DW_AT_data_member_location: 16
 <2><1c1>: Abbrev Number: 6 (DW_TAG_member)
    <1c2>   DW_AT_name        : ODR
    <1c6>   DW_AT_decl_file   : 4
    <1c6>   DW_AT_decl_line   : 481
    <1c8>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0xc9>
    <1cc>   DW_AT_data_member_location: 20
 <2><1cd>: Abbrev Number: 3 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x2d99f): BSRR
    <1d2>   DW_AT_decl_file   : 4
    <1d3>   DW_AT_decl_line   : 482
    <1d5>   DW_AT_decl_column : 17
    <1d6>   DW_AT_type        : <0xc9>
    <1da>   DW_AT_data_member_location: 24
 <2><1db>: Abbrev Number: 3 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0xafd21): LCKR
    <1e0>   DW_AT_decl_file   : 4
    <1e1>   DW_AT_decl_line   : 483
    <1e3>   DW_AT_decl_column : 17
    <1e4>   DW_AT_type        : <0xc9>
    <1e8>   DW_AT_data_member_location: 28
 <2><1e9>: Abbrev Number: 6 (DW_TAG_member)
    <1ea>   DW_AT_name        : AFR
    <1ee>   DW_AT_decl_file   : 4
    <1ee>   DW_AT_decl_line   : 484
    <1f0>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0x212>
    <1f4>   DW_AT_data_member_location: 32
 <2><1f5>: Abbrev Number: 6 (DW_TAG_member)
    <1f6>   DW_AT_name        : BRR
    <1fa>   DW_AT_decl_file   : 4
    <1fa>   DW_AT_decl_line   : 485
    <1fc>   DW_AT_decl_column : 17
    <1fc>   DW_AT_type        : <0xc9>
    <200>   DW_AT_data_member_location: 40
 <2><201>: Abbrev Number: 0
 <1><202>: Abbrev Number: 21 (DW_TAG_array_type)
    <203>   DW_AT_type        : <0xc9>
    <207>   DW_AT_sibling     : <0x212>
 <2><20b>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <20c>   DW_AT_type        : <0x31>
    <210>   DW_AT_upper_bound : 1
 <2><211>: Abbrev Number: 0
 <1><212>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <213>   DW_AT_type        : <0x202>
 <1><217>: Abbrev Number: 13 (DW_TAG_typedef)
    <218>   DW_AT_name        : (indirect string, offset: 0xc678c): GPIO_TypeDef
    <21c>   DW_AT_decl_file   : 4
    <21d>   DW_AT_decl_line   : 486
    <21f>   DW_AT_decl_column : 2
    <220>   DW_AT_type        : <0x174>
 <1><224>: Abbrev Number: 20 (DW_TAG_structure_type)
    <225>   DW_AT_byte_size   : 96
    <226>   DW_AT_decl_file   : 4
    <227>   DW_AT_decl_line   : 650
    <229>   DW_AT_decl_column : 9
    <229>   DW_AT_sibling     : <0x368>
 <2><22d>: Abbrev Number: 6 (DW_TAG_member)
    <22e>   DW_AT_name        : CR1
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 652
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xc9>
    <238>   DW_AT_data_member_location: 0
 <2><239>: Abbrev Number: 6 (DW_TAG_member)
    <23a>   DW_AT_name        : CR2
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 653
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xc9>
    <244>   DW_AT_data_member_location: 4
 <2><245>: Abbrev Number: 3 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x93a10): SMCR
    <24a>   DW_AT_decl_file   : 4
    <24b>   DW_AT_decl_line   : 654
    <24d>   DW_AT_decl_column : 17
    <24e>   DW_AT_type        : <0xc9>
    <252>   DW_AT_data_member_location: 8
 <2><253>: Abbrev Number: 3 (DW_TAG_member)
    <254>   DW_AT_name        : (indirect string, offset: 0x433d3): DIER
    <258>   DW_AT_decl_file   : 4
    <259>   DW_AT_decl_line   : 655
    <25b>   DW_AT_decl_column : 17
    <25c>   DW_AT_type        : <0xc9>
    <260>   DW_AT_data_member_location: 12
 <2><261>: Abbrev Number: 6 (DW_TAG_member)
    <262>   DW_AT_name        : SR
    <265>   DW_AT_decl_file   : 4
    <265>   DW_AT_decl_line   : 656
    <267>   DW_AT_decl_column : 17
    <267>   DW_AT_type        : <0xc9>
    <26b>   DW_AT_data_member_location: 16
 <2><26c>: Abbrev Number: 6 (DW_TAG_member)
    <26d>   DW_AT_name        : EGR
    <271>   DW_AT_decl_file   : 4
    <271>   DW_AT_decl_line   : 657
    <273>   DW_AT_decl_column : 17
    <273>   DW_AT_type        : <0xc9>
    <277>   DW_AT_data_member_location: 20
 <2><278>: Abbrev Number: 3 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x7143e): CCMR1
    <27d>   DW_AT_decl_file   : 4
    <27e>   DW_AT_decl_line   : 658
    <280>   DW_AT_decl_column : 17
    <281>   DW_AT_type        : <0xc9>
    <285>   DW_AT_data_member_location: 24
 <2><286>: Abbrev Number: 3 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x170c9): CCMR2
    <28b>   DW_AT_decl_file   : 4
    <28c>   DW_AT_decl_line   : 659
    <28e>   DW_AT_decl_column : 17
    <28f>   DW_AT_type        : <0xc9>
    <293>   DW_AT_data_member_location: 28
 <2><294>: Abbrev Number: 3 (DW_TAG_member)
    <295>   DW_AT_name        : (indirect string, offset: 0x3205f): CCER
    <299>   DW_AT_decl_file   : 4
    <29a>   DW_AT_decl_line   : 660
    <29c>   DW_AT_decl_column : 17
    <29d>   DW_AT_type        : <0xc9>
    <2a1>   DW_AT_data_member_location: 32
 <2><2a2>: Abbrev Number: 6 (DW_TAG_member)
    <2a3>   DW_AT_name        : CNT
    <2a7>   DW_AT_decl_file   : 4
    <2a7>   DW_AT_decl_line   : 661
    <2a9>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0xc9>
    <2ad>   DW_AT_data_member_location: 36
 <2><2ae>: Abbrev Number: 6 (DW_TAG_member)
    <2af>   DW_AT_name        : PSC
    <2b3>   DW_AT_decl_file   : 4
    <2b3>   DW_AT_decl_line   : 662
    <2b5>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xc9>
    <2b9>   DW_AT_data_member_location: 40
 <2><2ba>: Abbrev Number: 6 (DW_TAG_member)
    <2bb>   DW_AT_name        : ARR
    <2bf>   DW_AT_decl_file   : 4
    <2bf>   DW_AT_decl_line   : 663
    <2c1>   DW_AT_decl_column : 17
    <2c1>   DW_AT_type        : <0xc9>
    <2c5>   DW_AT_data_member_location: 44
 <2><2c6>: Abbrev Number: 6 (DW_TAG_member)
    <2c7>   DW_AT_name        : RCR
    <2cb>   DW_AT_decl_file   : 4
    <2cb>   DW_AT_decl_line   : 664
    <2cd>   DW_AT_decl_column : 17
    <2cd>   DW_AT_type        : <0xc9>
    <2d1>   DW_AT_data_member_location: 48
 <2><2d2>: Abbrev Number: 3 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x17d0e): CCR1
    <2d7>   DW_AT_decl_file   : 4
    <2d8>   DW_AT_decl_line   : 665
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0xc9>
    <2df>   DW_AT_data_member_location: 52
 <2><2e0>: Abbrev Number: 3 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x55d25): CCR2
    <2e5>   DW_AT_decl_file   : 4
    <2e6>   DW_AT_decl_line   : 666
    <2e8>   DW_AT_decl_column : 17
    <2e9>   DW_AT_type        : <0xc9>
    <2ed>   DW_AT_data_member_location: 56
 <2><2ee>: Abbrev Number: 3 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0xa5c70): CCR3
    <2f3>   DW_AT_decl_file   : 4
    <2f4>   DW_AT_decl_line   : 667
    <2f6>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0xc9>
    <2fb>   DW_AT_data_member_location: 60
 <2><2fc>: Abbrev Number: 3 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x3317): CCR4
    <301>   DW_AT_decl_file   : 4
    <302>   DW_AT_decl_line   : 668
    <304>   DW_AT_decl_column : 17
    <305>   DW_AT_type        : <0xc9>
    <309>   DW_AT_data_member_location: 64
 <2><30a>: Abbrev Number: 3 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x5e46b): BDTR
    <30f>   DW_AT_decl_file   : 4
    <310>   DW_AT_decl_line   : 669
    <312>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xc9>
    <317>   DW_AT_data_member_location: 68
 <2><318>: Abbrev Number: 6 (DW_TAG_member)
    <319>   DW_AT_name        : DCR
    <31d>   DW_AT_decl_file   : 4
    <31d>   DW_AT_decl_line   : 670
    <31f>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0xc9>
    <323>   DW_AT_data_member_location: 72
 <2><324>: Abbrev Number: 3 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x9860e): DMAR
    <329>   DW_AT_decl_file   : 4
    <32a>   DW_AT_decl_line   : 671
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0xc9>
    <331>   DW_AT_data_member_location: 76
 <2><332>: Abbrev Number: 6 (DW_TAG_member)
    <333>   DW_AT_name        : OR
    <336>   DW_AT_decl_file   : 4
    <336>   DW_AT_decl_line   : 672
    <338>   DW_AT_decl_column : 17
    <338>   DW_AT_type        : <0xc9>
    <33c>   DW_AT_data_member_location: 80
 <2><33d>: Abbrev Number: 3 (DW_TAG_member)
    <33e>   DW_AT_name        : (indirect string, offset: 0xb66fc): CCMR3
    <342>   DW_AT_decl_file   : 4
    <343>   DW_AT_decl_line   : 673
    <345>   DW_AT_decl_column : 17
    <346>   DW_AT_type        : <0xc9>
    <34a>   DW_AT_data_member_location: 84
 <2><34b>: Abbrev Number: 3 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0x4a723): CCR5
    <350>   DW_AT_decl_file   : 4
    <351>   DW_AT_decl_line   : 674
    <353>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0xc9>
    <358>   DW_AT_data_member_location: 88
 <2><359>: Abbrev Number: 3 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x910ae): CCR6
    <35e>   DW_AT_decl_file   : 4
    <35f>   DW_AT_decl_line   : 675
    <361>   DW_AT_decl_column : 17
    <362>   DW_AT_type        : <0xc9>
    <366>   DW_AT_data_member_location: 92
 <2><367>: Abbrev Number: 0
 <1><368>: Abbrev Number: 13 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0xc1952): TIM_TypeDef
    <36d>   DW_AT_decl_file   : 4
    <36e>   DW_AT_decl_line   : 676
    <370>   DW_AT_decl_column : 3
    <371>   DW_AT_type        : <0x224>
 <1><375>: Abbrev Number: 20 (DW_TAG_structure_type)
    <376>   DW_AT_byte_size   : 44
    <377>   DW_AT_decl_file   : 4
    <378>   DW_AT_decl_line   : 703
    <37a>   DW_AT_decl_column : 9
    <37a>   DW_AT_sibling     : <0x423>
 <2><37e>: Abbrev Number: 6 (DW_TAG_member)
    <37f>   DW_AT_name        : CR1
    <383>   DW_AT_decl_file   : 4
    <383>   DW_AT_decl_line   : 705
    <385>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xc9>
    <389>   DW_AT_data_member_location: 0
 <2><38a>: Abbrev Number: 6 (DW_TAG_member)
    <38b>   DW_AT_name        : CR2
    <38f>   DW_AT_decl_file   : 4
    <38f>   DW_AT_decl_line   : 706
    <391>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0xc9>
    <395>   DW_AT_data_member_location: 4
 <2><396>: Abbrev Number: 6 (DW_TAG_member)
    <397>   DW_AT_name        : CR3
    <39b>   DW_AT_decl_file   : 4
    <39b>   DW_AT_decl_line   : 707
    <39d>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0xc9>
    <3a1>   DW_AT_data_member_location: 8
 <2><3a2>: Abbrev Number: 6 (DW_TAG_member)
    <3a3>   DW_AT_name        : BRR
    <3a7>   DW_AT_decl_file   : 4
    <3a7>   DW_AT_decl_line   : 708
    <3a9>   DW_AT_decl_column : 17
    <3a9>   DW_AT_type        : <0xc9>
    <3ad>   DW_AT_data_member_location: 12
 <2><3ae>: Abbrev Number: 3 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0x3926d): GTPR
    <3b3>   DW_AT_decl_file   : 4
    <3b4>   DW_AT_decl_line   : 709
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0xc9>
    <3bb>   DW_AT_data_member_location: 16
 <2><3bc>: Abbrev Number: 3 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xb4869): RTOR
    <3c1>   DW_AT_decl_file   : 4
    <3c2>   DW_AT_decl_line   : 710
    <3c4>   DW_AT_decl_column : 17
    <3c5>   DW_AT_type        : <0xc9>
    <3c9>   DW_AT_data_member_location: 20
 <2><3ca>: Abbrev Number: 6 (DW_TAG_member)
    <3cb>   DW_AT_name        : RQR
    <3cf>   DW_AT_decl_file   : 4
    <3cf>   DW_AT_decl_line   : 711
    <3d1>   DW_AT_decl_column : 17
    <3d1>   DW_AT_type        : <0xc9>
    <3d5>   DW_AT_data_member_location: 24
 <2><3d6>: Abbrev Number: 6 (DW_TAG_member)
    <3d7>   DW_AT_name        : ISR
    <3db>   DW_AT_decl_file   : 4
    <3db>   DW_AT_decl_line   : 712
    <3dd>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0xc9>
    <3e1>   DW_AT_data_member_location: 28
 <2><3e2>: Abbrev Number: 6 (DW_TAG_member)
    <3e3>   DW_AT_name        : ICR
    <3e7>   DW_AT_decl_file   : 4
    <3e7>   DW_AT_decl_line   : 713
    <3e9>   DW_AT_decl_column : 17
    <3e9>   DW_AT_type        : <0xc9>
    <3ed>   DW_AT_data_member_location: 32
 <2><3ee>: Abbrev Number: 6 (DW_TAG_member)
    <3ef>   DW_AT_name        : RDR
    <3f3>   DW_AT_decl_file   : 4
    <3f3>   DW_AT_decl_line   : 714
    <3f5>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0xb8>
    <3f9>   DW_AT_data_member_location: 36
 <2><3fa>: Abbrev Number: 3 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0xc0ee5): RESERVED1
    <3ff>   DW_AT_decl_file   : 4
    <400>   DW_AT_decl_line   : 715
    <402>   DW_AT_decl_column : 13
    <403>   DW_AT_type        : <0xac>
    <407>   DW_AT_data_member_location: 38
 <2><408>: Abbrev Number: 6 (DW_TAG_member)
    <409>   DW_AT_name        : TDR
    <40d>   DW_AT_decl_file   : 4
    <40d>   DW_AT_decl_line   : 716
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0xb8>
    <413>   DW_AT_data_member_location: 40
 <2><414>: Abbrev Number: 3 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0xc0eef): RESERVED2
    <419>   DW_AT_decl_file   : 4
    <41a>   DW_AT_decl_line   : 717
    <41c>   DW_AT_decl_column : 13
    <41d>   DW_AT_type        : <0xac>
    <421>   DW_AT_data_member_location: 42
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 13 (DW_TAG_typedef)
    <424>   DW_AT_name        : (indirect string, offset: 0x6e00f): USART_TypeDef
    <428>   DW_AT_decl_file   : 4
    <429>   DW_AT_decl_line   : 718
    <42b>   DW_AT_decl_column : 3
    <42c>   DW_AT_type        : <0x375>
 <1><430>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <431>   DW_AT_encoding    : 7	(unsigned)
    <432>   DW_AT_byte_size   : 1
    <433>   DW_AT_type        : <0x59>
    <437>   DW_AT_decl_file   : 5
    <438>   DW_AT_decl_line   : 50
    <439>   DW_AT_decl_column : 1
    <43a>   DW_AT_sibling     : <0x44b>
 <2><43e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <43f>   DW_AT_name        : (indirect string, offset: 0x97d21): HAL_UNLOCKED
    <443>   DW_AT_const_value : 0
 <2><444>: Abbrev Number: 2 (DW_TAG_enumerator)
    <445>   DW_AT_name        : (indirect string, offset: 0xcbfbb): HAL_LOCKED
    <449>   DW_AT_const_value : 1
 <2><44a>: Abbrev Number: 0
 <1><44b>: Abbrev Number: 4 (DW_TAG_typedef)
    <44c>   DW_AT_name        : (indirect string, offset: 0x74c7f): HAL_LockTypeDef
    <450>   DW_AT_decl_file   : 5
    <451>   DW_AT_decl_line   : 53
    <452>   DW_AT_decl_column : 3
    <453>   DW_AT_type        : <0x430>
 <1><457>: Abbrev Number: 10 (DW_TAG_structure_type)
    <458>   DW_AT_byte_size   : 28
    <459>   DW_AT_decl_file   : 6
    <45a>   DW_AT_decl_line   : 47
    <45b>   DW_AT_decl_column : 9
    <45b>   DW_AT_sibling     : <0x4bb>
 <2><45f>: Abbrev Number: 1 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x4c220): Direction
    <464>   DW_AT_decl_file   : 6
    <465>   DW_AT_decl_line   : 49
    <466>   DW_AT_decl_column : 12
    <467>   DW_AT_type        : <0xbd>
    <46b>   DW_AT_data_member_location: 0
 <2><46c>: Abbrev Number: 1 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0xd200): PeriphInc
    <471>   DW_AT_decl_file   : 6
    <472>   DW_AT_decl_line   : 53
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0xbd>
    <478>   DW_AT_data_member_location: 4
 <2><479>: Abbrev Number: 1 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x1ff11): MemInc
    <47e>   DW_AT_decl_file   : 6
    <47f>   DW_AT_decl_line   : 56
    <480>   DW_AT_decl_column : 12
    <481>   DW_AT_type        : <0xbd>
    <485>   DW_AT_data_member_location: 8
 <2><486>: Abbrev Number: 1 (DW_TAG_member)
    <487>   DW_AT_name        : (indirect string, offset: 0x65f56): PeriphDataAlignment
    <48b>   DW_AT_decl_file   : 6
    <48c>   DW_AT_decl_line   : 59
    <48d>   DW_AT_decl_column : 12
    <48e>   DW_AT_type        : <0xbd>
    <492>   DW_AT_data_member_location: 12
 <2><493>: Abbrev Number: 1 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0xb8d47): MemDataAlignment
    <498>   DW_AT_decl_file   : 6
    <499>   DW_AT_decl_line   : 62
    <49a>   DW_AT_decl_column : 12
    <49b>   DW_AT_type        : <0xbd>
    <49f>   DW_AT_data_member_location: 16
 <2><4a0>: Abbrev Number: 1 (DW_TAG_member)
    <4a1>   DW_AT_name        : (indirect string, offset: 0xcf1ce): Mode
    <4a5>   DW_AT_decl_file   : 6
    <4a6>   DW_AT_decl_line   : 65
    <4a7>   DW_AT_decl_column : 12
    <4a8>   DW_AT_type        : <0xbd>
    <4ac>   DW_AT_data_member_location: 20
 <2><4ad>: Abbrev Number: 1 (DW_TAG_member)
    <4ae>   DW_AT_name        : (indirect string, offset: 0xcfb45): Priority
    <4b2>   DW_AT_decl_file   : 6
    <4b3>   DW_AT_decl_line   : 70
    <4b4>   DW_AT_decl_column : 12
    <4b5>   DW_AT_type        : <0xbd>
    <4b9>   DW_AT_data_member_location: 24
 <2><4ba>: Abbrev Number: 0
 <1><4bb>: Abbrev Number: 4 (DW_TAG_typedef)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x3757e): DMA_InitTypeDef
    <4c0>   DW_AT_decl_file   : 6
    <4c1>   DW_AT_decl_line   : 72
    <4c2>   DW_AT_decl_column : 3
    <4c3>   DW_AT_type        : <0x457>
 <1><4c7>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <4c8>   DW_AT_encoding    : 7	(unsigned)
    <4c9>   DW_AT_byte_size   : 1
    <4ca>   DW_AT_type        : <0x59>
    <4ce>   DW_AT_decl_file   : 6
    <4cf>   DW_AT_decl_line   : 78
    <4d0>   DW_AT_decl_column : 1
    <4d1>   DW_AT_sibling     : <0x4ee>
 <2><4d5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x99023): HAL_DMA_STATE_RESET
    <4da>   DW_AT_const_value : 0
 <2><4db>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x388ca): HAL_DMA_STATE_READY
    <4e0>   DW_AT_const_value : 1
 <2><4e1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x8e37d): HAL_DMA_STATE_BUSY
    <4e6>   DW_AT_const_value : 2
 <2><4e7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4e8>   DW_AT_name        : (indirect string, offset: 0xc91ad): HAL_DMA_STATE_TIMEOUT
    <4ec>   DW_AT_const_value : 3
 <2><4ed>: Abbrev Number: 0
 <1><4ee>: Abbrev Number: 4 (DW_TAG_typedef)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x88816): HAL_DMA_StateTypeDef
    <4f3>   DW_AT_decl_file   : 6
    <4f4>   DW_AT_decl_line   : 83
    <4f5>   DW_AT_decl_column : 2
    <4f6>   DW_AT_type        : <0x4c7>
 <1><4fa>: Abbrev Number: 26 (DW_TAG_structure_type)
    <4fb>   DW_AT_name        : (indirect string, offset: 0xaeb33): __DMA_HandleTypeDef
    <4ff>   DW_AT_byte_size   : 68
    <500>   DW_AT_decl_file   : 6
    <501>   DW_AT_decl_line   : 109
    <502>   DW_AT_decl_column : 16
    <502>   DW_AT_sibling     : <0x5a3>
 <2><506>: Abbrev Number: 1 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x4fdfd): Instance
    <50b>   DW_AT_decl_file   : 6
    <50c>   DW_AT_decl_line   : 111
    <50d>   DW_AT_decl_column : 26
    <50e>   DW_AT_type        : <0x5a3>
    <512>   DW_AT_data_member_location: 0
 <2><513>: Abbrev Number: 1 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0xcd061): Init
    <518>   DW_AT_decl_file   : 6
    <519>   DW_AT_decl_line   : 113
    <51a>   DW_AT_decl_column : 25
    <51b>   DW_AT_type        : <0x4bb>
    <51f>   DW_AT_data_member_location: 4
 <2><520>: Abbrev Number: 1 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x75d83): Lock
    <525>   DW_AT_decl_file   : 6
    <526>   DW_AT_decl_line   : 115
    <527>   DW_AT_decl_column : 25
    <528>   DW_AT_type        : <0x44b>
    <52c>   DW_AT_data_member_location: 32
 <2><52d>: Abbrev Number: 1 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0xcf2ef): State
    <532>   DW_AT_decl_file   : 6
    <533>   DW_AT_decl_line   : 117
    <534>   DW_AT_decl_column : 25
    <535>   DW_AT_type        : <0x4ee>
    <539>   DW_AT_data_member_location: 33
 <2><53a>: Abbrev Number: 1 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0xc27f7): Parent
    <53f>   DW_AT_decl_file   : 6
    <540>   DW_AT_decl_line   : 119
    <541>   DW_AT_decl_column : 26
    <542>   DW_AT_type        : <0xde>
    <546>   DW_AT_data_member_location: 36
 <2><547>: Abbrev Number: 1 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0xcb549): XferCpltCallback
    <54c>   DW_AT_decl_file   : 6
    <54d>   DW_AT_decl_line   : 121
    <54e>   DW_AT_decl_column : 28
    <54f>   DW_AT_type        : <0x5b8>
    <553>   DW_AT_data_member_location: 40
 <2><554>: Abbrev Number: 1 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x9f4f2): XferHalfCpltCallback
    <559>   DW_AT_decl_file   : 6
    <55a>   DW_AT_decl_line   : 123
    <55b>   DW_AT_decl_column : 28
    <55c>   DW_AT_type        : <0x5b8>
    <560>   DW_AT_data_member_location: 44
 <2><561>: Abbrev Number: 1 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x1d1d2): XferErrorCallback
    <566>   DW_AT_decl_file   : 6
    <567>   DW_AT_decl_line   : 125
    <568>   DW_AT_decl_column : 28
    <569>   DW_AT_type        : <0x5b8>
    <56d>   DW_AT_data_member_location: 48
 <2><56e>: Abbrev Number: 1 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0x6f1b3): XferAbortCallback
    <573>   DW_AT_decl_file   : 6
    <574>   DW_AT_decl_line   : 127
    <575>   DW_AT_decl_column : 28
    <576>   DW_AT_type        : <0x5b8>
    <57a>   DW_AT_data_member_location: 52
 <2><57b>: Abbrev Number: 1 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0xc7b9b): ErrorCode
    <580>   DW_AT_decl_file   : 6
    <581>   DW_AT_decl_line   : 129
    <582>   DW_AT_decl_column : 25
    <583>   DW_AT_type        : <0xc9>
    <587>   DW_AT_data_member_location: 56
 <2><588>: Abbrev Number: 1 (DW_TAG_member)
    <589>   DW_AT_name        : (indirect string, offset: 0x5745e): DmaBaseAddress
    <58d>   DW_AT_decl_file   : 6
    <58e>   DW_AT_decl_line   : 131
    <58f>   DW_AT_decl_column : 25
    <590>   DW_AT_type        : <0x5bd>
    <594>   DW_AT_data_member_location: 60
 <2><595>: Abbrev Number: 1 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x29eed): ChannelIndex
    <59a>   DW_AT_decl_file   : 6
    <59b>   DW_AT_decl_line   : 133
    <59c>   DW_AT_decl_column : 25
    <59d>   DW_AT_type        : <0xbd>
    <5a1>   DW_AT_data_member_location: 64
 <2><5a2>: Abbrev Number: 0
 <1><5a3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a4>   DW_AT_byte_size   : 4
    <5a4>   DW_AT_type        : <0x136>
 <1><5a8>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <5a9>   DW_AT_prototyped  : 1
    <5a9>   DW_AT_sibling     : <0x5b3>
 <2><5ad>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <5ae>   DW_AT_type        : <0x5b3>
 <2><5b2>: Abbrev Number: 0
 <1><5b3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5b4>   DW_AT_byte_size   : 4
    <5b4>   DW_AT_type        : <0x4fa>
 <1><5b8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5b9>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x5a8>
 <1><5bd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5be>   DW_AT_byte_size   : 4
    <5be>   DW_AT_type        : <0x167>
 <1><5c2>: Abbrev Number: 4 (DW_TAG_typedef)
    <5c3>   DW_AT_name        : (indirect string, offset: 0xaeb35): DMA_HandleTypeDef
    <5c7>   DW_AT_decl_file   : 6
    <5c8>   DW_AT_decl_line   : 134
    <5c9>   DW_AT_decl_column : 3
    <5ca>   DW_AT_type        : <0x4fa>
 <1><5ce>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5cf>   DW_AT_byte_size   : 4
    <5cf>   DW_AT_type        : <0x5c2>
 <1><5d3>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5d4>   DW_AT_byte_size   : 24
    <5d5>   DW_AT_decl_file   : 7
    <5d6>   DW_AT_decl_line   : 46
    <5d7>   DW_AT_decl_column : 9
    <5d7>   DW_AT_sibling     : <0x62a>
 <2><5db>: Abbrev Number: 1 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0xcd8da): Prescaler
    <5e0>   DW_AT_decl_file   : 7
    <5e1>   DW_AT_decl_line   : 48
    <5e2>   DW_AT_decl_column : 12
    <5e3>   DW_AT_type        : <0xbd>
    <5e7>   DW_AT_data_member_location: 0
 <2><5e8>: Abbrev Number: 1 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0xb9bd1): CounterMode
    <5ed>   DW_AT_decl_file   : 7
    <5ee>   DW_AT_decl_line   : 51
    <5ef>   DW_AT_decl_column : 12
    <5f0>   DW_AT_type        : <0xbd>
    <5f4>   DW_AT_data_member_location: 4
 <2><5f5>: Abbrev Number: 1 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xd6c13): Period
    <5fa>   DW_AT_decl_file   : 7
    <5fb>   DW_AT_decl_line   : 54
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xbd>
    <601>   DW_AT_data_member_location: 8
 <2><602>: Abbrev Number: 1 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0x5330c): ClockDivision
    <607>   DW_AT_decl_file   : 7
    <608>   DW_AT_decl_line   : 58
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xbd>
    <60e>   DW_AT_data_member_location: 12
 <2><60f>: Abbrev Number: 1 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x8fbb7): RepetitionCounter
    <614>   DW_AT_decl_file   : 7
    <615>   DW_AT_decl_line   : 61
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xbd>
    <61b>   DW_AT_data_member_location: 16
 <2><61c>: Abbrev Number: 1 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x139ae): AutoReloadPreload
    <621>   DW_AT_decl_file   : 7
    <622>   DW_AT_decl_line   : 72
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xbd>
    <628>   DW_AT_data_member_location: 20
 <2><629>: Abbrev Number: 0
 <1><62a>: Abbrev Number: 4 (DW_TAG_typedef)
    <62b>   DW_AT_name        : (indirect string, offset: 0x46d69): TIM_Base_InitTypeDef
    <62f>   DW_AT_decl_file   : 7
    <630>   DW_AT_decl_line   : 74
    <631>   DW_AT_decl_column : 3
    <632>   DW_AT_type        : <0x5d3>
 <1><636>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <637>   DW_AT_encoding    : 7	(unsigned)
    <637>   DW_AT_byte_size   : 1
    <637>   DW_AT_type        : <0x59>
    <63b>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 305
    <63d>   DW_AT_decl_column : 1
    <63d>   DW_AT_sibling     : <0x660>
 <2><641>: Abbrev Number: 2 (DW_TAG_enumerator)
    <642>   DW_AT_name        : (indirect string, offset: 0x676ce): HAL_TIM_STATE_RESET
    <646>   DW_AT_const_value : 0
 <2><647>: Abbrev Number: 2 (DW_TAG_enumerator)
    <648>   DW_AT_name        : (indirect string, offset: 0x7534): HAL_TIM_STATE_READY
    <64c>   DW_AT_const_value : 1
 <2><64d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <64e>   DW_AT_name        : (indirect string, offset: 0x34001): HAL_TIM_STATE_BUSY
    <652>   DW_AT_const_value : 2
 <2><653>: Abbrev Number: 2 (DW_TAG_enumerator)
    <654>   DW_AT_name        : (indirect string, offset: 0xab566): HAL_TIM_STATE_TIMEOUT
    <658>   DW_AT_const_value : 3
 <2><659>: Abbrev Number: 2 (DW_TAG_enumerator)
    <65a>   DW_AT_name        : (indirect string, offset: 0x7e31d): HAL_TIM_STATE_ERROR
    <65e>   DW_AT_const_value : 4
 <2><65f>: Abbrev Number: 0
 <1><660>: Abbrev Number: 13 (DW_TAG_typedef)
    <661>   DW_AT_name        : (indirect string, offset: 0x94efd): HAL_TIM_StateTypeDef
    <665>   DW_AT_decl_file   : 7
    <666>   DW_AT_decl_line   : 311
    <668>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x636>
 <1><66d>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <66e>   DW_AT_type        : <0x660>
 <1><672>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <673>   DW_AT_encoding    : 7	(unsigned)
    <673>   DW_AT_byte_size   : 1
    <673>   DW_AT_type        : <0x59>
    <677>   DW_AT_decl_file   : 7
    <677>   DW_AT_decl_line   : 317
    <679>   DW_AT_decl_column : 1
    <679>   DW_AT_sibling     : <0x690>
 <2><67d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <67e>   DW_AT_name        : (indirect string, offset: 0xaf41): HAL_TIM_CHANNEL_STATE_RESET
    <682>   DW_AT_const_value : 0
 <2><683>: Abbrev Number: 2 (DW_TAG_enumerator)
    <684>   DW_AT_name        : (indirect string, offset: 0x9d9e8): HAL_TIM_CHANNEL_STATE_READY
    <688>   DW_AT_const_value : 1
 <2><689>: Abbrev Number: 2 (DW_TAG_enumerator)
    <68a>   DW_AT_name        : (indirect string, offset: 0x62d05): HAL_TIM_CHANNEL_STATE_BUSY
    <68e>   DW_AT_const_value : 2
 <2><68f>: Abbrev Number: 0
 <1><690>: Abbrev Number: 13 (DW_TAG_typedef)
    <691>   DW_AT_name        : (indirect string, offset: 0x2a5e1): HAL_TIM_ChannelStateTypeDef
    <695>   DW_AT_decl_file   : 7
    <696>   DW_AT_decl_line   : 321
    <698>   DW_AT_decl_column : 3
    <699>   DW_AT_type        : <0x672>
 <1><69d>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <69e>   DW_AT_type        : <0x690>
 <1><6a2>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <6a3>   DW_AT_encoding    : 7	(unsigned)
    <6a3>   DW_AT_byte_size   : 1
    <6a3>   DW_AT_type        : <0x59>
    <6a7>   DW_AT_decl_file   : 7
    <6a7>   DW_AT_decl_line   : 327
    <6a9>   DW_AT_decl_column : 1
    <6a9>   DW_AT_sibling     : <0x6c0>
 <2><6ad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x4051): HAL_DMA_BURST_STATE_RESET
    <6b2>   DW_AT_const_value : 0
 <2><6b3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x71397): HAL_DMA_BURST_STATE_READY
    <6b8>   DW_AT_const_value : 1
 <2><6b9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9a2b1): HAL_DMA_BURST_STATE_BUSY
    <6be>   DW_AT_const_value : 2
 <2><6bf>: Abbrev Number: 0
 <1><6c0>: Abbrev Number: 13 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x1b7e0): HAL_TIM_DMABurstStateTypeDef
    <6c5>   DW_AT_decl_file   : 7
    <6c6>   DW_AT_decl_line   : 331
    <6c8>   DW_AT_decl_column : 3
    <6c9>   DW_AT_type        : <0x6a2>
 <1><6cd>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <6ce>   DW_AT_type        : <0x6c0>
 <1><6d2>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <6d3>   DW_AT_encoding    : 7	(unsigned)
    <6d3>   DW_AT_byte_size   : 1
    <6d3>   DW_AT_type        : <0x59>
    <6d7>   DW_AT_decl_file   : 7
    <6d7>   DW_AT_decl_line   : 337
    <6d9>   DW_AT_decl_column : 1
    <6d9>   DW_AT_sibling     : <0x708>
 <2><6dd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0x739bb): HAL_TIM_ACTIVE_CHANNEL_1
    <6e2>   DW_AT_const_value : 1
 <2><6e3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x739d4): HAL_TIM_ACTIVE_CHANNEL_2
    <6e8>   DW_AT_const_value : 2
 <2><6e9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x739ed): HAL_TIM_ACTIVE_CHANNEL_3
    <6ee>   DW_AT_const_value : 4
 <2><6ef>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x73a06): HAL_TIM_ACTIVE_CHANNEL_4
    <6f4>   DW_AT_const_value : 8
 <2><6f5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xafdb): HAL_TIM_ACTIVE_CHANNEL_5
    <6fa>   DW_AT_const_value : 16
 <2><6fb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x73a3f): HAL_TIM_ACTIVE_CHANNEL_6
    <700>   DW_AT_const_value : 32
 <2><701>: Abbrev Number: 2 (DW_TAG_enumerator)
    <702>   DW_AT_name        : (indirect string, offset: 0x5456b): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <706>   DW_AT_const_value : 0
 <2><707>: Abbrev Number: 0
 <1><708>: Abbrev Number: 13 (DW_TAG_typedef)
    <709>   DW_AT_name        : (indirect string, offset: 0x6aa48): HAL_TIM_ActiveChannel
    <70d>   DW_AT_decl_file   : 7
    <70e>   DW_AT_decl_line   : 349
    <710>   DW_AT_decl_column : 3
    <711>   DW_AT_type        : <0x6d2>
 <1><715>: Abbrev Number: 20 (DW_TAG_structure_type)
    <716>   DW_AT_byte_size   : 76
    <717>   DW_AT_decl_file   : 7
    <718>   DW_AT_decl_line   : 357
    <71a>   DW_AT_decl_column : 9
    <71a>   DW_AT_sibling     : <0x79d>
 <2><71e>: Abbrev Number: 3 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x4fdfd): Instance
    <723>   DW_AT_decl_file   : 7
    <724>   DW_AT_decl_line   : 360
    <726>   DW_AT_decl_column : 39
    <727>   DW_AT_type        : <0x79d>
    <72b>   DW_AT_data_member_location: 0
 <2><72c>: Abbrev Number: 3 (DW_TAG_member)
    <72d>   DW_AT_name        : (indirect string, offset: 0xcd061): Init
    <731>   DW_AT_decl_file   : 7
    <732>   DW_AT_decl_line   : 361
    <734>   DW_AT_decl_column : 38
    <735>   DW_AT_type        : <0x62a>
    <739>   DW_AT_data_member_location: 4
 <2><73a>: Abbrev Number: 3 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x421a5): Channel
    <73f>   DW_AT_decl_file   : 7
    <740>   DW_AT_decl_line   : 362
    <742>   DW_AT_decl_column : 38
    <743>   DW_AT_type        : <0x708>
    <747>   DW_AT_data_member_location: 28
 <2><748>: Abbrev Number: 3 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0x7ace9): hdma
    <74d>   DW_AT_decl_file   : 7
    <74e>   DW_AT_decl_line   : 363
    <750>   DW_AT_decl_column : 39
    <751>   DW_AT_type        : <0x7a2>
    <755>   DW_AT_data_member_location: 32
 <2><756>: Abbrev Number: 3 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x75d83): Lock
    <75b>   DW_AT_decl_file   : 7
    <75c>   DW_AT_decl_line   : 365
    <75e>   DW_AT_decl_column : 38
    <75f>   DW_AT_type        : <0x44b>
    <763>   DW_AT_data_member_location: 60
 <2><764>: Abbrev Number: 3 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0xcf2ef): State
    <769>   DW_AT_decl_file   : 7
    <76a>   DW_AT_decl_line   : 366
    <76c>   DW_AT_decl_column : 38
    <76d>   DW_AT_type        : <0x66d>
    <771>   DW_AT_data_member_location: 61
 <2><772>: Abbrev Number: 3 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xd0f01): ChannelState
    <777>   DW_AT_decl_file   : 7
    <778>   DW_AT_decl_line   : 367
    <77a>   DW_AT_decl_column : 38
    <77b>   DW_AT_type        : <0x7c2>
    <77f>   DW_AT_data_member_location: 62
 <2><780>: Abbrev Number: 3 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0xd13ea): ChannelNState
    <785>   DW_AT_decl_file   : 7
    <786>   DW_AT_decl_line   : 368
    <788>   DW_AT_decl_column : 38
    <789>   DW_AT_type        : <0x7d7>
    <78d>   DW_AT_data_member_location: 68
 <2><78e>: Abbrev Number: 3 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0xd0aea): DMABurstState
    <793>   DW_AT_decl_file   : 7
    <794>   DW_AT_decl_line   : 369
    <796>   DW_AT_decl_column : 38
    <797>   DW_AT_type        : <0x6cd>
    <79b>   DW_AT_data_member_location: 72
 <2><79c>: Abbrev Number: 0
 <1><79d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <79e>   DW_AT_byte_size   : 4
    <79e>   DW_AT_type        : <0x368>
 <1><7a2>: Abbrev Number: 21 (DW_TAG_array_type)
    <7a3>   DW_AT_type        : <0x5ce>
    <7a7>   DW_AT_sibling     : <0x7b2>
 <2><7ab>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <7ac>   DW_AT_type        : <0x31>
    <7b0>   DW_AT_upper_bound : 6
 <2><7b1>: Abbrev Number: 0
 <1><7b2>: Abbrev Number: 21 (DW_TAG_array_type)
    <7b3>   DW_AT_type        : <0x69d>
    <7b7>   DW_AT_sibling     : <0x7c2>
 <2><7bb>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <7bc>   DW_AT_type        : <0x31>
    <7c0>   DW_AT_upper_bound : 5
 <2><7c1>: Abbrev Number: 0
 <1><7c2>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <7c3>   DW_AT_type        : <0x7b2>
 <1><7c7>: Abbrev Number: 21 (DW_TAG_array_type)
    <7c8>   DW_AT_type        : <0x69d>
    <7cc>   DW_AT_sibling     : <0x7d7>
 <2><7d0>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <7d1>   DW_AT_type        : <0x31>
    <7d5>   DW_AT_upper_bound : 3
 <2><7d6>: Abbrev Number: 0
 <1><7d7>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <7d8>   DW_AT_type        : <0x7c7>
 <1><7dc>: Abbrev Number: 13 (DW_TAG_typedef)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x46777): TIM_HandleTypeDef
    <7e1>   DW_AT_decl_file   : 7
    <7e2>   DW_AT_decl_line   : 403
    <7e4>   DW_AT_decl_column : 3
    <7e5>   DW_AT_type        : <0x715>
 <1><7e9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7ea>   DW_AT_byte_size   : 32
    <7eb>   DW_AT_decl_file   : 8
    <7ec>   DW_AT_decl_line   : 46
    <7ed>   DW_AT_decl_column : 9
    <7ed>   DW_AT_sibling     : <0x85a>
 <2><7f1>: Abbrev Number: 1 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xbb1f4): BaudRate
    <7f6>   DW_AT_decl_file   : 8
    <7f7>   DW_AT_decl_line   : 48
    <7f8>   DW_AT_decl_column : 12
    <7f9>   DW_AT_type        : <0xbd>
    <7fd>   DW_AT_data_member_location: 0
 <2><7fe>: Abbrev Number: 1 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x5e3d): WordLength
    <803>   DW_AT_decl_file   : 8
    <804>   DW_AT_decl_line   : 60
    <805>   DW_AT_decl_column : 12
    <806>   DW_AT_type        : <0xbd>
    <80a>   DW_AT_data_member_location: 4
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0xbb536): StopBits
    <810>   DW_AT_decl_file   : 8
    <811>   DW_AT_decl_line   : 63
    <812>   DW_AT_decl_column : 12
    <813>   DW_AT_type        : <0xbd>
    <817>   DW_AT_data_member_location: 8
 <2><818>: Abbrev Number: 1 (DW_TAG_member)
    <819>   DW_AT_name        : (indirect string, offset: 0x4a284): Parity
    <81d>   DW_AT_decl_file   : 8
    <81e>   DW_AT_decl_line   : 66
    <81f>   DW_AT_decl_column : 12
    <820>   DW_AT_type        : <0xbd>
    <824>   DW_AT_data_member_location: 12
 <2><825>: Abbrev Number: 1 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0xcf1ce): Mode
    <82a>   DW_AT_decl_file   : 8
    <82b>   DW_AT_decl_line   : 73
    <82c>   DW_AT_decl_column : 12
    <82d>   DW_AT_type        : <0xbd>
    <831>   DW_AT_data_member_location: 16
 <2><832>: Abbrev Number: 1 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0x79276): HwFlowCtl
    <837>   DW_AT_decl_file   : 8
    <838>   DW_AT_decl_line   : 76
    <839>   DW_AT_decl_column : 12
    <83a>   DW_AT_type        : <0xbd>
    <83e>   DW_AT_data_member_location: 20
 <2><83f>: Abbrev Number: 1 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0xac2b1): OverSampling
    <844>   DW_AT_decl_file   : 8
    <845>   DW_AT_decl_line   : 80
    <846>   DW_AT_decl_column : 12
    <847>   DW_AT_type        : <0xbd>
    <84b>   DW_AT_data_member_location: 24
 <2><84c>: Abbrev Number: 1 (DW_TAG_member)
    <84d>   DW_AT_name        : (indirect string, offset: 0x29177): OneBitSampling
    <851>   DW_AT_decl_file   : 8
    <852>   DW_AT_decl_line   : 84
    <853>   DW_AT_decl_column : 12
    <854>   DW_AT_type        : <0xbd>
    <858>   DW_AT_data_member_location: 28
 <2><859>: Abbrev Number: 0
 <1><85a>: Abbrev Number: 4 (DW_TAG_typedef)
    <85b>   DW_AT_name        : (indirect string, offset: 0x39cdd): UART_InitTypeDef
    <85f>   DW_AT_decl_file   : 8
    <860>   DW_AT_decl_line   : 89
    <861>   DW_AT_decl_column : 3
    <862>   DW_AT_type        : <0x7e9>
 <1><866>: Abbrev Number: 10 (DW_TAG_structure_type)
    <867>   DW_AT_byte_size   : 40
    <868>   DW_AT_decl_file   : 8
    <869>   DW_AT_decl_line   : 94
    <86a>   DW_AT_decl_column : 9
    <86a>   DW_AT_sibling     : <0x8f1>
 <2><86e>: Abbrev Number: 1 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0x7e0ab): AdvFeatureInit
    <873>   DW_AT_decl_file   : 8
    <874>   DW_AT_decl_line   : 96
    <875>   DW_AT_decl_column : 12
    <876>   DW_AT_type        : <0xbd>
    <87a>   DW_AT_data_member_location: 0
 <2><87b>: Abbrev Number: 1 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0xbe85c): TxPinLevelInvert
    <880>   DW_AT_decl_file   : 8
    <881>   DW_AT_decl_line   : 101
    <882>   DW_AT_decl_column : 12
    <883>   DW_AT_type        : <0xbd>
    <887>   DW_AT_data_member_location: 4
 <2><888>: Abbrev Number: 1 (DW_TAG_member)
    <889>   DW_AT_name        : (indirect string, offset: 0xac736): RxPinLevelInvert
    <88d>   DW_AT_decl_file   : 8
    <88e>   DW_AT_decl_line   : 104
    <88f>   DW_AT_decl_column : 12
    <890>   DW_AT_type        : <0xbd>
    <894>   DW_AT_data_member_location: 8
 <2><895>: Abbrev Number: 1 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0x89d0a): DataInvert
    <89a>   DW_AT_decl_file   : 8
    <89b>   DW_AT_decl_line   : 107
    <89c>   DW_AT_decl_column : 12
    <89d>   DW_AT_type        : <0xbd>
    <8a1>   DW_AT_data_member_location: 12
 <2><8a2>: Abbrev Number: 1 (DW_TAG_member)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x40e23): Swap
    <8a7>   DW_AT_decl_file   : 8
    <8a8>   DW_AT_decl_line   : 111
    <8a9>   DW_AT_decl_column : 12
    <8aa>   DW_AT_type        : <0xbd>
    <8ae>   DW_AT_data_member_location: 16
 <2><8af>: Abbrev Number: 1 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x9ed37): OverrunDisable
    <8b4>   DW_AT_decl_file   : 8
    <8b5>   DW_AT_decl_line   : 114
    <8b6>   DW_AT_decl_column : 12
    <8b7>   DW_AT_type        : <0xbd>
    <8bb>   DW_AT_data_member_location: 20
 <2><8bc>: Abbrev Number: 1 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x41f0d): DMADisableonRxError
    <8c1>   DW_AT_decl_file   : 8
    <8c2>   DW_AT_decl_line   : 117
    <8c3>   DW_AT_decl_column : 12
    <8c4>   DW_AT_type        : <0xbd>
    <8c8>   DW_AT_data_member_location: 24
 <2><8c9>: Abbrev Number: 1 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xc76a5): AutoBaudRateEnable
    <8ce>   DW_AT_decl_file   : 8
    <8cf>   DW_AT_decl_line   : 120
    <8d0>   DW_AT_decl_column : 12
    <8d1>   DW_AT_type        : <0xbd>
    <8d5>   DW_AT_data_member_location: 28
 <2><8d6>: Abbrev Number: 1 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0xae49d): AutoBaudRateMode
    <8db>   DW_AT_decl_file   : 8
    <8dc>   DW_AT_decl_line   : 123
    <8dd>   DW_AT_decl_column : 12
    <8de>   DW_AT_type        : <0xbd>
    <8e2>   DW_AT_data_member_location: 32
 <2><8e3>: Abbrev Number: 1 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x5a678): MSBFirst
    <8e8>   DW_AT_decl_file   : 8
    <8e9>   DW_AT_decl_line   : 127
    <8ea>   DW_AT_decl_column : 12
    <8eb>   DW_AT_type        : <0xbd>
    <8ef>   DW_AT_data_member_location: 36
 <2><8f0>: Abbrev Number: 0
 <1><8f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x98cb1): UART_AdvFeatureInitTypeDef
    <8f6>   DW_AT_decl_file   : 8
    <8f7>   DW_AT_decl_line   : 129
    <8f8>   DW_AT_decl_column : 3
    <8f9>   DW_AT_type        : <0x866>
 <1><8fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x3e5ec): HAL_UART_StateTypeDef
    <902>   DW_AT_decl_file   : 8
    <903>   DW_AT_decl_line   : 171
    <904>   DW_AT_decl_column : 18
    <905>   DW_AT_type        : <0xbd>
 <1><909>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <90a>   DW_AT_type        : <0x8fd>
 <1><90e>: Abbrev Number: 4 (DW_TAG_typedef)
    <90f>   DW_AT_name        : (indirect string, offset: 0x53c60): HAL_UART_RxTypeTypeDef
    <913>   DW_AT_decl_file   : 8
    <914>   DW_AT_decl_line   : 195
    <915>   DW_AT_decl_column : 18
    <916>   DW_AT_type        : <0xbd>
 <1><91a>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <91b>   DW_AT_type        : <0x90e>
 <1><91f>: Abbrev Number: 4 (DW_TAG_typedef)
    <920>   DW_AT_name        : (indirect string, offset: 0x19067): HAL_UART_RxEventTypeTypeDef
    <924>   DW_AT_decl_file   : 8
    <925>   DW_AT_decl_line   : 206
    <926>   DW_AT_decl_column : 18
    <927>   DW_AT_type        : <0xbd>
 <1><92b>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <92c>   DW_AT_type        : <0x91f>
 <1><930>: Abbrev Number: 26 (DW_TAG_structure_type)
    <931>   DW_AT_name        : (indirect string, offset: 0x76cc4): __UART_HandleTypeDef
    <935>   DW_AT_byte_size   : 136
    <936>   DW_AT_decl_file   : 8
    <937>   DW_AT_decl_line   : 211
    <938>   DW_AT_decl_column : 16
    <938>   DW_AT_sibling     : <0xa41>
 <2><93c>: Abbrev Number: 1 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0x4fdfd): Instance
    <941>   DW_AT_decl_file   : 8
    <942>   DW_AT_decl_line   : 213
    <943>   DW_AT_decl_column : 29
    <944>   DW_AT_type        : <0xa41>
    <948>   DW_AT_data_member_location: 0
 <2><949>: Abbrev Number: 1 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0xcd061): Init
    <94e>   DW_AT_decl_file   : 8
    <94f>   DW_AT_decl_line   : 215
    <950>   DW_AT_decl_column : 28
    <951>   DW_AT_type        : <0x85a>
    <955>   DW_AT_data_member_location: 4
 <2><956>: Abbrev Number: 1 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0xa0254): AdvancedInit
    <95b>   DW_AT_decl_file   : 8
    <95c>   DW_AT_decl_line   : 217
    <95d>   DW_AT_decl_column : 30
    <95e>   DW_AT_type        : <0x8f1>
    <962>   DW_AT_data_member_location: 36
 <2><963>: Abbrev Number: 1 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x6236d): pTxBuffPtr
    <968>   DW_AT_decl_file   : 8
    <969>   DW_AT_decl_line   : 219
    <96a>   DW_AT_decl_column : 29
    <96b>   DW_AT_type        : <0xa46>
    <96f>   DW_AT_data_member_location: 76
 <2><970>: Abbrev Number: 1 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x5645b): TxXferSize
    <975>   DW_AT_decl_file   : 8
    <976>   DW_AT_decl_line   : 221
    <977>   DW_AT_decl_column : 28
    <978>   DW_AT_type        : <0xac>
    <97c>   DW_AT_data_member_location: 80
 <2><97d>: Abbrev Number: 1 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x705e5): TxXferCount
    <982>   DW_AT_decl_file   : 8
    <983>   DW_AT_decl_line   : 223
    <984>   DW_AT_decl_column : 28
    <985>   DW_AT_type        : <0xb8>
    <989>   DW_AT_data_member_location: 82
 <2><98a>: Abbrev Number: 1 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0xbe03f): pRxBuffPtr
    <98f>   DW_AT_decl_file   : 8
    <990>   DW_AT_decl_line   : 225
    <991>   DW_AT_decl_column : 29
    <992>   DW_AT_type        : <0xe0>
    <996>   DW_AT_data_member_location: 84
 <2><997>: Abbrev Number: 1 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0x61b9b): RxXferSize
    <99c>   DW_AT_decl_file   : 8
    <99d>   DW_AT_decl_line   : 227
    <99e>   DW_AT_decl_column : 28
    <99f>   DW_AT_type        : <0xac>
    <9a3>   DW_AT_data_member_location: 88
 <2><9a4>: Abbrev Number: 1 (DW_TAG_member)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x153ee): RxXferCount
    <9a9>   DW_AT_decl_file   : 8
    <9aa>   DW_AT_decl_line   : 229
    <9ab>   DW_AT_decl_column : 28
    <9ac>   DW_AT_type        : <0xb8>
    <9b0>   DW_AT_data_member_location: 90
 <2><9b1>: Abbrev Number: 1 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0xd1567): Mask
    <9b6>   DW_AT_decl_file   : 8
    <9b7>   DW_AT_decl_line   : 231
    <9b8>   DW_AT_decl_column : 28
    <9b9>   DW_AT_type        : <0xac>
    <9bd>   DW_AT_data_member_location: 92
 <2><9be>: Abbrev Number: 1 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0xaafea): ReceptionType
    <9c3>   DW_AT_decl_file   : 8
    <9c4>   DW_AT_decl_line   : 233
    <9c5>   DW_AT_decl_column : 31
    <9c6>   DW_AT_type        : <0x91a>
    <9ca>   DW_AT_data_member_location: 96
 <2><9cb>: Abbrev Number: 1 (DW_TAG_member)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xd1d0a): RxEventType
    <9d0>   DW_AT_decl_file   : 8
    <9d1>   DW_AT_decl_line   : 235
    <9d2>   DW_AT_decl_column : 36
    <9d3>   DW_AT_type        : <0x92b>
    <9d7>   DW_AT_data_member_location: 100
 <2><9d8>: Abbrev Number: 1 (DW_TAG_member)
    <9d9>   DW_AT_name        : (indirect string, offset: 0xb0a91): RxISR
    <9dd>   DW_AT_decl_file   : 8
    <9de>   DW_AT_decl_line   : 237
    <9df>   DW_AT_decl_column : 10
    <9e0>   DW_AT_type        : <0xa5b>
    <9e4>   DW_AT_data_member_location: 104
 <2><9e5>: Abbrev Number: 1 (DW_TAG_member)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x66b25): TxISR
    <9ea>   DW_AT_decl_file   : 8
    <9eb>   DW_AT_decl_line   : 239
    <9ec>   DW_AT_decl_column : 10
    <9ed>   DW_AT_type        : <0xa5b>
    <9f1>   DW_AT_data_member_location: 108
 <2><9f2>: Abbrev Number: 1 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xc6fd2): hdmatx
    <9f7>   DW_AT_decl_file   : 8
    <9f8>   DW_AT_decl_line   : 241
    <9f9>   DW_AT_decl_column : 29
    <9fa>   DW_AT_type        : <0x5ce>
    <9fe>   DW_AT_data_member_location: 112
 <2><9ff>: Abbrev Number: 1 (DW_TAG_member)
    <a00>   DW_AT_name        : (indirect string, offset: 0xc63d9): hdmarx
    <a04>   DW_AT_decl_file   : 8
    <a05>   DW_AT_decl_line   : 243
    <a06>   DW_AT_decl_column : 29
    <a07>   DW_AT_type        : <0x5ce>
    <a0b>   DW_AT_data_member_location: 116
 <2><a0c>: Abbrev Number: 1 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x75d83): Lock
    <a11>   DW_AT_decl_file   : 8
    <a12>   DW_AT_decl_line   : 245
    <a13>   DW_AT_decl_column : 29
    <a14>   DW_AT_type        : <0x44b>
    <a18>   DW_AT_data_member_location: 120
 <2><a19>: Abbrev Number: 1 (DW_TAG_member)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x5328a): gState
    <a1e>   DW_AT_decl_file   : 8
    <a1f>   DW_AT_decl_line   : 247
    <a20>   DW_AT_decl_column : 33
    <a21>   DW_AT_type        : <0x909>
    <a25>   DW_AT_data_member_location: 124
 <2><a26>: Abbrev Number: 1 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0xb8659): RxState
    <a2b>   DW_AT_decl_file   : 8
    <a2c>   DW_AT_decl_line   : 251
    <a2d>   DW_AT_decl_column : 33
    <a2e>   DW_AT_type        : <0x909>
    <a32>   DW_AT_data_member_location: 128
 <2><a33>: Abbrev Number: 1 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0xc7b9b): ErrorCode
    <a38>   DW_AT_decl_file   : 8
    <a39>   DW_AT_decl_line   : 254
    <a3a>   DW_AT_decl_column : 33
    <a3b>   DW_AT_type        : <0xc9>
    <a3f>   DW_AT_data_member_location: 132
 <2><a40>: Abbrev Number: 0
 <1><a41>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a42>   DW_AT_byte_size   : 4
    <a42>   DW_AT_type        : <0x423>
 <1><a46>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a47>   DW_AT_byte_size   : 4
    <a47>   DW_AT_type        : <0xa7>
 <1><a4b>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <a4c>   DW_AT_prototyped  : 1
    <a4c>   DW_AT_sibling     : <0xa56>
 <2><a50>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <a51>   DW_AT_type        : <0xa56>
 <2><a55>: Abbrev Number: 0
 <1><a56>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a57>   DW_AT_byte_size   : 4
    <a57>   DW_AT_type        : <0x930>
 <1><a5b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a5c>   DW_AT_byte_size   : 4
    <a5c>   DW_AT_type        : <0xa4b>
 <1><a60>: Abbrev Number: 13 (DW_TAG_typedef)
    <a61>   DW_AT_name        : (indirect string, offset: 0x76cc6): UART_HandleTypeDef
    <a65>   DW_AT_decl_file   : 8
    <a66>   DW_AT_decl_line   : 272
    <a68>   DW_AT_decl_column : 3
    <a69>   DW_AT_type        : <0x930>
 <1><a6d>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <a6e>   DW_AT_encoding    : 5	(signed)
    <a6f>   DW_AT_byte_size   : 4
    <a70>   DW_AT_type        : <0x2a>
    <a74>   DW_AT_decl_file   : 9
    <a75>   DW_AT_decl_line   : 82
    <a76>   DW_AT_decl_column : 14
    <a77>   DW_AT_sibling     : <0xbb9>
 <2><a7b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x3cf70): osPriorityNone
    <a80>   DW_AT_const_value : 0
 <2><a81>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0xb1f07): osPriorityIdle
    <a86>   DW_AT_const_value : 1
 <2><a87>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0xbc935): osPriorityLow
    <a8c>   DW_AT_const_value : 8
 <2><a8d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xa3b22): osPriorityLow1
    <a92>   DW_AT_const_value : 9
 <2><a93>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0xc213c): osPriorityLow2
    <a98>   DW_AT_const_value : 10
 <2><a99>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0xc214b): osPriorityLow3
    <a9e>   DW_AT_const_value : 11
 <2><a9f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0xc215a): osPriorityLow4
    <aa4>   DW_AT_const_value : 12
 <2><aa5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0xc2169): osPriorityLow5
    <aaa>   DW_AT_const_value : 13
 <2><aab>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0xc2178): osPriorityLow6
    <ab0>   DW_AT_const_value : 14
 <2><ab1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0xc2187): osPriorityLow7
    <ab6>   DW_AT_const_value : 15
 <2><ab7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xc4947): osPriorityBelowNormal
    <abc>   DW_AT_const_value : 16
 <2><abd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x7acd2): osPriorityBelowNormal1
    <ac2>   DW_AT_const_value : 17
 <2><ac3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xae091): osPriorityBelowNormal2
    <ac8>   DW_AT_const_value : 18
 <2><ac9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aca>   DW_AT_name        : (indirect string, offset: 0x8bdb7): osPriorityBelowNormal3
    <ace>   DW_AT_const_value : 19
 <2><acf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ad0>   DW_AT_name        : (indirect string, offset: 0xae0c6): osPriorityBelowNormal4
    <ad4>   DW_AT_const_value : 20
 <2><ad5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ad6>   DW_AT_name        : (indirect string, offset: 0xae0dd): osPriorityBelowNormal5
    <ada>   DW_AT_const_value : 21
 <2><adb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0xae0f4): osPriorityBelowNormal6
    <ae0>   DW_AT_const_value : 22
 <2><ae1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x9d246): osPriorityBelowNormal7
    <ae6>   DW_AT_const_value : 23
 <2><ae7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xa6af7): osPriorityNormal
    <aec>   DW_AT_const_value : 24
 <2><aed>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x208a7): osPriorityNormal1
    <af2>   DW_AT_const_value : 25
 <2><af3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <af4>   DW_AT_name        : (indirect string, offset: 0x208b9): osPriorityNormal2
    <af8>   DW_AT_const_value : 26
 <2><af9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <afa>   DW_AT_name        : (indirect string, offset: 0x208cb): osPriorityNormal3
    <afe>   DW_AT_const_value : 27
 <2><aff>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b00>   DW_AT_name        : (indirect string, offset: 0x208dd): osPriorityNormal4
    <b04>   DW_AT_const_value : 28
 <2><b05>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b06>   DW_AT_name        : (indirect string, offset: 0x208ef): osPriorityNormal5
    <b0a>   DW_AT_const_value : 29
 <2><b0b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x20901): osPriorityNormal6
    <b10>   DW_AT_const_value : 30
 <2><b11>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b12>   DW_AT_name        : (indirect string, offset: 0x20913): osPriorityNormal7
    <b16>   DW_AT_const_value : 31
 <2><b17>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b18>   DW_AT_name        : (indirect string, offset: 0x32967): osPriorityAboveNormal
    <b1c>   DW_AT_const_value : 32
 <2><b1d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b1e>   DW_AT_name        : (indirect string, offset: 0xcbb5b): osPriorityAboveNormal1
    <b22>   DW_AT_const_value : 33
 <2><b23>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b24>   DW_AT_name        : (indirect string, offset: 0xa8f3b): osPriorityAboveNormal2
    <b28>   DW_AT_const_value : 34
 <2><b29>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b2a>   DW_AT_name        : (indirect string, offset: 0xcbb92): osPriorityAboveNormal3
    <b2e>   DW_AT_const_value : 35
 <2><b2f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b30>   DW_AT_name        : (indirect string, offset: 0xcbba9): osPriorityAboveNormal4
    <b34>   DW_AT_const_value : 36
 <2><b35>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b36>   DW_AT_name        : (indirect string, offset: 0xc0a85): osPriorityAboveNormal5
    <b3a>   DW_AT_const_value : 37
 <2><b3b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xc0ad6): osPriorityAboveNormal6
    <b40>   DW_AT_const_value : 38
 <2><b41>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b42>   DW_AT_name        : (indirect string, offset: 0xcbc00): osPriorityAboveNormal7
    <b46>   DW_AT_const_value : 39
 <2><b47>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b48>   DW_AT_name        : (indirect string, offset: 0x57e2): osPriorityHigh
    <b4c>   DW_AT_const_value : 40
 <2><b4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x87c06): osPriorityHigh1
    <b52>   DW_AT_const_value : 41
 <2><b53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b54>   DW_AT_name        : (indirect string, offset: 0x87c16): osPriorityHigh2
    <b58>   DW_AT_const_value : 42
 <2><b59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x87c26): osPriorityHigh3
    <b5e>   DW_AT_const_value : 43
 <2><b5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b60>   DW_AT_name        : (indirect string, offset: 0x87c36): osPriorityHigh4
    <b64>   DW_AT_const_value : 44
 <2><b65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b66>   DW_AT_name        : (indirect string, offset: 0x3f33): osPriorityHigh5
    <b6a>   DW_AT_const_value : 45
 <2><b6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x87c72): osPriorityHigh6
    <b70>   DW_AT_const_value : 46
 <2><b71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b72>   DW_AT_name        : (indirect string, offset: 0x87c82): osPriorityHigh7
    <b76>   DW_AT_const_value : 47
 <2><b77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b78>   DW_AT_name        : (indirect string, offset: 0x9e83e): osPriorityRealtime
    <b7c>   DW_AT_const_value : 48
 <2><b7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x8059d): osPriorityRealtime1
    <b82>   DW_AT_const_value : 49
 <2><b83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0x805b1): osPriorityRealtime2
    <b88>   DW_AT_const_value : 50
 <2><b89>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x805c5): osPriorityRealtime3
    <b8e>   DW_AT_const_value : 51
 <2><b8f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0x805d9): osPriorityRealtime4
    <b94>   DW_AT_const_value : 52
 <2><b95>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b96>   DW_AT_name        : (indirect string, offset: 0x805ed): osPriorityRealtime5
    <b9a>   DW_AT_const_value : 53
 <2><b9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x34e6a): osPriorityRealtime6
    <ba0>   DW_AT_const_value : 54
 <2><ba1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x80617): osPriorityRealtime7
    <ba6>   DW_AT_const_value : 55
 <2><ba7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x5be7b): osPriorityISR
    <bac>   DW_AT_const_value : 56
 <2><bad>: Abbrev Number: 17 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0xb4ff6): osPriorityError
    <bb2>   DW_AT_const_value : -1
 <2><bb3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xc27d1): osPriorityReserved
    <bb8>   DW_AT_const_value : 2147483647
 <2><bb8>: Abbrev Number: 0
 <1><bb9>: Abbrev Number: 4 (DW_TAG_typedef)
    <bba>   DW_AT_name        : (indirect string, offset: 0x43e9a): osPriority_t
    <bbe>   DW_AT_decl_file   : 9
    <bbf>   DW_AT_decl_line   : 136
    <bc0>   DW_AT_decl_column : 3
    <bc1>   DW_AT_type        : <0xa6d>
 <1><bc5>: Abbrev Number: 4 (DW_TAG_typedef)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x6f269): osThreadFunc_t
    <bca>   DW_AT_decl_file   : 9
    <bcb>   DW_AT_decl_line   : 139
    <bcc>   DW_AT_decl_column : 16
    <bcd>   DW_AT_type        : <0xce>
 <1><bd1>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <bd2>   DW_AT_encoding    : 5	(signed)
    <bd3>   DW_AT_byte_size   : 4
    <bd4>   DW_AT_type        : <0x2a>
    <bd8>   DW_AT_decl_file   : 9
    <bd9>   DW_AT_decl_line   : 176
    <bda>   DW_AT_decl_column : 14
    <bdb>   DW_AT_sibling     : <0xc0f>
 <2><bdf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <be0>   DW_AT_name        : (indirect string, offset: 0xb4cff): osOK
    <be4>   DW_AT_const_value : 0
 <2><be5>: Abbrev Number: 17 (DW_TAG_enumerator)
    <be6>   DW_AT_name        : (indirect string, offset: 0x5e9fb): osError
    <bea>   DW_AT_const_value : -1
 <2><beb>: Abbrev Number: 17 (DW_TAG_enumerator)
    <bec>   DW_AT_name        : (indirect string, offset: 0xb89b6): osErrorTimeout
    <bf0>   DW_AT_const_value : -2
 <2><bf1>: Abbrev Number: 17 (DW_TAG_enumerator)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x85d4e): osErrorResource
    <bf6>   DW_AT_const_value : -3
 <2><bf7>: Abbrev Number: 17 (DW_TAG_enumerator)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x359fd): osErrorParameter
    <bfc>   DW_AT_const_value : -4
 <2><bfd>: Abbrev Number: 17 (DW_TAG_enumerator)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x233b1): osErrorNoMemory
    <c02>   DW_AT_const_value : -5
 <2><c03>: Abbrev Number: 17 (DW_TAG_enumerator)
    <c04>   DW_AT_name        : (indirect string, offset: 0x3794b): osErrorISR
    <c08>   DW_AT_const_value : -6
 <2><c09>: Abbrev Number: 27 (DW_TAG_enumerator)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x67626): osStatusReserved
    <c0e>   DW_AT_const_value : 2147483647
 <2><c0e>: Abbrev Number: 0
 <1><c0f>: Abbrev Number: 4 (DW_TAG_typedef)
    <c10>   DW_AT_name        : (indirect string, offset: 0x458e9): osStatus_t
    <c14>   DW_AT_decl_file   : 9
    <c15>   DW_AT_decl_line   : 185
    <c16>   DW_AT_decl_column : 3
    <c17>   DW_AT_type        : <0xbd1>
 <1><c1b>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x49624): osThreadId_t
    <c20>   DW_AT_decl_file   : 9
    <c21>   DW_AT_decl_line   : 189
    <c22>   DW_AT_decl_column : 15
    <c23>   DW_AT_type        : <0xde>
 <1><c27>: Abbrev Number: 4 (DW_TAG_typedef)
    <c28>   DW_AT_name        : (indirect string, offset: 0xb4a90): osEventFlagsId_t
    <c2c>   DW_AT_decl_file   : 9
    <c2d>   DW_AT_decl_line   : 195
    <c2e>   DW_AT_decl_column : 15
    <c2f>   DW_AT_type        : <0xde>
 <1><c33>: Abbrev Number: 4 (DW_TAG_typedef)
    <c34>   DW_AT_name        : (indirect string, offset: 0xca809): osMutexId_t
    <c38>   DW_AT_decl_file   : 9
    <c39>   DW_AT_decl_line   : 198
    <c3a>   DW_AT_decl_column : 15
    <c3b>   DW_AT_type        : <0xde>
 <1><c3f>: Abbrev Number: 4 (DW_TAG_typedef)
    <c40>   DW_AT_name        : (indirect string, offset: 0x898fa): TZ_ModuleId_t
    <c44>   DW_AT_decl_file   : 9
    <c45>   DW_AT_decl_line   : 213
    <c46>   DW_AT_decl_column : 18
    <c47>   DW_AT_type        : <0xbd>
 <1><c4b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c4c>   DW_AT_byte_size   : 36
    <c4d>   DW_AT_decl_file   : 9
    <c4e>   DW_AT_decl_line   : 218
    <c4f>   DW_AT_decl_column : 9
    <c4f>   DW_AT_sibling     : <0xcc9>
 <2><c53>: Abbrev Number: 1 (DW_TAG_member)
    <c54>   DW_AT_name        : (indirect string, offset: 0x175dd): name
    <c58>   DW_AT_decl_file   : 9
    <c59>   DW_AT_decl_line   : 219
    <c5a>   DW_AT_decl_column : 33
    <c5b>   DW_AT_type        : <0xf1>
    <c5f>   DW_AT_data_member_location: 0
 <2><c60>: Abbrev Number: 1 (DW_TAG_member)
    <c61>   DW_AT_name        : (indirect string, offset: 0x85b4e): attr_bits
    <c65>   DW_AT_decl_file   : 9
    <c66>   DW_AT_decl_line   : 220
    <c67>   DW_AT_decl_column : 28
    <c68>   DW_AT_type        : <0xbd>
    <c6c>   DW_AT_data_member_location: 4
 <2><c6d>: Abbrev Number: 1 (DW_TAG_member)
    <c6e>   DW_AT_name        : (indirect string, offset: 0x7d9f5): cb_mem
    <c72>   DW_AT_decl_file   : 9
    <c73>   DW_AT_decl_line   : 221
    <c74>   DW_AT_decl_column : 30
    <c75>   DW_AT_type        : <0xde>
    <c79>   DW_AT_data_member_location: 8
 <2><c7a>: Abbrev Number: 1 (DW_TAG_member)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x37f78): cb_size
    <c7f>   DW_AT_decl_file   : 9
    <c80>   DW_AT_decl_line   : 222
    <c81>   DW_AT_decl_column : 30
    <c82>   DW_AT_type        : <0xbd>
    <c86>   DW_AT_data_member_location: 12
 <2><c87>: Abbrev Number: 1 (DW_TAG_member)
    <c88>   DW_AT_name        : (indirect string, offset: 0xb9de6): stack_mem
    <c8c>   DW_AT_decl_file   : 9
    <c8d>   DW_AT_decl_line   : 223
    <c8e>   DW_AT_decl_column : 27
    <c8f>   DW_AT_type        : <0xde>
    <c93>   DW_AT_data_member_location: 16
 <2><c94>: Abbrev Number: 1 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0x80661): stack_size
    <c99>   DW_AT_decl_file   : 9
    <c9a>   DW_AT_decl_line   : 224
    <c9b>   DW_AT_decl_column : 27
    <c9c>   DW_AT_type        : <0xbd>
    <ca0>   DW_AT_data_member_location: 20
 <2><ca1>: Abbrev Number: 1 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x51237): priority
    <ca6>   DW_AT_decl_file   : 9
    <ca7>   DW_AT_decl_line   : 225
    <ca8>   DW_AT_decl_column : 29
    <ca9>   DW_AT_type        : <0xbb9>
    <cad>   DW_AT_data_member_location: 24
 <2><cae>: Abbrev Number: 1 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0x5779d): tz_module
    <cb3>   DW_AT_decl_file   : 9
    <cb4>   DW_AT_decl_line   : 226
    <cb5>   DW_AT_decl_column : 28
    <cb6>   DW_AT_type        : <0xc3f>
    <cba>   DW_AT_data_member_location: 28
 <2><cbb>: Abbrev Number: 1 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x582ea): reserved
    <cc0>   DW_AT_decl_file   : 9
    <cc1>   DW_AT_decl_line   : 227
    <cc2>   DW_AT_decl_column : 29
    <cc3>   DW_AT_type        : <0xbd>
    <cc7>   DW_AT_data_member_location: 32
 <2><cc8>: Abbrev Number: 0
 <1><cc9>: Abbrev Number: 4 (DW_TAG_typedef)
    <cca>   DW_AT_name        : (indirect string, offset: 0x207da): osThreadAttr_t
    <cce>   DW_AT_decl_file   : 9
    <ccf>   DW_AT_decl_line   : 228
    <cd0>   DW_AT_decl_column : 3
    <cd1>   DW_AT_type        : <0xc4b>
 <1><cd5>: Abbrev Number: 16 (DW_TAG_const_type)
    <cd6>   DW_AT_type        : <0xcc9>
 <1><cda>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cdb>   DW_AT_byte_size   : 16
    <cdc>   DW_AT_decl_file   : 9
    <cdd>   DW_AT_decl_line   : 239
    <cde>   DW_AT_decl_column : 9
    <cde>   DW_AT_sibling     : <0xd17>
 <2><ce2>: Abbrev Number: 1 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x175dd): name
    <ce7>   DW_AT_decl_file   : 9
    <ce8>   DW_AT_decl_line   : 240
    <ce9>   DW_AT_decl_column : 33
    <cea>   DW_AT_type        : <0xf1>
    <cee>   DW_AT_data_member_location: 0
 <2><cef>: Abbrev Number: 1 (DW_TAG_member)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x85b4e): attr_bits
    <cf4>   DW_AT_decl_file   : 9
    <cf5>   DW_AT_decl_line   : 241
    <cf6>   DW_AT_decl_column : 28
    <cf7>   DW_AT_type        : <0xbd>
    <cfb>   DW_AT_data_member_location: 4
 <2><cfc>: Abbrev Number: 1 (DW_TAG_member)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x7d9f5): cb_mem
    <d01>   DW_AT_decl_file   : 9
    <d02>   DW_AT_decl_line   : 242
    <d03>   DW_AT_decl_column : 30
    <d04>   DW_AT_type        : <0xde>
    <d08>   DW_AT_data_member_location: 8
 <2><d09>: Abbrev Number: 1 (DW_TAG_member)
    <d0a>   DW_AT_name        : (indirect string, offset: 0x37f78): cb_size
    <d0e>   DW_AT_decl_file   : 9
    <d0f>   DW_AT_decl_line   : 243
    <d10>   DW_AT_decl_column : 30
    <d11>   DW_AT_type        : <0xbd>
    <d15>   DW_AT_data_member_location: 12
 <2><d16>: Abbrev Number: 0
 <1><d17>: Abbrev Number: 4 (DW_TAG_typedef)
    <d18>   DW_AT_name        : (indirect string, offset: 0xc6ac6): osEventFlagsAttr_t
    <d1c>   DW_AT_decl_file   : 9
    <d1d>   DW_AT_decl_line   : 244
    <d1e>   DW_AT_decl_column : 3
    <d1f>   DW_AT_type        : <0xcda>
 <1><d23>: Abbrev Number: 16 (DW_TAG_const_type)
    <d24>   DW_AT_type        : <0xd17>
 <1><d28>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d29>   DW_AT_byte_size   : 16
    <d2a>   DW_AT_decl_file   : 9
    <d2b>   DW_AT_decl_line   : 247
    <d2c>   DW_AT_decl_column : 9
    <d2c>   DW_AT_sibling     : <0xd65>
 <2><d30>: Abbrev Number: 1 (DW_TAG_member)
    <d31>   DW_AT_name        : (indirect string, offset: 0x175dd): name
    <d35>   DW_AT_decl_file   : 9
    <d36>   DW_AT_decl_line   : 248
    <d37>   DW_AT_decl_column : 33
    <d38>   DW_AT_type        : <0xf1>
    <d3c>   DW_AT_data_member_location: 0
 <2><d3d>: Abbrev Number: 1 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x85b4e): attr_bits
    <d42>   DW_AT_decl_file   : 9
    <d43>   DW_AT_decl_line   : 249
    <d44>   DW_AT_decl_column : 28
    <d45>   DW_AT_type        : <0xbd>
    <d49>   DW_AT_data_member_location: 4
 <2><d4a>: Abbrev Number: 1 (DW_TAG_member)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x7d9f5): cb_mem
    <d4f>   DW_AT_decl_file   : 9
    <d50>   DW_AT_decl_line   : 250
    <d51>   DW_AT_decl_column : 30
    <d52>   DW_AT_type        : <0xde>
    <d56>   DW_AT_data_member_location: 8
 <2><d57>: Abbrev Number: 1 (DW_TAG_member)
    <d58>   DW_AT_name        : (indirect string, offset: 0x37f78): cb_size
    <d5c>   DW_AT_decl_file   : 9
    <d5d>   DW_AT_decl_line   : 251
    <d5e>   DW_AT_decl_column : 30
    <d5f>   DW_AT_type        : <0xbd>
    <d63>   DW_AT_data_member_location: 12
 <2><d64>: Abbrev Number: 0
 <1><d65>: Abbrev Number: 4 (DW_TAG_typedef)
    <d66>   DW_AT_name        : (indirect string, offset: 0x6cb72): osMutexAttr_t
    <d6a>   DW_AT_decl_file   : 9
    <d6b>   DW_AT_decl_line   : 252
    <d6c>   DW_AT_decl_column : 3
    <d6d>   DW_AT_type        : <0xd28>
 <1><d71>: Abbrev Number: 16 (DW_TAG_const_type)
    <d72>   DW_AT_type        : <0xd65>
 <1><d76>: Abbrev Number: 9 (DW_TAG_variable)
    <d77>   DW_AT_name        : (indirect string, offset: 0xb6702): htim1
    <d7b>   DW_AT_decl_file   : 10
    <d7c>   DW_AT_decl_line   : 35
    <d7d>   DW_AT_decl_column : 26
    <d7e>   DW_AT_type        : <0x7dc>
    <d82>   DW_AT_external    : 1
    <d82>   DW_AT_declaration : 1
 <1><d82>: Abbrev Number: 9 (DW_TAG_variable)
    <d83>   DW_AT_name        : (indirect string, offset: 0xb6720): htim2
    <d87>   DW_AT_decl_file   : 10
    <d88>   DW_AT_decl_line   : 37
    <d89>   DW_AT_decl_column : 26
    <d8a>   DW_AT_type        : <0x7dc>
    <d8e>   DW_AT_external    : 1
    <d8e>   DW_AT_declaration : 1
 <1><d8e>: Abbrev Number: 9 (DW_TAG_variable)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x7c81b): htim3
    <d93>   DW_AT_decl_file   : 10
    <d94>   DW_AT_decl_line   : 39
    <d95>   DW_AT_decl_column : 26
    <d96>   DW_AT_type        : <0x7dc>
    <d9a>   DW_AT_external    : 1
    <d9a>   DW_AT_declaration : 1
 <1><d9a>: Abbrev Number: 9 (DW_TAG_variable)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x7c821): htim4
    <d9f>   DW_AT_decl_file   : 10
    <da0>   DW_AT_decl_line   : 41
    <da1>   DW_AT_decl_column : 26
    <da2>   DW_AT_type        : <0x7dc>
    <da6>   DW_AT_external    : 1
    <da6>   DW_AT_declaration : 1
 <1><da6>: Abbrev Number: 9 (DW_TAG_variable)
    <da7>   DW_AT_name        : (indirect string, offset: 0x7c8c2): htim8
    <dab>   DW_AT_decl_file   : 10
    <dac>   DW_AT_decl_line   : 43
    <dad>   DW_AT_decl_column : 26
    <dae>   DW_AT_type        : <0x7dc>
    <db2>   DW_AT_external    : 1
    <db2>   DW_AT_declaration : 1
 <1><db2>: Abbrev Number: 9 (DW_TAG_variable)
    <db3>   DW_AT_name        : (indirect string, offset: 0xb1968): htim15
    <db7>   DW_AT_decl_file   : 10
    <db8>   DW_AT_decl_line   : 45
    <db9>   DW_AT_decl_column : 26
    <dba>   DW_AT_type        : <0x7dc>
    <dbe>   DW_AT_external    : 1
    <dbe>   DW_AT_declaration : 1
 <1><dbe>: Abbrev Number: 9 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xb196f): htim16
    <dc3>   DW_AT_decl_file   : 10
    <dc4>   DW_AT_decl_line   : 47
    <dc5>   DW_AT_decl_column : 26
    <dc6>   DW_AT_type        : <0x7dc>
    <dca>   DW_AT_external    : 1
    <dca>   DW_AT_declaration : 1
 <1><dca>: Abbrev Number: 9 (DW_TAG_variable)
    <dcb>   DW_AT_name        : (indirect string, offset: 0xb1976): htim17
    <dcf>   DW_AT_decl_file   : 10
    <dd0>   DW_AT_decl_line   : 49
    <dd1>   DW_AT_decl_column : 26
    <dd2>   DW_AT_type        : <0x7dc>
    <dd6>   DW_AT_external    : 1
    <dd6>   DW_AT_declaration : 1
 <1><dd6>: Abbrev Number: 9 (DW_TAG_variable)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x6e3c4): huart4
    <ddb>   DW_AT_decl_file   : 11
    <ddc>   DW_AT_decl_line   : 35
    <ddd>   DW_AT_decl_column : 27
    <dde>   DW_AT_type        : <0xa60>
    <de2>   DW_AT_external    : 1
    <de2>   DW_AT_declaration : 1
 <1><de2>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <de3>   DW_AT_encoding    : 7	(unsigned)
    <de4>   DW_AT_byte_size   : 1
    <de5>   DW_AT_type        : <0x59>
    <de9>   DW_AT_decl_file   : 12
    <dea>   DW_AT_decl_line   : 14
    <deb>   DW_AT_decl_column : 1
    <dec>   DW_AT_sibling     : <0xe09>
 <2><df0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <df1>   DW_AT_name        : (indirect string, offset: 0x40d74): ECU_OK
    <df5>   DW_AT_const_value : 0
 <2><df6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <df7>   DW_AT_name        : (indirect string, offset: 0xa834): ECU_ERROR
    <dfb>   DW_AT_const_value : 1
 <2><dfc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <dfd>   DW_AT_name        : (indirect string, offset: 0xcc50b): ECU_BUSY
    <e01>   DW_AT_const_value : 2
 <2><e02>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e03>   DW_AT_name        : (indirect string, offset: 0x7b8e1): ECU_TIMEOUT
    <e07>   DW_AT_const_value : 3
 <2><e08>: Abbrev Number: 0
 <1><e09>: Abbrev Number: 4 (DW_TAG_typedef)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x204b): ECU_StatusTypeDef
    <e0e>   DW_AT_decl_file   : 12
    <e0f>   DW_AT_decl_line   : 19
    <e10>   DW_AT_decl_column : 3
    <e11>   DW_AT_type        : <0xde2>
 <1><e15>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e16>   DW_AT_byte_size   : 8
    <e17>   DW_AT_decl_file   : 13
    <e18>   DW_AT_decl_line   : 48
    <e19>   DW_AT_decl_column : 9
    <e19>   DW_AT_sibling     : <0xe38>
 <2><e1d>: Abbrev Number: 1 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x36cd0): Frequency
    <e22>   DW_AT_decl_file   : 13
    <e23>   DW_AT_decl_line   : 49
    <e24>   DW_AT_decl_column : 11
    <e25>   DW_AT_type        : <0xbd>
    <e29>   DW_AT_data_member_location: 0
 <2><e2a>: Abbrev Number: 1 (DW_TAG_member)
    <e2b>   DW_AT_name        : (indirect string, offset: 0x1769f): Duty_Cycle
    <e2f>   DW_AT_decl_file   : 13
    <e30>   DW_AT_decl_line   : 50
    <e31>   DW_AT_decl_column : 8
    <e32>   DW_AT_type        : <0xe38>
    <e36>   DW_AT_data_member_location: 4
 <2><e37>: Abbrev Number: 0
 <1><e38>: Abbrev Number: 11 (DW_TAG_base_type)
    <e39>   DW_AT_byte_size   : 4
    <e3a>   DW_AT_encoding    : 4	(float)
    <e3b>   DW_AT_name        : (indirect string, offset: 0xb024f): float
 <1><e3f>: Abbrev Number: 4 (DW_TAG_typedef)
    <e40>   DW_AT_name        : (indirect string, offset: 0x40a24): motor_speed_t
    <e44>   DW_AT_decl_file   : 13
    <e45>   DW_AT_decl_line   : 51
    <e46>   DW_AT_decl_column : 2
    <e47>   DW_AT_type        : <0xe15>
 <1><e4b>: Abbrev Number: 16 (DW_TAG_const_type)
    <e4c>   DW_AT_type        : <0xe3f>
 <1><e50>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e51>   DW_AT_byte_size   : 16
    <e52>   DW_AT_decl_file   : 13
    <e53>   DW_AT_decl_line   : 53
    <e54>   DW_AT_decl_column : 9
    <e54>   DW_AT_sibling     : <0xe80>
 <2><e58>: Abbrev Number: 1 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0xa0dd0): htim
    <e5d>   DW_AT_decl_file   : 13
    <e5e>   DW_AT_decl_line   : 54
    <e5f>   DW_AT_decl_column : 21
    <e60>   DW_AT_type        : <0xe80>
    <e64>   DW_AT_data_member_location: 0
 <2><e65>: Abbrev Number: 1 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0xb2f3b): PWM_Channel
    <e6a>   DW_AT_decl_file   : 13
    <e6b>   DW_AT_decl_line   : 55
    <e6c>   DW_AT_decl_column : 11
    <e6d>   DW_AT_type        : <0xbd>
    <e71>   DW_AT_data_member_location: 4
 <2><e72>: Abbrev Number: 1 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x428a8): speed
    <e77>   DW_AT_decl_file   : 13
    <e78>   DW_AT_decl_line   : 56
    <e79>   DW_AT_decl_column : 16
    <e7a>   DW_AT_type        : <0xe3f>
    <e7e>   DW_AT_data_member_location: 8
 <2><e7f>: Abbrev Number: 0
 <1><e80>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e81>   DW_AT_byte_size   : 4
    <e81>   DW_AT_type        : <0x7dc>
 <1><e85>: Abbrev Number: 4 (DW_TAG_typedef)
    <e86>   DW_AT_name        : (indirect string, offset: 0x9698d): motor_obj_t
    <e8a>   DW_AT_decl_file   : 13
    <e8b>   DW_AT_decl_line   : 57
    <e8c>   DW_AT_decl_column : 2
    <e8d>   DW_AT_type        : <0xe50>
 <1><e91>: Abbrev Number: 9 (DW_TAG_variable)
    <e92>   DW_AT_name        : (indirect string, offset: 0x428a3): high_speed
    <e96>   DW_AT_decl_file   : 13
    <e97>   DW_AT_decl_line   : 59
    <e98>   DW_AT_decl_column : 22
    <e99>   DW_AT_type        : <0xe3f>
    <e9d>   DW_AT_external    : 1
    <e9d>   DW_AT_declaration : 1
 <1><e9d>: Abbrev Number: 9 (DW_TAG_variable)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x194c2): medium_speed
    <ea2>   DW_AT_decl_file   : 13
    <ea3>   DW_AT_decl_line   : 61
    <ea4>   DW_AT_decl_column : 22
    <ea5>   DW_AT_type        : <0xe3f>
    <ea9>   DW_AT_external    : 1
    <ea9>   DW_AT_declaration : 1
 <1><ea9>: Abbrev Number: 9 (DW_TAG_variable)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x84d2): low_speed
    <eae>   DW_AT_decl_file   : 13
    <eaf>   DW_AT_decl_line   : 63
    <eb0>   DW_AT_decl_column : 22
    <eb1>   DW_AT_type        : <0xe3f>
    <eb5>   DW_AT_external    : 1
    <eb5>   DW_AT_declaration : 1
 <1><eb5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <eb6>   DW_AT_byte_size   : 4
    <eb6>   DW_AT_type        : <0x217>
 <1><eba>: Abbrev Number: 21 (DW_TAG_array_type)
    <ebb>   DW_AT_type        : <0xc9>
    <ebf>   DW_AT_sibling     : <0xeca>
 <2><ec3>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <ec4>   DW_AT_type        : <0x31>
    <ec8>   DW_AT_upper_bound : 5
 <2><ec9>: Abbrev Number: 0
 <1><eca>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ecb>   DW_AT_type        : <0xeba>
 <1><ecf>: Abbrev Number: 9 (DW_TAG_variable)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x5e536): ultrasonic_Distance_Values
    <ed4>   DW_AT_decl_file   : 14
    <ed5>   DW_AT_decl_line   : 24
    <ed6>   DW_AT_decl_column : 26
    <ed7>   DW_AT_type        : <0xeca>
    <edb>   DW_AT_external    : 1
    <edb>   DW_AT_declaration : 1
 <1><edb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <edc>   DW_AT_byte_size   : 12
    <edd>   DW_AT_decl_file   : 14
    <ede>   DW_AT_decl_line   : 29
    <edf>   DW_AT_decl_column : 9
    <edf>   DW_AT_sibling     : <0xf0b>
 <2><ee3>: Abbrev Number: 1 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xa0dd0): htim
    <ee8>   DW_AT_decl_file   : 14
    <ee9>   DW_AT_decl_line   : 30
    <eea>   DW_AT_decl_column : 21
    <eeb>   DW_AT_type        : <0xe80>
    <eef>   DW_AT_data_member_location: 0
 <2><ef0>: Abbrev Number: 1 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0xb2f3b): PWM_Channel
    <ef5>   DW_AT_decl_file   : 14
    <ef6>   DW_AT_decl_line   : 31
    <ef7>   DW_AT_decl_column : 11
    <ef8>   DW_AT_type        : <0xbd>
    <efc>   DW_AT_data_member_location: 4
 <2><efd>: Abbrev Number: 1 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0x421a2): IC_Channel
    <f02>   DW_AT_decl_file   : 14
    <f03>   DW_AT_decl_line   : 32
    <f04>   DW_AT_decl_column : 11
    <f05>   DW_AT_type        : <0xbd>
    <f09>   DW_AT_data_member_location: 8
 <2><f0a>: Abbrev Number: 0
 <1><f0b>: Abbrev Number: 4 (DW_TAG_typedef)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x38fb0): ultrasonic_obj_t
    <f10>   DW_AT_decl_file   : 14
    <f11>   DW_AT_decl_line   : 34
    <f12>   DW_AT_decl_column : 2
    <f13>   DW_AT_type        : <0xedb>
 <1><f17>: Abbrev Number: 9 (DW_TAG_variable)
    <f18>   DW_AT_name        : (indirect string, offset: 0x72c24): Bluetooth_RX_Data
    <f1c>   DW_AT_decl_file   : 15
    <f1d>   DW_AT_decl_line   : 32
    <f1e>   DW_AT_decl_column : 16
    <f1f>   DW_AT_type        : <0x9b>
    <f23>   DW_AT_external    : 1
    <f23>   DW_AT_declaration : 1
 <1><f23>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f24>   DW_AT_byte_size   : 8
    <f25>   DW_AT_decl_file   : 15
    <f26>   DW_AT_decl_line   : 34
    <f27>   DW_AT_decl_column : 9
    <f27>   DW_AT_sibling     : <0xf46>
 <2><f2b>: Abbrev Number: 1 (DW_TAG_member)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x91328): huart
    <f30>   DW_AT_decl_file   : 15
    <f31>   DW_AT_decl_line   : 35
    <f32>   DW_AT_decl_column : 22
    <f33>   DW_AT_type        : <0xf46>
    <f37>   DW_AT_data_member_location: 0
 <2><f38>: Abbrev Number: 1 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0x669fe): Numberofdata
    <f3d>   DW_AT_decl_file   : 15
    <f3e>   DW_AT_decl_line   : 36
    <f3f>   DW_AT_decl_column : 10
    <f40>   DW_AT_type        : <0x9b>
    <f44>   DW_AT_data_member_location: 4
 <2><f45>: Abbrev Number: 0
 <1><f46>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f47>   DW_AT_byte_size   : 4
    <f47>   DW_AT_type        : <0xa60>
 <1><f4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x78c77): bluetooth_obj_t
    <f50>   DW_AT_decl_file   : 15
    <f51>   DW_AT_decl_line   : 37
    <f52>   DW_AT_decl_column : 2
    <f53>   DW_AT_type        : <0xf23>
 <1><f57>: Abbrev Number: 16 (DW_TAG_const_type)
    <f58>   DW_AT_type        : <0xf4b>
 <1><f5c>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f5d>   DW_AT_byte_size   : 8
    <f5e>   DW_AT_decl_file   : 16
    <f5f>   DW_AT_decl_line   : 25
    <f60>   DW_AT_decl_column : 9
    <f60>   DW_AT_sibling     : <0xf7f>
 <2><f64>: Abbrev Number: 1 (DW_TAG_member)
    <f65>   DW_AT_name        : (indirect string, offset: 0x78ae0): port
    <f69>   DW_AT_decl_file   : 16
    <f6a>   DW_AT_decl_line   : 26
    <f6b>   DW_AT_decl_column : 16
    <f6c>   DW_AT_type        : <0xeb5>
    <f70>   DW_AT_data_member_location: 0
 <2><f71>: Abbrev Number: 36 (DW_TAG_member)
    <f72>   DW_AT_name        : pin
    <f76>   DW_AT_decl_file   : 16
    <f77>   DW_AT_decl_line   : 27
    <f78>   DW_AT_decl_column : 11
    <f79>   DW_AT_type        : <0xac>
    <f7d>   DW_AT_data_member_location: 4
 <2><f7e>: Abbrev Number: 0
 <1><f7f>: Abbrev Number: 4 (DW_TAG_typedef)
    <f80>   DW_AT_name        : (indirect string, offset: 0x3a8a8): ir_obj_t
    <f84>   DW_AT_decl_file   : 16
    <f85>   DW_AT_decl_line   : 28
    <f86>   DW_AT_decl_column : 2
    <f87>   DW_AT_type        : <0xf5c>
 <1><f8b>: Abbrev Number: 9 (DW_TAG_variable)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x68904): IR_Right_Rear
    <f90>   DW_AT_decl_file   : 16
    <f91>   DW_AT_decl_line   : 30
    <f92>   DW_AT_decl_column : 17
    <f93>   DW_AT_type        : <0xf7f>
    <f97>   DW_AT_external    : 1
    <f97>   DW_AT_declaration : 1
 <1><f97>: Abbrev Number: 9 (DW_TAG_variable)
    <f98>   DW_AT_name        : (indirect string, offset: 0x2c4af): IR_Left_Rear
    <f9c>   DW_AT_decl_file   : 16
    <f9d>   DW_AT_decl_line   : 31
    <f9e>   DW_AT_decl_column : 17
    <f9f>   DW_AT_type        : <0xf7f>
    <fa3>   DW_AT_external    : 1
    <fa3>   DW_AT_declaration : 1
 <1><fa3>: Abbrev Number: 10 (DW_TAG_structure_type)
    <fa4>   DW_AT_byte_size   : 16
    <fa5>   DW_AT_decl_file   : 17
    <fa6>   DW_AT_decl_line   : 23
    <fa7>   DW_AT_decl_column : 9
    <fa7>   DW_AT_sibling     : <0xfe0>
 <2><fab>: Abbrev Number: 1 (DW_TAG_member)
    <fac>   DW_AT_name        : (indirect string, offset: 0xa0dd0): htim
    <fb0>   DW_AT_decl_file   : 17
    <fb1>   DW_AT_decl_line   : 24
    <fb2>   DW_AT_decl_column : 21
    <fb3>   DW_AT_type        : <0xe80>
    <fb7>   DW_AT_data_member_location: 0
 <2><fb8>: Abbrev Number: 1 (DW_TAG_member)
    <fb9>   DW_AT_name        : (indirect string, offset: 0xb2f3b): PWM_Channel
    <fbd>   DW_AT_decl_file   : 17
    <fbe>   DW_AT_decl_line   : 25
    <fbf>   DW_AT_decl_column : 11
    <fc0>   DW_AT_type        : <0xbd>
    <fc4>   DW_AT_data_member_location: 4
 <2><fc5>: Abbrev Number: 1 (DW_TAG_member)
    <fc6>   DW_AT_name        : (indirect string, offset: 0x36cd0): Frequency
    <fca>   DW_AT_decl_file   : 17
    <fcb>   DW_AT_decl_line   : 26
    <fcc>   DW_AT_decl_column : 11
    <fcd>   DW_AT_type        : <0xbd>
    <fd1>   DW_AT_data_member_location: 8
 <2><fd2>: Abbrev Number: 1 (DW_TAG_member)
    <fd3>   DW_AT_name        : (indirect string, offset: 0x1769f): Duty_Cycle
    <fd7>   DW_AT_decl_file   : 17
    <fd8>   DW_AT_decl_line   : 27
    <fd9>   DW_AT_decl_column : 8
    <fda>   DW_AT_type        : <0xe38>
    <fde>   DW_AT_data_member_location: 12
 <2><fdf>: Abbrev Number: 0
 <1><fe0>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xb6273): busser_obj_t
    <fe5>   DW_AT_decl_file   : 17
    <fe6>   DW_AT_decl_line   : 28
    <fe7>   DW_AT_decl_column : 2
    <fe8>   DW_AT_type        : <0xfa3>
 <1><fec>: Abbrev Number: 8 (DW_TAG_variable)
    <fed>   DW_AT_name        : (indirect string, offset: 0xfa82): Front_ultrasonic
    <ff1>   DW_AT_decl_file   : 1
    <ff1>   DW_AT_decl_line   : 65
    <ff2>   DW_AT_decl_column : 18
    <ff3>   DW_AT_type        : <0xf0b>
    <ff7>   DW_AT_external    : 1
    <ff7>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><ffd>: Abbrev Number: 8 (DW_TAG_variable)
    <ffe>   DW_AT_name        : (indirect string, offset: 0xc6b40): RightFront_ultrasonic
    <1002>   DW_AT_decl_file   : 1
    <1002>   DW_AT_decl_line   : 67
    <1003>   DW_AT_decl_column : 18
    <1004>   DW_AT_type        : <0xf0b>
    <1008>   DW_AT_external    : 1
    <1008>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><100e>: Abbrev Number: 8 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0xb0cbb): RightRear_ultrasonic
    <1013>   DW_AT_decl_file   : 1
    <1013>   DW_AT_decl_line   : 69
    <1014>   DW_AT_decl_column : 18
    <1015>   DW_AT_type        : <0xf0b>
    <1019>   DW_AT_external    : 1
    <1019>   DW_AT_location    : 5 byte block: 3 18 0 0 20 	(DW_OP_addr: 20000018)
 <1><101f>: Abbrev Number: 8 (DW_TAG_variable)
    <1020>   DW_AT_name        : (indirect string, offset: 0xfa7e): LeftFront_ultrasonic
    <1024>   DW_AT_decl_file   : 1
    <1024>   DW_AT_decl_line   : 71
    <1025>   DW_AT_decl_column : 18
    <1026>   DW_AT_type        : <0xf0b>
    <102a>   DW_AT_external    : 1
    <102a>   DW_AT_location    : 5 byte block: 3 24 0 0 20 	(DW_OP_addr: 20000024)
 <1><1030>: Abbrev Number: 8 (DW_TAG_variable)
    <1031>   DW_AT_name        : (indirect string, offset: 0x3e3d8): LeftRear_ultrasonic
