Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1147 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 28 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xbd36f): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x8b769): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x86726): C:/Users/Hesham/Desktop/NTI/STM32IDE/STM32F303RE_Auto_Parking_System/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 29 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 9 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x10183): unsigned int
 <1><38>: Abbrev Number: 9 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5d4c1): long long int
 <1><3f>: Abbrev Number: 9 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x125a6): long double
 <1><46>: Abbrev Number: 9 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x669f0): signed char
 <1><4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x3ba81): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 9 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x94be5): unsigned char
 <1><60>: Abbrev Number: 9 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x98965): short int
 <1><67>: Abbrev Number: 4 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0xa6ecb): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 9 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0xc3a4f): short unsigned int
 <1><7a>: Abbrev Number: 9 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0x10cff): long int
 <1><81>: Abbrev Number: 4 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x82388): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 9 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x4e6a4): long unsigned int
 <1><94>: Abbrev Number: 9 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x2a0a2): long long unsigned int
 <1><9b>: Abbrev Number: 4 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x3ba83): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 21 (DW_TAG_const_type)
    <a8>   DW_AT_type        : <0x9b>
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x95d44): uint16_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 36
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x67>
 <1><b8>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 4 (DW_TAG_typedef)
    <be>   DW_AT_name        : (indirect string, offset: 0x95348): uint32_t
    <c2>   DW_AT_decl_file   : 3
    <c3>   DW_AT_decl_line   : 48
    <c4>   DW_AT_decl_column : 20
    <c5>   DW_AT_type        : <0x81>
 <1><c9>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <ca>   DW_AT_type        : <0xbd>
 <1><ce>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <cf>   DW_AT_byte_size   : 4
    <cf>   DW_AT_type        : <0xd3>
 <1><d3>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <d4>   DW_AT_prototyped  : 1
    <d4>   DW_AT_sibling     : <0xde>
 <2><d8>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <d9>   DW_AT_type        : <0xde>
 <2><dd>: Abbrev Number: 0
 <1><de>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <df>   DW_AT_byte_size   : 4
 <1><e0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e1>   DW_AT_byte_size   : 4
    <e1>   DW_AT_type        : <0x9b>
 <1><e5>: Abbrev Number: 9 (DW_TAG_base_type)
    <e6>   DW_AT_byte_size   : 1
    <e7>   DW_AT_encoding    : 8	(unsigned char)
    <e8>   DW_AT_name        : (indirect string, offset: 0x41e22): char
 <1><ec>: Abbrev Number: 21 (DW_TAG_const_type)
    <ed>   DW_AT_type        : <0xe5>
 <1><f1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f2>   DW_AT_byte_size   : 4
    <f2>   DW_AT_type        : <0xec>
 <1><f6>: Abbrev Number: 15 (DW_TAG_structure_type)
    <f7>   DW_AT_byte_size   : 16
    <f8>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 348
    <fb>   DW_AT_decl_column : 9
    <fb>   DW_AT_sibling     : <0x136>
 <2><ff>: Abbrev Number: 5 (DW_TAG_member)
    <100>   DW_AT_name        : CCR
    <104>   DW_AT_decl_file   : 4
    <104>   DW_AT_decl_line   : 350
    <106>   DW_AT_decl_column : 17
    <106>   DW_AT_type        : <0xc9>
    <10a>   DW_AT_data_member_location: 0
 <2><10b>: Abbrev Number: 3 (DW_TAG_member)
    <10c>   DW_AT_name        : (indirect string, offset: 0x617ce): CNDTR
    <110>   DW_AT_decl_file   : 4
    <111>   DW_AT_decl_line   : 351
    <113>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0xc9>
    <118>   DW_AT_data_member_location: 4
 <2><119>: Abbrev Number: 3 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0xc5232): CPAR
    <11e>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 352
    <121>   DW_AT_decl_column : 17
    <122>   DW_AT_type        : <0xc9>
    <126>   DW_AT_data_member_location: 8
 <2><127>: Abbrev Number: 3 (DW_TAG_member)
    <128>   DW_AT_name        : (indirect string, offset: 0x71736): CMAR
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 353
    <12f>   DW_AT_decl_column : 17
    <130>   DW_AT_type        : <0xc9>
    <134>   DW_AT_data_member_location: 12
 <2><135>: Abbrev Number: 0
 <1><136>: Abbrev Number: 11 (DW_TAG_typedef)
    <137>   DW_AT_name        : (indirect string, offset: 0xa61f8): DMA_Channel_TypeDef
    <13b>   DW_AT_decl_file   : 4
    <13c>   DW_AT_decl_line   : 354
    <13e>   DW_AT_decl_column : 3
    <13f>   DW_AT_type        : <0xf6>
 <1><143>: Abbrev Number: 15 (DW_TAG_structure_type)
    <144>   DW_AT_byte_size   : 8
    <145>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 356
    <148>   DW_AT_decl_column : 9
    <148>   DW_AT_sibling     : <0x167>
 <2><14c>: Abbrev Number: 5 (DW_TAG_member)
    <14d>   DW_AT_name        : ISR
    <151>   DW_AT_decl_file   : 4
    <151>   DW_AT_decl_line   : 358
    <153>   DW_AT_decl_column : 17
    <153>   DW_AT_type        : <0xc9>
    <157>   DW_AT_data_member_location: 0
 <2><158>: Abbrev Number: 3 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x8f8aa): IFCR
    <15d>   DW_AT_decl_file   : 4
    <15e>   DW_AT_decl_line   : 359
    <160>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xc9>
    <165>   DW_AT_data_member_location: 4
 <2><166>: Abbrev Number: 0
 <1><167>: Abbrev Number: 11 (DW_TAG_typedef)
    <168>   DW_AT_name        : (indirect string, offset: 0x4aeb4): DMA_TypeDef
    <16c>   DW_AT_decl_file   : 4
    <16d>   DW_AT_decl_line   : 360
    <16f>   DW_AT_decl_column : 3
    <170>   DW_AT_type        : <0x143>
 <1><174>: Abbrev Number: 15 (DW_TAG_structure_type)
    <175>   DW_AT_byte_size   : 44
    <176>   DW_AT_decl_file   : 4
    <177>   DW_AT_decl_line   : 474
    <179>   DW_AT_decl_column : 9
    <179>   DW_AT_sibling     : <0x202>
 <2><17d>: Abbrev Number: 3 (DW_TAG_member)
    <17e>   DW_AT_name        : (indirect string, offset: 0x8536c): MODER
    <182>   DW_AT_decl_file   : 4
    <183>   DW_AT_decl_line   : 476
    <185>   DW_AT_decl_column : 17
    <186>   DW_AT_type        : <0xc9>
    <18a>   DW_AT_data_member_location: 0
 <2><18b>: Abbrev Number: 3 (DW_TAG_member)
    <18c>   DW_AT_name        : (indirect string, offset: 0x9e691): OTYPER
    <190>   DW_AT_decl_file   : 4
    <191>   DW_AT_decl_line   : 477
    <193>   DW_AT_decl_column : 17
    <194>   DW_AT_type        : <0xc9>
    <198>   DW_AT_data_member_location: 4
 <2><199>: Abbrev Number: 3 (DW_TAG_member)
    <19a>   DW_AT_name        : (indirect string, offset: 0xb220f): OSPEEDR
    <19e>   DW_AT_decl_file   : 4
    <19f>   DW_AT_decl_line   : 478
    <1a1>   DW_AT_decl_column : 17
    <1a2>   DW_AT_type        : <0xc9>
    <1a6>   DW_AT_data_member_location: 8
 <2><1a7>: Abbrev Number: 3 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0x845e6): PUPDR
    <1ac>   DW_AT_decl_file   : 4
    <1ad>   DW_AT_decl_line   : 479
    <1af>   DW_AT_decl_column : 17
    <1b0>   DW_AT_type        : <0xc9>
    <1b4>   DW_AT_data_member_location: 12
 <2><1b5>: Abbrev Number: 5 (DW_TAG_member)
    <1b6>   DW_AT_name        : IDR
    <1ba>   DW_AT_decl_file   : 4
    <1ba>   DW_AT_decl_line   : 480
    <1bc>   DW_AT_decl_column : 17
    <1bc>   DW_AT_type        : <0xc9>
    <1c0>   DW_AT_data_member_location: 16
 <2><1c1>: Abbrev Number: 5 (DW_TAG_member)
    <1c2>   DW_AT_name        : ODR
    <1c6>   DW_AT_decl_file   : 4
    <1c6>   DW_AT_decl_line   : 481
    <1c8>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0xc9>
    <1cc>   DW_AT_data_member_location: 20
 <2><1cd>: Abbrev Number: 3 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x2d841): BSRR
    <1d2>   DW_AT_decl_file   : 4
    <1d3>   DW_AT_decl_line   : 482
    <1d5>   DW_AT_decl_column : 17
    <1d6>   DW_AT_type        : <0xc9>
    <1da>   DW_AT_data_member_location: 24
 <2><1db>: Abbrev Number: 3 (DW_TAG_member)
    <1dc>   DW_AT_name        : (indirect string, offset: 0xafa5c): LCKR
    <1e0>   DW_AT_decl_file   : 4
    <1e1>   DW_AT_decl_line   : 483
    <1e3>   DW_AT_decl_column : 17
    <1e4>   DW_AT_type        : <0xc9>
    <1e8>   DW_AT_data_member_location: 28
 <2><1e9>: Abbrev Number: 5 (DW_TAG_member)
    <1ea>   DW_AT_name        : AFR
    <1ee>   DW_AT_decl_file   : 4
    <1ee>   DW_AT_decl_line   : 484
    <1f0>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0x212>
    <1f4>   DW_AT_data_member_location: 32
 <2><1f5>: Abbrev Number: 5 (DW_TAG_member)
    <1f6>   DW_AT_name        : BRR
    <1fa>   DW_AT_decl_file   : 4
    <1fa>   DW_AT_decl_line   : 485
    <1fc>   DW_AT_decl_column : 17
    <1fc>   DW_AT_type        : <0xc9>
    <200>   DW_AT_data_member_location: 40
 <2><201>: Abbrev Number: 0
 <1><202>: Abbrev Number: 16 (DW_TAG_array_type)
    <203>   DW_AT_type        : <0xc9>
    <207>   DW_AT_sibling     : <0x212>
 <2><20b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <20c>   DW_AT_type        : <0x31>
    <210>   DW_AT_upper_bound : 1
 <2><211>: Abbrev Number: 0
 <1><212>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <213>   DW_AT_type        : <0x202>
 <1><217>: Abbrev Number: 11 (DW_TAG_typedef)
    <218>   DW_AT_name        : (indirect string, offset: 0xc627a): GPIO_TypeDef
    <21c>   DW_AT_decl_file   : 4
    <21d>   DW_AT_decl_line   : 486
    <21f>   DW_AT_decl_column : 2
    <220>   DW_AT_type        : <0x174>
 <1><224>: Abbrev Number: 15 (DW_TAG_structure_type)
    <225>   DW_AT_byte_size   : 96
    <226>   DW_AT_decl_file   : 4
    <227>   DW_AT_decl_line   : 650
    <229>   DW_AT_decl_column : 9
    <229>   DW_AT_sibling     : <0x368>
 <2><22d>: Abbrev Number: 5 (DW_TAG_member)
    <22e>   DW_AT_name        : CR1
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 652
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xc9>
    <238>   DW_AT_data_member_location: 0
 <2><239>: Abbrev Number: 5 (DW_TAG_member)
    <23a>   DW_AT_name        : CR2
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 653
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xc9>
    <244>   DW_AT_data_member_location: 4
 <2><245>: Abbrev Number: 3 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x93827): SMCR
    <24a>   DW_AT_decl_file   : 4
    <24b>   DW_AT_decl_line   : 654
    <24d>   DW_AT_decl_column : 17
    <24e>   DW_AT_type        : <0xc9>
    <252>   DW_AT_data_member_location: 8
 <2><253>: Abbrev Number: 3 (DW_TAG_member)
    <254>   DW_AT_name        : (indirect string, offset: 0x43290): DIER
    <258>   DW_AT_decl_file   : 4
    <259>   DW_AT_decl_line   : 655
    <25b>   DW_AT_decl_column : 17
    <25c>   DW_AT_type        : <0xc9>
    <260>   DW_AT_data_member_location: 12
 <2><261>: Abbrev Number: 5 (DW_TAG_member)
    <262>   DW_AT_name        : SR
    <265>   DW_AT_decl_file   : 4
    <265>   DW_AT_decl_line   : 656
    <267>   DW_AT_decl_column : 17
    <267>   DW_AT_type        : <0xc9>
    <26b>   DW_AT_data_member_location: 16
 <2><26c>: Abbrev Number: 5 (DW_TAG_member)
    <26d>   DW_AT_name        : EGR
    <271>   DW_AT_decl_file   : 4
    <271>   DW_AT_decl_line   : 657
    <273>   DW_AT_decl_column : 17
    <273>   DW_AT_type        : <0xc9>
    <277>   DW_AT_data_member_location: 20
 <2><278>: Abbrev Number: 3 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x712f2): CCMR1
    <27d>   DW_AT_decl_file   : 4
    <27e>   DW_AT_decl_line   : 658
    <280>   DW_AT_decl_column : 17
    <281>   DW_AT_type        : <0xc9>
    <285>   DW_AT_data_member_location: 24
 <2><286>: Abbrev Number: 3 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x1707e): CCMR2
    <28b>   DW_AT_decl_file   : 4
    <28c>   DW_AT_decl_line   : 659
    <28e>   DW_AT_decl_column : 17
    <28f>   DW_AT_type        : <0xc9>
    <293>   DW_AT_data_member_location: 28
 <2><294>: Abbrev Number: 3 (DW_TAG_member)
    <295>   DW_AT_name        : (indirect string, offset: 0x31ef4): CCER
    <299>   DW_AT_decl_file   : 4
    <29a>   DW_AT_decl_line   : 660
    <29c>   DW_AT_decl_column : 17
    <29d>   DW_AT_type        : <0xc9>
    <2a1>   DW_AT_data_member_location: 32
 <2><2a2>: Abbrev Number: 5 (DW_TAG_member)
    <2a3>   DW_AT_name        : CNT
    <2a7>   DW_AT_decl_file   : 4
    <2a7>   DW_AT_decl_line   : 661
    <2a9>   DW_AT_decl_column : 17
    <2a9>   DW_AT_type        : <0xc9>
    <2ad>   DW_AT_data_member_location: 36
 <2><2ae>: Abbrev Number: 5 (DW_TAG_member)
    <2af>   DW_AT_name        : PSC
    <2b3>   DW_AT_decl_file   : 4
    <2b3>   DW_AT_decl_line   : 662
    <2b5>   DW_AT_decl_column : 17
    <2b5>   DW_AT_type        : <0xc9>
    <2b9>   DW_AT_data_member_location: 40
 <2><2ba>: Abbrev Number: 5 (DW_TAG_member)
    <2bb>   DW_AT_name        : ARR
    <2bf>   DW_AT_decl_file   : 4
    <2bf>   DW_AT_decl_line   : 663
    <2c1>   DW_AT_decl_column : 17
    <2c1>   DW_AT_type        : <0xc9>
    <2c5>   DW_AT_data_member_location: 44
 <2><2c6>: Abbrev Number: 5 (DW_TAG_member)
    <2c7>   DW_AT_name        : RCR
    <2cb>   DW_AT_decl_file   : 4
    <2cb>   DW_AT_decl_line   : 664
    <2cd>   DW_AT_decl_column : 17
    <2cd>   DW_AT_type        : <0xc9>
    <2d1>   DW_AT_data_member_location: 48
 <2><2d2>: Abbrev Number: 3 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x17ca9): CCR1
    <2d7>   DW_AT_decl_file   : 4
    <2d8>   DW_AT_decl_line   : 665
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0xc9>
    <2df>   DW_AT_data_member_location: 52
 <2><2e0>: Abbrev Number: 3 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x55b4c): CCR2
    <2e5>   DW_AT_decl_file   : 4
    <2e6>   DW_AT_decl_line   : 666
    <2e8>   DW_AT_decl_column : 17
    <2e9>   DW_AT_type        : <0xc9>
    <2ed>   DW_AT_data_member_location: 56
 <2><2ee>: Abbrev Number: 3 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0xa59f7): CCR3
    <2f3>   DW_AT_decl_file   : 4
    <2f4>   DW_AT_decl_line   : 667
    <2f6>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0xc9>
    <2fb>   DW_AT_data_member_location: 60
 <2><2fc>: Abbrev Number: 3 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0x32bb): CCR4
    <301>   DW_AT_decl_file   : 4
    <302>   DW_AT_decl_line   : 668
    <304>   DW_AT_decl_column : 17
    <305>   DW_AT_type        : <0xc9>
    <309>   DW_AT_data_member_location: 64
 <2><30a>: Abbrev Number: 3 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x5e2b9): BDTR
    <30f>   DW_AT_decl_file   : 4
    <310>   DW_AT_decl_line   : 669
    <312>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xc9>
    <317>   DW_AT_data_member_location: 68
 <2><318>: Abbrev Number: 5 (DW_TAG_member)
    <319>   DW_AT_name        : DCR
    <31d>   DW_AT_decl_file   : 4
    <31d>   DW_AT_decl_line   : 670
    <31f>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0xc9>
    <323>   DW_AT_data_member_location: 72
 <2><324>: Abbrev Number: 3 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x98412): DMAR
    <329>   DW_AT_decl_file   : 4
    <32a>   DW_AT_decl_line   : 671
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0xc9>
    <331>   DW_AT_data_member_location: 76
 <2><332>: Abbrev Number: 5 (DW_TAG_member)
    <333>   DW_AT_name        : OR
    <336>   DW_AT_decl_file   : 4
    <336>   DW_AT_decl_line   : 672
    <338>   DW_AT_decl_column : 17
    <338>   DW_AT_type        : <0xc9>
    <33c>   DW_AT_data_member_location: 80
 <2><33d>: Abbrev Number: 3 (DW_TAG_member)
    <33e>   DW_AT_name        : (indirect string, offset: 0xb6435): CCMR3
    <342>   DW_AT_decl_file   : 4
    <343>   DW_AT_decl_line   : 673
    <345>   DW_AT_decl_column : 17
    <346>   DW_AT_type        : <0xc9>
    <34a>   DW_AT_data_member_location: 84
 <2><34b>: Abbrev Number: 3 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0x4a565): CCR5
    <350>   DW_AT_decl_file   : 4
    <351>   DW_AT_decl_line   : 674
    <353>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0xc9>
    <358>   DW_AT_data_member_location: 88
 <2><359>: Abbrev Number: 3 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0x90e9c): CCR6
    <35e>   DW_AT_decl_file   : 4
    <35f>   DW_AT_decl_line   : 675
    <361>   DW_AT_decl_column : 17
    <362>   DW_AT_type        : <0xc9>
    <366>   DW_AT_data_member_location: 92
 <2><367>: Abbrev Number: 0
 <1><368>: Abbrev Number: 11 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0xc14c2): TIM_TypeDef
    <36d>   DW_AT_decl_file   : 4
    <36e>   DW_AT_decl_line   : 676
    <370>   DW_AT_decl_column : 3
    <371>   DW_AT_type        : <0x224>
 <1><375>: Abbrev Number: 15 (DW_TAG_structure_type)
    <376>   DW_AT_byte_size   : 44
    <377>   DW_AT_decl_file   : 4
    <378>   DW_AT_decl_line   : 703
    <37a>   DW_AT_decl_column : 9
    <37a>   DW_AT_sibling     : <0x423>
 <2><37e>: Abbrev Number: 5 (DW_TAG_member)
    <37f>   DW_AT_name        : CR1
    <383>   DW_AT_decl_file   : 4
    <383>   DW_AT_decl_line   : 705
    <385>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xc9>
    <389>   DW_AT_data_member_location: 0
 <2><38a>: Abbrev Number: 5 (DW_TAG_member)
    <38b>   DW_AT_name        : CR2
    <38f>   DW_AT_decl_file   : 4
    <38f>   DW_AT_decl_line   : 706
    <391>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0xc9>
    <395>   DW_AT_data_member_location: 4
 <2><396>: Abbrev Number: 5 (DW_TAG_member)
    <397>   DW_AT_name        : CR3
    <39b>   DW_AT_decl_file   : 4
    <39b>   DW_AT_decl_line   : 707
    <39d>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0xc9>
    <3a1>   DW_AT_data_member_location: 8
 <2><3a2>: Abbrev Number: 5 (DW_TAG_member)
    <3a3>   DW_AT_name        : BRR
    <3a7>   DW_AT_decl_file   : 4
    <3a7>   DW_AT_decl_line   : 708
    <3a9>   DW_AT_decl_column : 17
    <3a9>   DW_AT_type        : <0xc9>
    <3ad>   DW_AT_data_member_location: 12
 <2><3ae>: Abbrev Number: 3 (DW_TAG_member)
    <3af>   DW_AT_name        : (indirect string, offset: 0x39115): GTPR
    <3b3>   DW_AT_decl_file   : 4
    <3b4>   DW_AT_decl_line   : 709
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0xc9>
    <3bb>   DW_AT_data_member_location: 16
 <2><3bc>: Abbrev Number: 3 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0xb4569): RTOR
    <3c1>   DW_AT_decl_file   : 4
    <3c2>   DW_AT_decl_line   : 710
    <3c4>   DW_AT_decl_column : 17
    <3c5>   DW_AT_type        : <0xc9>
    <3c9>   DW_AT_data_member_location: 20
 <2><3ca>: Abbrev Number: 5 (DW_TAG_member)
    <3cb>   DW_AT_name        : RQR
    <3cf>   DW_AT_decl_file   : 4
    <3cf>   DW_AT_decl_line   : 711
    <3d1>   DW_AT_decl_column : 17
    <3d1>   DW_AT_type        : <0xc9>
    <3d5>   DW_AT_data_member_location: 24
 <2><3d6>: Abbrev Number: 5 (DW_TAG_member)
    <3d7>   DW_AT_name        : ISR
    <3db>   DW_AT_decl_file   : 4
    <3db>   DW_AT_decl_line   : 712
    <3dd>   DW_AT_decl_column : 17
    <3dd>   DW_AT_type        : <0xc9>
    <3e1>   DW_AT_data_member_location: 28
 <2><3e2>: Abbrev Number: 5 (DW_TAG_member)
    <3e3>   DW_AT_name        : ICR
    <3e7>   DW_AT_decl_file   : 4
    <3e7>   DW_AT_decl_line   : 713
    <3e9>   DW_AT_decl_column : 17
    <3e9>   DW_AT_type        : <0xc9>
    <3ed>   DW_AT_data_member_location: 32
 <2><3ee>: Abbrev Number: 5 (DW_TAG_member)
    <3ef>   DW_AT_name        : RDR
    <3f3>   DW_AT_decl_file   : 4
    <3f3>   DW_AT_decl_line   : 714
    <3f5>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0xb8>
    <3f9>   DW_AT_data_member_location: 36
 <2><3fa>: Abbrev Number: 3 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0xc0a55): RESERVED1
    <3ff>   DW_AT_decl_file   : 4
    <400>   DW_AT_decl_line   : 715
    <402>   DW_AT_decl_column : 13
    <403>   DW_AT_type        : <0xac>
    <407>   DW_AT_data_member_location: 38
 <2><408>: Abbrev Number: 5 (DW_TAG_member)
    <409>   DW_AT_name        : TDR
    <40d>   DW_AT_decl_file   : 4
    <40d>   DW_AT_decl_line   : 716
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0xb8>
    <413>   DW_AT_data_member_location: 40
 <2><414>: Abbrev Number: 3 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0xc0a5f): RESERVED2
    <419>   DW_AT_decl_file   : 4
    <41a>   DW_AT_decl_line   : 717
    <41c>   DW_AT_decl_column : 13
    <41d>   DW_AT_type        : <0xac>
    <421>   DW_AT_data_member_location: 42
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 11 (DW_TAG_typedef)
    <424>   DW_AT_name        : (indirect string, offset: 0x6de82): USART_TypeDef
    <428>   DW_AT_decl_file   : 4
    <429>   DW_AT_decl_line   : 718
    <42b>   DW_AT_decl_column : 3
    <42c>   DW_AT_type        : <0x375>
 <1><430>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <431>   DW_AT_encoding    : 7	(unsigned)
    <432>   DW_AT_byte_size   : 1
    <433>   DW_AT_type        : <0x59>
    <437>   DW_AT_decl_file   : 5
    <438>   DW_AT_decl_line   : 50
    <439>   DW_AT_decl_column : 1
    <43a>   DW_AT_sibling     : <0x44b>
 <2><43e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <43f>   DW_AT_name        : (indirect string, offset: 0x97b25): HAL_UNLOCKED
    <443>   DW_AT_const_value : 0
 <2><444>: Abbrev Number: 2 (DW_TAG_enumerator)
    <445>   DW_AT_name        : (indirect string, offset: 0xcb9fb): HAL_LOCKED
    <449>   DW_AT_const_value : 1
 <2><44a>: Abbrev Number: 0
 <1><44b>: Abbrev Number: 4 (DW_TAG_typedef)
    <44c>   DW_AT_name        : (indirect string, offset: 0x74b26): HAL_LockTypeDef
    <450>   DW_AT_decl_file   : 5
    <451>   DW_AT_decl_line   : 53
    <452>   DW_AT_decl_column : 3
    <453>   DW_AT_type        : <0x430>
 <1><457>: Abbrev Number: 12 (DW_TAG_structure_type)
    <458>   DW_AT_byte_size   : 28
    <459>   DW_AT_decl_file   : 6
    <45a>   DW_AT_decl_line   : 47
    <45b>   DW_AT_decl_column : 9
    <45b>   DW_AT_sibling     : <0x4bb>
 <2><45f>: Abbrev Number: 1 (DW_TAG_member)
    <460>   DW_AT_name        : (indirect string, offset: 0x4c06c): Direction
    <464>   DW_AT_decl_file   : 6
    <465>   DW_AT_decl_line   : 49
    <466>   DW_AT_decl_column : 12
    <467>   DW_AT_type        : <0xbd>
    <46b>   DW_AT_data_member_location: 0
 <2><46c>: Abbrev Number: 1 (DW_TAG_member)
    <46d>   DW_AT_name        : (indirect string, offset: 0xd17d): PeriphInc
    <471>   DW_AT_decl_file   : 6
    <472>   DW_AT_decl_line   : 53
    <473>   DW_AT_decl_column : 12
    <474>   DW_AT_type        : <0xbd>
    <478>   DW_AT_data_member_location: 4
 <2><479>: Abbrev Number: 1 (DW_TAG_member)
    <47a>   DW_AT_name        : (indirect string, offset: 0x1fed7): MemInc
    <47e>   DW_AT_decl_file   : 6
    <47f>   DW_AT_decl_line   : 56
    <480>   DW_AT_decl_column : 12
    <481>   DW_AT_type        : <0xbd>
    <485>   DW_AT_data_member_location: 8
 <2><486>: Abbrev Number: 1 (DW_TAG_member)
    <487>   DW_AT_name        : (indirect string, offset: 0x65e0d): PeriphDataAlignment
    <48b>   DW_AT_decl_file   : 6
    <48c>   DW_AT_decl_line   : 59
    <48d>   DW_AT_decl_column : 12
    <48e>   DW_AT_type        : <0xbd>
    <492>   DW_AT_data_member_location: 12
 <2><493>: Abbrev Number: 1 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0xb89ea): MemDataAlignment
    <498>   DW_AT_decl_file   : 6
    <499>   DW_AT_decl_line   : 62
    <49a>   DW_AT_decl_column : 12
    <49b>   DW_AT_type        : <0xbd>
    <49f>   DW_AT_data_member_location: 16
 <2><4a0>: Abbrev Number: 1 (DW_TAG_member)
    <4a1>   DW_AT_name        : (indirect string, offset: 0xcec06): Mode
    <4a5>   DW_AT_decl_file   : 6
    <4a6>   DW_AT_decl_line   : 65
    <4a7>   DW_AT_decl_column : 12
    <4a8>   DW_AT_type        : <0xbd>
    <4ac>   DW_AT_data_member_location: 20
 <2><4ad>: Abbrev Number: 1 (DW_TAG_member)
    <4ae>   DW_AT_name        : (indirect string, offset: 0xcf5f9): Priority
    <4b2>   DW_AT_decl_file   : 6
    <4b3>   DW_AT_decl_line   : 70
    <4b4>   DW_AT_decl_column : 12
    <4b5>   DW_AT_type        : <0xbd>
    <4b9>   DW_AT_data_member_location: 24
 <2><4ba>: Abbrev Number: 0
 <1><4bb>: Abbrev Number: 4 (DW_TAG_typedef)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x37457): DMA_InitTypeDef
    <4c0>   DW_AT_decl_file   : 6
    <4c1>   DW_AT_decl_line   : 72
    <4c2>   DW_AT_decl_column : 3
    <4c3>   DW_AT_type        : <0x457>
 <1><4c7>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <4c8>   DW_AT_encoding    : 7	(unsigned)
    <4c9>   DW_AT_byte_size   : 1
    <4ca>   DW_AT_type        : <0x59>
    <4ce>   DW_AT_decl_file   : 6
    <4cf>   DW_AT_decl_line   : 78
    <4d0>   DW_AT_decl_column : 1
    <4d1>   DW_AT_sibling     : <0x4ee>
 <2><4d5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x98e35): HAL_DMA_STATE_RESET
    <4da>   DW_AT_const_value : 0
 <2><4db>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x38772): HAL_DMA_STATE_READY
    <4e0>   DW_AT_const_value : 1
 <2><4e1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x8e185): HAL_DMA_STATE_BUSY
    <4e6>   DW_AT_const_value : 2
 <2><4e7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4e8>   DW_AT_name        : (indirect string, offset: 0xc8c1e): HAL_DMA_STATE_TIMEOUT
    <4ec>   DW_AT_const_value : 3
 <2><4ed>: Abbrev Number: 0
 <1><4ee>: Abbrev Number: 4 (DW_TAG_typedef)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x88649): HAL_DMA_StateTypeDef
    <4f3>   DW_AT_decl_file   : 6
    <4f4>   DW_AT_decl_line   : 83
    <4f5>   DW_AT_decl_column : 2
    <4f6>   DW_AT_type        : <0x4c7>
 <1><4fa>: Abbrev Number: 24 (DW_TAG_structure_type)
    <4fb>   DW_AT_name        : (indirect string, offset: 0xae891): __DMA_HandleTypeDef
    <4ff>   DW_AT_byte_size   : 68
    <500>   DW_AT_decl_file   : 6
    <501>   DW_AT_decl_line   : 109
    <502>   DW_AT_decl_column : 16
    <502>   DW_AT_sibling     : <0x5a3>
 <2><506>: Abbrev Number: 1 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x4fc41): Instance
    <50b>   DW_AT_decl_file   : 6
    <50c>   DW_AT_decl_line   : 111
    <50d>   DW_AT_decl_column : 26
    <50e>   DW_AT_type        : <0x5a3>
    <512>   DW_AT_data_member_location: 0
 <2><513>: Abbrev Number: 1 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0xccaa7): Init
    <518>   DW_AT_decl_file   : 6
    <519>   DW_AT_decl_line   : 113
    <51a>   DW_AT_decl_column : 25
    <51b>   DW_AT_type        : <0x4bb>
    <51f>   DW_AT_data_member_location: 4
 <2><520>: Abbrev Number: 1 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x75c1b): Lock
    <525>   DW_AT_decl_file   : 6
    <526>   DW_AT_decl_line   : 115
    <527>   DW_AT_decl_column : 25
    <528>   DW_AT_type        : <0x44b>
    <52c>   DW_AT_data_member_location: 32
 <2><52d>: Abbrev Number: 1 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0xced27): State
    <532>   DW_AT_decl_file   : 6
    <533>   DW_AT_decl_line   : 117
    <534>   DW_AT_decl_column : 25
    <535>   DW_AT_type        : <0x4ee>
    <539>   DW_AT_data_member_location: 33
 <2><53a>: Abbrev Number: 1 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0xc237b): Parent
    <53f>   DW_AT_decl_file   : 6
    <540>   DW_AT_decl_line   : 119
    <541>   DW_AT_decl_column : 26
    <542>   DW_AT_type        : <0xde>
    <546>   DW_AT_data_member_location: 36
 <2><547>: Abbrev Number: 1 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0xcaf89): XferCpltCallback
    <54c>   DW_AT_decl_file   : 6
    <54d>   DW_AT_decl_line   : 121
    <54e>   DW_AT_decl_column : 28
    <54f>   DW_AT_type        : <0x5b8>
    <553>   DW_AT_data_member_location: 40
 <2><554>: Abbrev Number: 1 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x9f2d6): XferHalfCpltCallback
    <559>   DW_AT_decl_file   : 6
    <55a>   DW_AT_decl_line   : 123
    <55b>   DW_AT_decl_column : 28
    <55c>   DW_AT_type        : <0x5b8>
    <560>   DW_AT_data_member_location: 44
 <2><561>: Abbrev Number: 1 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x1d184): XferErrorCallback
    <566>   DW_AT_decl_file   : 6
    <567>   DW_AT_decl_line   : 125
    <568>   DW_AT_decl_column : 28
    <569>   DW_AT_type        : <0x5b8>
    <56d>   DW_AT_data_member_location: 48
 <2><56e>: Abbrev Number: 1 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0x6f045): XferAbortCallback
    <573>   DW_AT_decl_file   : 6
    <574>   DW_AT_decl_line   : 127
    <575>   DW_AT_decl_column : 28
    <576>   DW_AT_type        : <0x5b8>
    <57a>   DW_AT_data_member_location: 52
 <2><57b>: Abbrev Number: 1 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0xc7614): ErrorCode
    <580>   DW_AT_decl_file   : 6
    <581>   DW_AT_decl_line   : 129
    <582>   DW_AT_decl_column : 25
    <583>   DW_AT_type        : <0xc9>
    <587>   DW_AT_data_member_location: 56
 <2><588>: Abbrev Number: 1 (DW_TAG_member)
    <589>   DW_AT_name        : (indirect string, offset: 0x5727d): DmaBaseAddress
    <58d>   DW_AT_decl_file   : 6
    <58e>   DW_AT_decl_line   : 131
    <58f>   DW_AT_decl_column : 25
    <590>   DW_AT_type        : <0x5bd>
    <594>   DW_AT_data_member_location: 60
 <2><595>: Abbrev Number: 1 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x29df4): ChannelIndex
    <59a>   DW_AT_decl_file   : 6
    <59b>   DW_AT_decl_line   : 133
    <59c>   DW_AT_decl_column : 25
    <59d>   DW_AT_type        : <0xbd>
    <5a1>   DW_AT_data_member_location: 64
 <2><5a2>: Abbrev Number: 0
 <1><5a3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5a4>   DW_AT_byte_size   : 4
    <5a4>   DW_AT_type        : <0x136>
 <1><5a8>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5a9>   DW_AT_prototyped  : 1
    <5a9>   DW_AT_sibling     : <0x5b3>
 <2><5ad>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <5ae>   DW_AT_type        : <0x5b3>
 <2><5b2>: Abbrev Number: 0
 <1><5b3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b4>   DW_AT_byte_size   : 4
    <5b4>   DW_AT_type        : <0x4fa>
 <1><5b8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b9>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x5a8>
 <1><5bd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5be>   DW_AT_byte_size   : 4
    <5be>   DW_AT_type        : <0x167>
 <1><5c2>: Abbrev Number: 4 (DW_TAG_typedef)
    <5c3>   DW_AT_name        : (indirect string, offset: 0xae893): DMA_HandleTypeDef
    <5c7>   DW_AT_decl_file   : 6
    <5c8>   DW_AT_decl_line   : 134
    <5c9>   DW_AT_decl_column : 3
    <5ca>   DW_AT_type        : <0x4fa>
 <1><5ce>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5cf>   DW_AT_byte_size   : 4
    <5cf>   DW_AT_type        : <0x5c2>
 <1><5d3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <5d4>   DW_AT_byte_size   : 24
    <5d5>   DW_AT_decl_file   : 7
    <5d6>   DW_AT_decl_line   : 46
    <5d7>   DW_AT_decl_column : 9
    <5d7>   DW_AT_sibling     : <0x62a>
 <2><5db>: Abbrev Number: 1 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0xcd312): Prescaler
    <5e0>   DW_AT_decl_file   : 7
    <5e1>   DW_AT_decl_line   : 48
    <5e2>   DW_AT_decl_column : 12
    <5e3>   DW_AT_type        : <0xbd>
    <5e7>   DW_AT_data_member_location: 0
 <2><5e8>: Abbrev Number: 1 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0xb983c): CounterMode
    <5ed>   DW_AT_decl_file   : 7
    <5ee>   DW_AT_decl_line   : 51
    <5ef>   DW_AT_decl_column : 12
    <5f0>   DW_AT_type        : <0xbd>
    <5f4>   DW_AT_data_member_location: 4
 <2><5f5>: Abbrev Number: 1 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xd649f): Period
    <5fa>   DW_AT_decl_file   : 7
    <5fb>   DW_AT_decl_line   : 54
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xbd>
    <601>   DW_AT_data_member_location: 8
 <2><602>: Abbrev Number: 1 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0x530fe): ClockDivision
    <607>   DW_AT_decl_file   : 7
    <608>   DW_AT_decl_line   : 58
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xbd>
    <60e>   DW_AT_data_member_location: 12
 <2><60f>: Abbrev Number: 1 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x8f9a5): RepetitionCounter
    <614>   DW_AT_decl_file   : 7
    <615>   DW_AT_decl_line   : 61
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xbd>
    <61b>   DW_AT_data_member_location: 16
 <2><61c>: Abbrev Number: 1 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x13946): AutoReloadPreload
    <621>   DW_AT_decl_file   : 7
    <622>   DW_AT_decl_line   : 72
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xbd>
    <628>   DW_AT_data_member_location: 20
 <2><629>: Abbrev Number: 0
 <1><62a>: Abbrev Number: 4 (DW_TAG_typedef)
    <62b>   DW_AT_name        : (indirect string, offset: 0x46c07): TIM_Base_InitTypeDef
    <62f>   DW_AT_decl_file   : 7
    <630>   DW_AT_decl_line   : 74
    <631>   DW_AT_decl_column : 3
    <632>   DW_AT_type        : <0x5d3>
 <1><636>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <637>   DW_AT_encoding    : 7	(unsigned)
    <637>   DW_AT_byte_size   : 1
    <637>   DW_AT_type        : <0x59>
    <63b>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 305
    <63d>   DW_AT_decl_column : 1
    <63d>   DW_AT_sibling     : <0x660>
 <2><641>: Abbrev Number: 2 (DW_TAG_enumerator)
    <642>   DW_AT_name        : (indirect string, offset: 0x67567): HAL_TIM_STATE_RESET
    <646>   DW_AT_const_value : 0
 <2><647>: Abbrev Number: 2 (DW_TAG_enumerator)
    <648>   DW_AT_name        : (indirect string, offset: 0x74e4): HAL_TIM_STATE_READY
    <64c>   DW_AT_const_value : 1
 <2><64d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <64e>   DW_AT_name        : (indirect string, offset: 0x33e96): HAL_TIM_STATE_BUSY
    <652>   DW_AT_const_value : 2
 <2><653>: Abbrev Number: 2 (DW_TAG_enumerator)
    <654>   DW_AT_name        : (indirect string, offset: 0xab2cc): HAL_TIM_STATE_TIMEOUT
    <658>   DW_AT_const_value : 3
 <2><659>: Abbrev Number: 2 (DW_TAG_enumerator)
    <65a>   DW_AT_name        : (indirect string, offset: 0x7e146): HAL_TIM_STATE_ERROR
    <65e>   DW_AT_const_value : 4
 <2><65f>: Abbrev Number: 0
 <1><660>: Abbrev Number: 11 (DW_TAG_typedef)
    <661>   DW_AT_name        : (indirect string, offset: 0x94d2f): HAL_TIM_StateTypeDef
    <665>   DW_AT_decl_file   : 7
    <666>   DW_AT_decl_line   : 311
    <668>   DW_AT_decl_column : 3
    <669>   DW_AT_type        : <0x636>
 <1><66d>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <66e>   DW_AT_type        : <0x660>
 <1><672>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <673>   DW_AT_encoding    : 7	(unsigned)
    <673>   DW_AT_byte_size   : 1
    <673>   DW_AT_type        : <0x59>
    <677>   DW_AT_decl_file   : 7
    <677>   DW_AT_decl_line   : 317
    <679>   DW_AT_decl_column : 1
    <679>   DW_AT_sibling     : <0x690>
 <2><67d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <67e>   DW_AT_name        : (indirect string, offset: 0xaed4): HAL_TIM_CHANNEL_STATE_RESET
    <682>   DW_AT_const_value : 0
 <2><683>: Abbrev Number: 2 (DW_TAG_enumerator)
    <684>   DW_AT_name        : (indirect string, offset: 0x9d7c9): HAL_TIM_CHANNEL_STATE_READY
    <688>   DW_AT_const_value : 1
 <2><689>: Abbrev Number: 2 (DW_TAG_enumerator)
    <68a>   DW_AT_name        : (indirect string, offset: 0x62ba2): HAL_TIM_CHANNEL_STATE_BUSY
    <68e>   DW_AT_const_value : 2
 <2><68f>: Abbrev Number: 0
 <1><690>: Abbrev Number: 11 (DW_TAG_typedef)
    <691>   DW_AT_name        : (indirect string, offset: 0x2a4b6): HAL_TIM_ChannelStateTypeDef
    <695>   DW_AT_decl_file   : 7
    <696>   DW_AT_decl_line   : 321
    <698>   DW_AT_decl_column : 3
    <699>   DW_AT_type        : <0x672>
 <1><69d>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <69e>   DW_AT_type        : <0x690>
 <1><6a2>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <6a3>   DW_AT_encoding    : 7	(unsigned)
    <6a3>   DW_AT_byte_size   : 1
    <6a3>   DW_AT_type        : <0x59>
    <6a7>   DW_AT_decl_file   : 7
    <6a7>   DW_AT_decl_line   : 327
    <6a9>   DW_AT_decl_column : 1
    <6a9>   DW_AT_sibling     : <0x6c0>
 <2><6ad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x3fde): HAL_DMA_BURST_STATE_RESET
    <6b2>   DW_AT_const_value : 0
 <2><6b3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x7124b): HAL_DMA_BURST_STATE_READY
    <6b8>   DW_AT_const_value : 1
 <2><6b9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x9a0c3): HAL_DMA_BURST_STATE_BUSY
    <6be>   DW_AT_const_value : 2
 <2><6bf>: Abbrev Number: 0
 <1><6c0>: Abbrev Number: 11 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x1b792): HAL_TIM_DMABurstStateTypeDef
    <6c5>   DW_AT_decl_file   : 7
    <6c6>   DW_AT_decl_line   : 331
    <6c8>   DW_AT_decl_column : 3
    <6c9>   DW_AT_type        : <0x6a2>
 <1><6cd>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <6ce>   DW_AT_type        : <0x6c0>
 <1><6d2>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <6d3>   DW_AT_encoding    : 7	(unsigned)
    <6d3>   DW_AT_byte_size   : 1
    <6d3>   DW_AT_type        : <0x59>
    <6d7>   DW_AT_decl_file   : 7
    <6d7>   DW_AT_decl_line   : 337
    <6d9>   DW_AT_decl_column : 1
    <6d9>   DW_AT_sibling     : <0x708>
 <2><6dd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0x73880): HAL_TIM_ACTIVE_CHANNEL_1
    <6e2>   DW_AT_const_value : 1
 <2><6e3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x73899): HAL_TIM_ACTIVE_CHANNEL_2
    <6e8>   DW_AT_const_value : 2
 <2><6e9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6ea>   DW_AT_name        : (indirect string, offset: 0x738b2): HAL_TIM_ACTIVE_CHANNEL_3
    <6ee>   DW_AT_const_value : 4
 <2><6ef>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x738cb): HAL_TIM_ACTIVE_CHANNEL_4
    <6f4>   DW_AT_const_value : 8
 <2><6f5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xaf6e): HAL_TIM_ACTIVE_CHANNEL_5
    <6fa>   DW_AT_const_value : 16
 <2><6fb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x73904): HAL_TIM_ACTIVE_CHANNEL_6
    <700>   DW_AT_const_value : 32
 <2><701>: Abbrev Number: 2 (DW_TAG_enumerator)
    <702>   DW_AT_name        : (indirect string, offset: 0x543d7): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <706>   DW_AT_const_value : 0
 <2><707>: Abbrev Number: 0
 <1><708>: Abbrev Number: 11 (DW_TAG_typedef)
    <709>   DW_AT_name        : (indirect string, offset: 0x6a8be): HAL_TIM_ActiveChannel
    <70d>   DW_AT_decl_file   : 7
    <70e>   DW_AT_decl_line   : 349
    <710>   DW_AT_decl_column : 3
    <711>   DW_AT_type        : <0x6d2>
 <1><715>: Abbrev Number: 15 (DW_TAG_structure_type)
    <716>   DW_AT_byte_size   : 76
    <717>   DW_AT_decl_file   : 7
    <718>   DW_AT_decl_line   : 357
    <71a>   DW_AT_decl_column : 9
    <71a>   DW_AT_sibling     : <0x79d>
 <2><71e>: Abbrev Number: 3 (DW_TAG_member)
    <71f>   DW_AT_name        : (indirect string, offset: 0x4fc41): Instance
    <723>   DW_AT_decl_file   : 7
    <724>   DW_AT_decl_line   : 360
    <726>   DW_AT_decl_column : 39
    <727>   DW_AT_type        : <0x79d>
    <72b>   DW_AT_data_member_location: 0
 <2><72c>: Abbrev Number: 3 (DW_TAG_member)
    <72d>   DW_AT_name        : (indirect string, offset: 0xccaa7): Init
    <731>   DW_AT_decl_file   : 7
    <732>   DW_AT_decl_line   : 361
    <734>   DW_AT_decl_column : 38
    <735>   DW_AT_type        : <0x62a>
    <739>   DW_AT_data_member_location: 4
 <2><73a>: Abbrev Number: 3 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0x4207b): Channel
    <73f>   DW_AT_decl_file   : 7
    <740>   DW_AT_decl_line   : 362
    <742>   DW_AT_decl_column : 38
    <743>   DW_AT_type        : <0x708>
    <747>   DW_AT_data_member_location: 28
 <2><748>: Abbrev Number: 3 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0x7ab12): hdma
    <74d>   DW_AT_decl_file   : 7
    <74e>   DW_AT_decl_line   : 363
    <750>   DW_AT_decl_column : 39
    <751>   DW_AT_type        : <0x7a2>
    <755>   DW_AT_data_member_location: 32
 <2><756>: Abbrev Number: 3 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x75c1b): Lock
    <75b>   DW_AT_decl_file   : 7
    <75c>   DW_AT_decl_line   : 365
    <75e>   DW_AT_decl_column : 38
    <75f>   DW_AT_type        : <0x44b>
    <763>   DW_AT_data_member_location: 60
 <2><764>: Abbrev Number: 3 (DW_TAG_member)
    <765>   DW_AT_name        : (indirect string, offset: 0xced27): State
    <769>   DW_AT_decl_file   : 7
    <76a>   DW_AT_decl_line   : 366
    <76c>   DW_AT_decl_column : 38
    <76d>   DW_AT_type        : <0x66d>
    <771>   DW_AT_data_member_location: 61
 <2><772>: Abbrev Number: 3 (DW_TAG_member)
    <773>   DW_AT_name        : (indirect string, offset: 0xd09c6): ChannelState
    <777>   DW_AT_decl_file   : 7
    <778>   DW_AT_decl_line   : 367
    <77a>   DW_AT_decl_column : 38
    <77b>   DW_AT_type        : <0x7c2>
    <77f>   DW_AT_data_member_location: 62
 <2><780>: Abbrev Number: 3 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0xd0eaf): ChannelNState
    <785>   DW_AT_decl_file   : 7
    <786>   DW_AT_decl_line   : 368
    <788>   DW_AT_decl_column : 38
    <789>   DW_AT_type        : <0x7d7>
    <78d>   DW_AT_data_member_location: 68
 <2><78e>: Abbrev Number: 3 (DW_TAG_member)
    <78f>   DW_AT_name        : (indirect string, offset: 0xd05af): DMABurstState
    <793>   DW_AT_decl_file   : 7
    <794>   DW_AT_decl_line   : 369
    <796>   DW_AT_decl_column : 38
    <797>   DW_AT_type        : <0x6cd>
    <79b>   DW_AT_data_member_location: 72
 <2><79c>: Abbrev Number: 0
 <1><79d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <79e>   DW_AT_byte_size   : 4
    <79e>   DW_AT_type        : <0x368>
 <1><7a2>: Abbrev Number: 16 (DW_TAG_array_type)
    <7a3>   DW_AT_type        : <0x5ce>
    <7a7>   DW_AT_sibling     : <0x7b2>
 <2><7ab>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <7ac>   DW_AT_type        : <0x31>
    <7b0>   DW_AT_upper_bound : 6
 <2><7b1>: Abbrev Number: 0
 <1><7b2>: Abbrev Number: 16 (DW_TAG_array_type)
    <7b3>   DW_AT_type        : <0x69d>
    <7b7>   DW_AT_sibling     : <0x7c2>
 <2><7bb>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <7bc>   DW_AT_type        : <0x31>
    <7c0>   DW_AT_upper_bound : 5
 <2><7c1>: Abbrev Number: 0
 <1><7c2>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <7c3>   DW_AT_type        : <0x7b2>
 <1><7c7>: Abbrev Number: 16 (DW_TAG_array_type)
    <7c8>   DW_AT_type        : <0x69d>
    <7cc>   DW_AT_sibling     : <0x7d7>
 <2><7d0>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <7d1>   DW_AT_type        : <0x31>
    <7d5>   DW_AT_upper_bound : 3
 <2><7d6>: Abbrev Number: 0
 <1><7d7>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <7d8>   DW_AT_type        : <0x7c7>
 <1><7dc>: Abbrev Number: 11 (DW_TAG_typedef)
    <7dd>   DW_AT_name        : (indirect string, offset: 0x46615): TIM_HandleTypeDef
    <7e1>   DW_AT_decl_file   : 7
    <7e2>   DW_AT_decl_line   : 403
    <7e4>   DW_AT_decl_column : 3
    <7e5>   DW_AT_type        : <0x715>
 <1><7e9>: Abbrev Number: 12 (DW_TAG_structure_type)
    <7ea>   DW_AT_byte_size   : 32
    <7eb>   DW_AT_decl_file   : 8
    <7ec>   DW_AT_decl_line   : 46
    <7ed>   DW_AT_decl_column : 9
    <7ed>   DW_AT_sibling     : <0x85a>
 <2><7f1>: Abbrev Number: 1 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0xbae44): BaudRate
    <7f6>   DW_AT_decl_file   : 8
    <7f7>   DW_AT_decl_line   : 48
    <7f8>   DW_AT_decl_column : 12
    <7f9>   DW_AT_type        : <0xbd>
    <7fd>   DW_AT_data_member_location: 0
 <2><7fe>: Abbrev Number: 1 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x5df1): WordLength
    <803>   DW_AT_decl_file   : 8
    <804>   DW_AT_decl_line   : 60
    <805>   DW_AT_decl_column : 12
    <806>   DW_AT_type        : <0xbd>
    <80a>   DW_AT_data_member_location: 4
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0xbb197): StopBits
    <810>   DW_AT_decl_file   : 8
    <811>   DW_AT_decl_line   : 63
    <812>   DW_AT_decl_column : 12
    <813>   DW_AT_type        : <0xbd>
    <817>   DW_AT_data_member_location: 8
 <2><818>: Abbrev Number: 1 (DW_TAG_member)
    <819>   DW_AT_name        : (indirect string, offset: 0x4a0b3): Parity
    <81d>   DW_AT_decl_file   : 8
    <81e>   DW_AT_decl_line   : 66
    <81f>   DW_AT_decl_column : 12
    <820>   DW_AT_type        : <0xbd>
    <824>   DW_AT_data_member_location: 12
 <2><825>: Abbrev Number: 1 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0xcec06): Mode
    <82a>   DW_AT_decl_file   : 8
    <82b>   DW_AT_decl_line   : 73
    <82c>   DW_AT_decl_column : 12
    <82d>   DW_AT_type        : <0xbd>
    <831>   DW_AT_data_member_location: 16
 <2><832>: Abbrev Number: 1 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0x790e8): HwFlowCtl
    <837>   DW_AT_decl_file   : 8
    <838>   DW_AT_decl_line   : 76
    <839>   DW_AT_decl_column : 12
    <83a>   DW_AT_type        : <0xbd>
    <83e>   DW_AT_data_member_location: 20
 <2><83f>: Abbrev Number: 1 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0xac015): OverSampling
    <844>   DW_AT_decl_file   : 8
    <845>   DW_AT_decl_line   : 80
    <846>   DW_AT_decl_column : 12
    <847>   DW_AT_type        : <0xbd>
    <84b>   DW_AT_data_member_location: 24
 <2><84c>: Abbrev Number: 1 (DW_TAG_member)
    <84d>   DW_AT_name        : (indirect string, offset: 0x2907e): OneBitSampling
    <851>   DW_AT_decl_file   : 8
    <852>   DW_AT_decl_line   : 84
    <853>   DW_AT_decl_column : 12
    <854>   DW_AT_type        : <0xbd>
    <858>   DW_AT_data_member_location: 28
 <2><859>: Abbrev Number: 0
 <1><85a>: Abbrev Number: 4 (DW_TAG_typedef)
    <85b>   DW_AT_name        : (indirect string, offset: 0x39b85): UART_InitTypeDef
    <85f>   DW_AT_decl_file   : 8
    <860>   DW_AT_decl_line   : 89
    <861>   DW_AT_decl_column : 3
    <862>   DW_AT_type        : <0x7e9>
 <1><866>: Abbrev Number: 12 (DW_TAG_structure_type)
    <867>   DW_AT_byte_size   : 40
    <868>   DW_AT_decl_file   : 8
    <869>   DW_AT_decl_line   : 94
    <86a>   DW_AT_decl_column : 9
    <86a>   DW_AT_sibling     : <0x8f1>
 <2><86e>: Abbrev Number: 1 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0x7ded4): AdvFeatureInit
    <873>   DW_AT_decl_file   : 8
    <874>   DW_AT_decl_line   : 96
    <875>   DW_AT_decl_column : 12
    <876>   DW_AT_type        : <0xbd>
    <87a>   DW_AT_data_member_location: 0
 <2><87b>: Abbrev Number: 1 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0xbe502): TxPinLevelInvert
    <880>   DW_AT_decl_file   : 8
    <881>   DW_AT_decl_line   : 101
    <882>   DW_AT_decl_column : 12
    <883>   DW_AT_type        : <0xbd>
    <887>   DW_AT_data_member_location: 4
 <2><888>: Abbrev Number: 1 (DW_TAG_member)
    <889>   DW_AT_name        : (indirect string, offset: 0xac49a): RxPinLevelInvert
    <88d>   DW_AT_decl_file   : 8
    <88e>   DW_AT_decl_line   : 104
    <88f>   DW_AT_decl_column : 12
    <890>   DW_AT_type        : <0xbd>
    <894>   DW_AT_data_member_location: 8
 <2><895>: Abbrev Number: 1 (DW_TAG_member)
    <896>   DW_AT_name        : (indirect string, offset: 0x89b3d): DataInvert
    <89a>   DW_AT_decl_file   : 8
    <89b>   DW_AT_decl_line   : 107
    <89c>   DW_AT_decl_column : 12
    <89d>   DW_AT_type        : <0xbd>
    <8a1>   DW_AT_data_member_location: 12
 <2><8a2>: Abbrev Number: 1 (DW_TAG_member)
    <8a3>   DW_AT_name        : (indirect string, offset: 0x40d8a): Swap
    <8a7>   DW_AT_decl_file   : 8
    <8a8>   DW_AT_decl_line   : 111
    <8a9>   DW_AT_decl_column : 12
    <8aa>   DW_AT_type        : <0xbd>
    <8ae>   DW_AT_data_member_location: 16
 <2><8af>: Abbrev Number: 1 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x9eaf5): OverrunDisable
    <8b4>   DW_AT_decl_file   : 8
    <8b5>   DW_AT_decl_line   : 114
    <8b6>   DW_AT_decl_column : 12
    <8b7>   DW_AT_type        : <0xbd>
    <8bb>   DW_AT_data_member_location: 20
 <2><8bc>: Abbrev Number: 1 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x41de3): DMADisableonRxError
    <8c1>   DW_AT_decl_file   : 8
    <8c2>   DW_AT_decl_line   : 117
    <8c3>   DW_AT_decl_column : 12
    <8c4>   DW_AT_type        : <0xbd>
    <8c8>   DW_AT_data_member_location: 24
 <2><8c9>: Abbrev Number: 1 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xc711e): AutoBaudRateEnable
    <8ce>   DW_AT_decl_file   : 8
    <8cf>   DW_AT_decl_line   : 120
    <8d0>   DW_AT_decl_column : 12
    <8d1>   DW_AT_type        : <0xbd>
    <8d5>   DW_AT_data_member_location: 28
 <2><8d6>: Abbrev Number: 1 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0xae1fb): AutoBaudRateMode
    <8db>   DW_AT_decl_file   : 8
    <8dc>   DW_AT_decl_line   : 123
    <8dd>   DW_AT_decl_column : 12
    <8de>   DW_AT_type        : <0xbd>
    <8e2>   DW_AT_data_member_location: 32
 <2><8e3>: Abbrev Number: 1 (DW_TAG_member)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x5a4c6): MSBFirst
    <8e8>   DW_AT_decl_file   : 8
    <8e9>   DW_AT_decl_line   : 127
    <8ea>   DW_AT_decl_column : 12
    <8eb>   DW_AT_type        : <0xbd>
    <8ef>   DW_AT_data_member_location: 36
 <2><8f0>: Abbrev Number: 0
 <1><8f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f2>   DW_AT_name        : (indirect string, offset: 0x98ac3): UART_AdvFeatureInitTypeDef
    <8f6>   DW_AT_decl_file   : 8
    <8f7>   DW_AT_decl_line   : 129
    <8f8>   DW_AT_decl_column : 3
    <8f9>   DW_AT_type        : <0x866>
 <1><8fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x3e537): HAL_UART_StateTypeDef
    <902>   DW_AT_decl_file   : 8
    <903>   DW_AT_decl_line   : 171
    <904>   DW_AT_decl_column : 18
    <905>   DW_AT_type        : <0xbd>
 <1><909>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <90a>   DW_AT_type        : <0x8fd>
 <1><90e>: Abbrev Number: 4 (DW_TAG_typedef)
    <90f>   DW_AT_name        : (indirect string, offset: 0x53a9d): HAL_UART_RxTypeTypeDef
    <913>   DW_AT_decl_file   : 8
    <914>   DW_AT_decl_line   : 195
    <915>   DW_AT_decl_column : 18
    <916>   DW_AT_type        : <0xbd>
 <1><91a>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <91b>   DW_AT_type        : <0x90e>
 <1><91f>: Abbrev Number: 4 (DW_TAG_typedef)
    <920>   DW_AT_name        : (indirect string, offset: 0x19002): HAL_UART_RxEventTypeTypeDef
    <924>   DW_AT_decl_file   : 8
    <925>   DW_AT_decl_line   : 206
    <926>   DW_AT_decl_column : 18
    <927>   DW_AT_type        : <0xbd>
 <1><92b>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <92c>   DW_AT_type        : <0x91f>
 <1><930>: Abbrev Number: 24 (DW_TAG_structure_type)
    <931>   DW_AT_name        : (indirect string, offset: 0x76b5c): __UART_HandleTypeDef
    <935>   DW_AT_byte_size   : 136
    <936>   DW_AT_decl_file   : 8
    <937>   DW_AT_decl_line   : 211
    <938>   DW_AT_decl_column : 16
    <938>   DW_AT_sibling     : <0xa41>
 <2><93c>: Abbrev Number: 1 (DW_TAG_member)
    <93d>   DW_AT_name        : (indirect string, offset: 0x4fc41): Instance
    <941>   DW_AT_decl_file   : 8
    <942>   DW_AT_decl_line   : 213
    <943>   DW_AT_decl_column : 29
    <944>   DW_AT_type        : <0xa41>
    <948>   DW_AT_data_member_location: 0
 <2><949>: Abbrev Number: 1 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0xccaa7): Init
    <94e>   DW_AT_decl_file   : 8
    <94f>   DW_AT_decl_line   : 215
    <950>   DW_AT_decl_column : 28
    <951>   DW_AT_type        : <0x85a>
    <955>   DW_AT_data_member_location: 4
 <2><956>: Abbrev Number: 1 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0xa0038): AdvancedInit
    <95b>   DW_AT_decl_file   : 8
    <95c>   DW_AT_decl_line   : 217
    <95d>   DW_AT_decl_column : 30
    <95e>   DW_AT_type        : <0x8f1>
    <962>   DW_AT_data_member_location: 36
 <2><963>: Abbrev Number: 1 (DW_TAG_member)
    <964>   DW_AT_name        : (indirect string, offset: 0x621e8): pTxBuffPtr
    <968>   DW_AT_decl_file   : 8
    <969>   DW_AT_decl_line   : 219
    <96a>   DW_AT_decl_column : 29
    <96b>   DW_AT_type        : <0xa46>
    <96f>   DW_AT_data_member_location: 76
 <2><970>: Abbrev Number: 1 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x56282): TxXferSize
    <975>   DW_AT_decl_file   : 8
    <976>   DW_AT_decl_line   : 221
    <977>   DW_AT_decl_column : 28
    <978>   DW_AT_type        : <0xac>
    <97c>   DW_AT_data_member_location: 80
 <2><97d>: Abbrev Number: 1 (DW_TAG_member)
    <97e>   DW_AT_name        : (indirect string, offset: 0x70499): TxXferCount
    <982>   DW_AT_decl_file   : 8
    <983>   DW_AT_decl_line   : 223
    <984>   DW_AT_decl_column : 28
    <985>   DW_AT_type        : <0xb8>
    <989>   DW_AT_data_member_location: 82
 <2><98a>: Abbrev Number: 1 (DW_TAG_member)
    <98b>   DW_AT_name        : (indirect string, offset: 0xbdce5): pRxBuffPtr
    <98f>   DW_AT_decl_file   : 8
    <990>   DW_AT_decl_line   : 225
    <991>   DW_AT_decl_column : 29
    <992>   DW_AT_type        : <0xe0>
    <996>   DW_AT_data_member_location: 84
 <2><997>: Abbrev Number: 1 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0x61a16): RxXferSize
    <99c>   DW_AT_decl_file   : 8
    <99d>   DW_AT_decl_line   : 227
    <99e>   DW_AT_decl_column : 28
    <99f>   DW_AT_type        : <0xac>
    <9a3>   DW_AT_data_member_location: 88
 <2><9a4>: Abbrev Number: 1 (DW_TAG_member)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x15386): RxXferCount
    <9a9>   DW_AT_decl_file   : 8
    <9aa>   DW_AT_decl_line   : 229
    <9ab>   DW_AT_decl_column : 28
    <9ac>   DW_AT_type        : <0xb8>
    <9b0>   DW_AT_data_member_location: 90
 <2><9b1>: Abbrev Number: 1 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0xd102c): Mask
    <9b6>   DW_AT_decl_file   : 8
    <9b7>   DW_AT_decl_line   : 231
    <9b8>   DW_AT_decl_column : 28
    <9b9>   DW_AT_type        : <0xac>
    <9bd>   DW_AT_data_member_location: 92
 <2><9be>: Abbrev Number: 1 (DW_TAG_member)
    <9bf>   DW_AT_name        : (indirect string, offset: 0xaad50): ReceptionType
    <9c3>   DW_AT_decl_file   : 8
    <9c4>   DW_AT_decl_line   : 233
    <9c5>   DW_AT_decl_column : 31
    <9c6>   DW_AT_type        : <0x91a>
    <9ca>   DW_AT_data_member_location: 96
 <2><9cb>: Abbrev Number: 1 (DW_TAG_member)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xd17cf): RxEventType
    <9d0>   DW_AT_decl_file   : 8
    <9d1>   DW_AT_decl_line   : 235
    <9d2>   DW_AT_decl_column : 36
    <9d3>   DW_AT_type        : <0x92b>
    <9d7>   DW_AT_data_member_location: 100
 <2><9d8>: Abbrev Number: 1 (DW_TAG_member)
    <9d9>   DW_AT_name        : (indirect string, offset: 0xb07cc): RxISR
    <9dd>   DW_AT_decl_file   : 8
    <9de>   DW_AT_decl_line   : 237
    <9df>   DW_AT_decl_column : 10
    <9e0>   DW_AT_type        : <0xa5b>
    <9e4>   DW_AT_data_member_location: 104
 <2><9e5>: Abbrev Number: 1 (DW_TAG_member)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x669dc): TxISR
    <9ea>   DW_AT_decl_file   : 8
    <9eb>   DW_AT_decl_line   : 239
    <9ec>   DW_AT_decl_column : 10
    <9ed>   DW_AT_type        : <0xa5b>
    <9f1>   DW_AT_data_member_location: 108
 <2><9f2>: Abbrev Number: 1 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xc6aad): hdmatx
    <9f7>   DW_AT_decl_file   : 8
    <9f8>   DW_AT_decl_line   : 241
    <9f9>   DW_AT_decl_column : 29
    <9fa>   DW_AT_type        : <0x5ce>
    <9fe>   DW_AT_data_member_location: 112
 <2><9ff>: Abbrev Number: 1 (DW_TAG_member)
    <a00>   DW_AT_name        : (indirect string, offset: 0xc5ec7): hdmarx
    <a04>   DW_AT_decl_file   : 8
    <a05>   DW_AT_decl_line   : 243
    <a06>   DW_AT_decl_column : 29
    <a07>   DW_AT_type        : <0x5ce>
    <a0b>   DW_AT_data_member_location: 116
 <2><a0c>: Abbrev Number: 1 (DW_TAG_member)
    <a0d>   DW_AT_name        : (indirect string, offset: 0x75c1b): Lock
    <a11>   DW_AT_decl_file   : 8
    <a12>   DW_AT_decl_line   : 245
    <a13>   DW_AT_decl_column : 29
    <a14>   DW_AT_type        : <0x44b>
    <a18>   DW_AT_data_member_location: 120
 <2><a19>: Abbrev Number: 1 (DW_TAG_member)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x5307c): gState
    <a1e>   DW_AT_decl_file   : 8
    <a1f>   DW_AT_decl_line   : 247
    <a20>   DW_AT_decl_column : 33
    <a21>   DW_AT_type        : <0x909>
    <a25>   DW_AT_data_member_location: 124
 <2><a26>: Abbrev Number: 1 (DW_TAG_member)
    <a27>   DW_AT_name        : (indirect string, offset: 0xb830f): RxState
    <a2b>   DW_AT_decl_file   : 8
    <a2c>   DW_AT_decl_line   : 251
    <a2d>   DW_AT_decl_column : 33
    <a2e>   DW_AT_type        : <0x909>
    <a32>   DW_AT_data_member_location: 128
 <2><a33>: Abbrev Number: 1 (DW_TAG_member)
    <a34>   DW_AT_name        : (indirect string, offset: 0xc7614): ErrorCode
    <a38>   DW_AT_decl_file   : 8
    <a39>   DW_AT_decl_line   : 254
    <a3a>   DW_AT_decl_column : 33
    <a3b>   DW_AT_type        : <0xc9>
    <a3f>   DW_AT_data_member_location: 132
 <2><a40>: Abbrev Number: 0
 <1><a41>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a42>   DW_AT_byte_size   : 4
    <a42>   DW_AT_type        : <0x423>
 <1><a46>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a47>   DW_AT_byte_size   : 4
    <a47>   DW_AT_type        : <0xa7>
 <1><a4b>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <a4c>   DW_AT_prototyped  : 1
    <a4c>   DW_AT_sibling     : <0xa56>
 <2><a50>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <a51>   DW_AT_type        : <0xa56>
 <2><a55>: Abbrev Number: 0
 <1><a56>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a57>   DW_AT_byte_size   : 4
    <a57>   DW_AT_type        : <0x930>
 <1><a5b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5c>   DW_AT_byte_size   : 4
    <a5c>   DW_AT_type        : <0xa4b>
 <1><a60>: Abbrev Number: 11 (DW_TAG_typedef)
    <a61>   DW_AT_name        : (indirect string, offset: 0x76b5e): UART_HandleTypeDef
    <a65>   DW_AT_decl_file   : 8
    <a66>   DW_AT_decl_line   : 272
    <a68>   DW_AT_decl_column : 3
    <a69>   DW_AT_type        : <0x930>
 <1><a6d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <a6e>   DW_AT_encoding    : 5	(signed)
    <a6f>   DW_AT_byte_size   : 4
    <a70>   DW_AT_type        : <0x2a>
    <a74>   DW_AT_decl_file   : 9
    <a75>   DW_AT_decl_line   : 82
    <a76>   DW_AT_decl_column : 14
    <a77>   DW_AT_sibling     : <0xbb9>
 <2><a7b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x3cebb): osPriorityNone
    <a80>   DW_AT_const_value : 0
 <2><a81>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0xb1c3b): osPriorityIdle
    <a86>   DW_AT_const_value : 1
 <2><a87>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0xbc596): osPriorityLow
    <a8c>   DW_AT_const_value : 8
 <2><a8d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xa38cf): osPriorityLow1
    <a92>   DW_AT_const_value : 9
 <2><a93>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0xc1cc0): osPriorityLow2
    <a98>   DW_AT_const_value : 10
 <2><a99>: Abbrev Number: 2 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0xc1ccf): osPriorityLow3
    <a9e>   DW_AT_const_value : 11
 <2><a9f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0xc1cde): osPriorityLow4
    <aa4>   DW_AT_const_value : 12
 <2><aa5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0xc1ced): osPriorityLow5
    <aaa>   DW_AT_const_value : 13
 <2><aab>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0xc1cfc): osPriorityLow6
    <ab0>   DW_AT_const_value : 14
 <2><ab1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0xc1d0b): osPriorityLow7
    <ab6>   DW_AT_const_value : 15
 <2><ab7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xc4488): osPriorityBelowNormal
    <abc>   DW_AT_const_value : 16
 <2><abd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x7aafb): osPriorityBelowNormal1
    <ac2>   DW_AT_const_value : 17
 <2><ac3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ac4>   DW_AT_name        : (indirect string, offset: 0xaddef): osPriorityBelowNormal2
    <ac8>   DW_AT_const_value : 18
 <2><ac9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aca>   DW_AT_name        : (indirect string, offset: 0x8bbfa): osPriorityBelowNormal3
    <ace>   DW_AT_const_value : 19
 <2><acf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ad0>   DW_AT_name        : (indirect string, offset: 0xade24): osPriorityBelowNormal4
    <ad4>   DW_AT_const_value : 20
 <2><ad5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ad6>   DW_AT_name        : (indirect string, offset: 0xade3b): osPriorityBelowNormal5
    <ada>   DW_AT_const_value : 21
 <2><adb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0xade52): osPriorityBelowNormal6
    <ae0>   DW_AT_const_value : 22
 <2><ae1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x9d027): osPriorityBelowNormal7
    <ae6>   DW_AT_const_value : 23
 <2><ae7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0xa687e): osPriorityNormal
    <aec>   DW_AT_const_value : 24
 <2><aed>: Abbrev Number: 2 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x2086d): osPriorityNormal1
    <af2>   DW_AT_const_value : 25
 <2><af3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <af4>   DW_AT_name        : (indirect string, offset: 0x2087f): osPriorityNormal2
    <af8>   DW_AT_const_value : 26
 <2><af9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <afa>   DW_AT_name        : (indirect string, offset: 0x20891): osPriorityNormal3
    <afe>   DW_AT_const_value : 27
 <2><aff>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b00>   DW_AT_name        : (indirect string, offset: 0x208a3): osPriorityNormal4
    <b04>   DW_AT_const_value : 28
 <2><b05>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b06>   DW_AT_name        : (indirect string, offset: 0x208b5): osPriorityNormal5
    <b0a>   DW_AT_const_value : 29
 <2><b0b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x208c7): osPriorityNormal6
    <b10>   DW_AT_const_value : 30
 <2><b11>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b12>   DW_AT_name        : (indirect string, offset: 0x208d9): osPriorityNormal7
    <b16>   DW_AT_const_value : 31
 <2><b17>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b18>   DW_AT_name        : (indirect string, offset: 0x327fc): osPriorityAboveNormal
    <b1c>   DW_AT_const_value : 32
 <2><b1d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b1e>   DW_AT_name        : (indirect string, offset: 0xcb59b): osPriorityAboveNormal1
    <b22>   DW_AT_const_value : 33
 <2><b23>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b24>   DW_AT_name        : (indirect string, offset: 0xa8cb4): osPriorityAboveNormal2
    <b28>   DW_AT_const_value : 34
 <2><b29>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b2a>   DW_AT_name        : (indirect string, offset: 0xcb5d2): osPriorityAboveNormal3
    <b2e>   DW_AT_const_value : 35
 <2><b2f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b30>   DW_AT_name        : (indirect string, offset: 0xcb5e9): osPriorityAboveNormal4
    <b34>   DW_AT_const_value : 36
 <2><b35>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b36>   DW_AT_name        : (indirect string, offset: 0xc05f5): osPriorityAboveNormal5
    <b3a>   DW_AT_const_value : 37
 <2><b3b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xc0646): osPriorityAboveNormal6
    <b40>   DW_AT_const_value : 38
 <2><b41>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b42>   DW_AT_name        : (indirect string, offset: 0xcb640): osPriorityAboveNormal7
    <b46>   DW_AT_const_value : 39
 <2><b47>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b48>   DW_AT_name        : (indirect string, offset: 0x5796): osPriorityHigh
    <b4c>   DW_AT_const_value : 40
 <2><b4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x87a21): osPriorityHigh1
    <b52>   DW_AT_const_value : 41
 <2><b53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b54>   DW_AT_name        : (indirect string, offset: 0x87a31): osPriorityHigh2
    <b58>   DW_AT_const_value : 42
 <2><b59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x87a41): osPriorityHigh3
    <b5e>   DW_AT_const_value : 43
 <2><b5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b60>   DW_AT_name        : (indirect string, offset: 0x87a51): osPriorityHigh4
    <b64>   DW_AT_const_value : 44
 <2><b65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b66>   DW_AT_name        : (indirect string, offset: 0x3ec0): osPriorityHigh5
    <b6a>   DW_AT_const_value : 45
 <2><b6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x87a8d): osPriorityHigh6
    <b70>   DW_AT_const_value : 46
 <2><b71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b72>   DW_AT_name        : (indirect string, offset: 0x87a9d): osPriorityHigh7
    <b76>   DW_AT_const_value : 47
 <2><b77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b78>   DW_AT_name        : (indirect string, offset: 0x9e5fc): osPriorityRealtime
    <b7c>   DW_AT_const_value : 48
 <2><b7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x80405): osPriorityRealtime1
    <b82>   DW_AT_const_value : 49
 <2><b83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0x80419): osPriorityRealtime2
    <b88>   DW_AT_const_value : 50
 <2><b89>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8042d): osPriorityRealtime3
    <b8e>   DW_AT_const_value : 51
 <2><b8f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0x80441): osPriorityRealtime4
    <b94>   DW_AT_const_value : 52
 <2><b95>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b96>   DW_AT_name        : (indirect string, offset: 0x80455): osPriorityRealtime5
    <b9a>   DW_AT_const_value : 53
 <2><b9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x34cff): osPriorityRealtime6
    <ba0>   DW_AT_const_value : 54
 <2><ba1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x8047f): osPriorityRealtime7
    <ba6>   DW_AT_const_value : 55
 <2><ba7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x5bcc9): osPriorityISR
    <bac>   DW_AT_const_value : 56
 <2><bad>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0xb4cad): osPriorityError
    <bb2>   DW_AT_const_value : -1
 <2><bb3>: Abbrev Number: 25 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xc2355): osPriorityReserved
    <bb8>   DW_AT_const_value : 2147483647
 <2><bb8>: Abbrev Number: 0
 <1><bb9>: Abbrev Number: 4 (DW_TAG_typedef)
    <bba>   DW_AT_name        : (indirect string, offset: 0x43d62): osPriority_t
    <bbe>   DW_AT_decl_file   : 9
    <bbf>   DW_AT_decl_line   : 136
    <bc0>   DW_AT_decl_column : 3
    <bc1>   DW_AT_type        : <0xa6d>
 <1><bc5>: Abbrev Number: 4 (DW_TAG_typedef)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x6f0fb): osThreadFunc_t
    <bca>   DW_AT_decl_file   : 9
    <bcb>   DW_AT_decl_line   : 139
    <bcc>   DW_AT_decl_column : 16
    <bcd>   DW_AT_type        : <0xce>
 <1><bd1>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <bd2>   DW_AT_encoding    : 5	(signed)
    <bd3>   DW_AT_byte_size   : 4
    <bd4>   DW_AT_type        : <0x2a>
    <bd8>   DW_AT_decl_file   : 9
    <bd9>   DW_AT_decl_line   : 176
    <bda>   DW_AT_decl_column : 14
    <bdb>   DW_AT_sibling     : <0xc0f>
 <2><bdf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <be0>   DW_AT_name        : (indirect string, offset: 0xb49b6): osOK
    <be4>   DW_AT_const_value : 0
 <2><be5>: Abbrev Number: 14 (DW_TAG_enumerator)
    <be6>   DW_AT_name        : (indirect string, offset: 0x5e849): osError
    <bea>   DW_AT_const_value : -1
 <2><beb>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bec>   DW_AT_name        : (indirect string, offset: 0xb866c): osErrorTimeout
    <bf0>   DW_AT_const_value : -2
 <2><bf1>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x85b95): osErrorResource
    <bf6>   DW_AT_const_value : -3
 <2><bf7>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bf8>   DW_AT_name        : (indirect string, offset: 0x358ac): osErrorParameter
    <bfc>   DW_AT_const_value : -4
 <2><bfd>: Abbrev Number: 14 (DW_TAG_enumerator)
    <bfe>   DW_AT_name        : (indirect string, offset: 0x2335f): osErrorNoMemory
    <c02>   DW_AT_const_value : -5
 <2><c03>: Abbrev Number: 14 (DW_TAG_enumerator)
    <c04>   DW_AT_name        : (indirect string, offset: 0x37824): osErrorISR
    <c08>   DW_AT_const_value : -6
 <2><c09>: Abbrev Number: 25 (DW_TAG_enumerator)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x674bf): osStatusReserved
    <c0e>   DW_AT_const_value : 2147483647
 <2><c0e>: Abbrev Number: 0
 <1><c0f>: Abbrev Number: 4 (DW_TAG_typedef)
    <c10>   DW_AT_name        : (indirect string, offset: 0x45795): osStatus_t
    <c14>   DW_AT_decl_file   : 9
    <c15>   DW_AT_decl_line   : 185
    <c16>   DW_AT_decl_column : 3
    <c17>   DW_AT_type        : <0xbd1>
 <1><c1b>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1c>   DW_AT_name        : (indirect string, offset: 0x49453): osThreadId_t
    <c20>   DW_AT_decl_file   : 9
    <c21>   DW_AT_decl_line   : 189
    <c22>   DW_AT_decl_column : 15
    <c23>   DW_AT_type        : <0xde>
 <1><c27>: Abbrev Number: 4 (DW_TAG_typedef)
    <c28>   DW_AT_name        : (indirect string, offset: 0x8972d): TZ_ModuleId_t
    <c2c>   DW_AT_decl_file   : 9
    <c2d>   DW_AT_decl_line   : 213
    <c2e>   DW_AT_decl_column : 18
    <c2f>   DW_AT_type        : <0xbd>
 <1><c33>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c34>   DW_AT_byte_size   : 36
    <c35>   DW_AT_decl_file   : 9
    <c36>   DW_AT_decl_line   : 218
    <c37>   DW_AT_decl_column : 9
    <c37>   DW_AT_sibling     : <0xcb1>
 <2><c3b>: Abbrev Number: 1 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x17592): name
    <c40>   DW_AT_decl_file   : 9
    <c41>   DW_AT_decl_line   : 219
    <c42>   DW_AT_decl_column : 33
    <c43>   DW_AT_type        : <0xf1>
    <c47>   DW_AT_data_member_location: 0
 <2><c48>: Abbrev Number: 1 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x859ad): attr_bits
    <c4d>   DW_AT_decl_file   : 9
    <c4e>   DW_AT_decl_line   : 220
    <c4f>   DW_AT_decl_column : 28
    <c50>   DW_AT_type        : <0xbd>
    <c54>   DW_AT_data_member_location: 4
 <2><c55>: Abbrev Number: 1 (DW_TAG_member)
    <c56>   DW_AT_name        : (indirect string, offset: 0x7d81e): cb_mem
    <c5a>   DW_AT_decl_file   : 9
    <c5b>   DW_AT_decl_line   : 221
    <c5c>   DW_AT_decl_column : 30
    <c5d>   DW_AT_type        : <0xde>
    <c61>   DW_AT_data_member_location: 8
 <2><c62>: Abbrev Number: 1 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0x37e20): cb_size
    <c67>   DW_AT_decl_file   : 9
    <c68>   DW_AT_decl_line   : 222
    <c69>   DW_AT_decl_column : 30
    <c6a>   DW_AT_type        : <0xbd>
    <c6e>   DW_AT_data_member_location: 12
 <2><c6f>: Abbrev Number: 1 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0xb9a51): stack_mem
    <c74>   DW_AT_decl_file   : 9
    <c75>   DW_AT_decl_line   : 223
    <c76>   DW_AT_decl_column : 27
    <c77>   DW_AT_type        : <0xde>
    <c7b>   DW_AT_data_member_location: 16
 <2><c7c>: Abbrev Number: 1 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x804c9): stack_size
    <c81>   DW_AT_decl_file   : 9
    <c82>   DW_AT_decl_line   : 224
    <c83>   DW_AT_decl_column : 27
    <c84>   DW_AT_type        : <0xbd>
    <c88>   DW_AT_data_member_location: 20
 <2><c89>: Abbrev Number: 1 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x51051): priority
    <c8e>   DW_AT_decl_file   : 9
    <c8f>   DW_AT_decl_line   : 225
    <c90>   DW_AT_decl_column : 29
    <c91>   DW_AT_type        : <0xbb9>
    <c95>   DW_AT_data_member_location: 24
 <2><c96>: Abbrev Number: 1 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x575bc): tz_module
    <c9b>   DW_AT_decl_file   : 9
    <c9c>   DW_AT_decl_line   : 226
    <c9d>   DW_AT_decl_column : 28
    <c9e>   DW_AT_type        : <0xc27>
    <ca2>   DW_AT_data_member_location: 28
 <2><ca3>: Abbrev Number: 1 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x5814e): reserved
    <ca8>   DW_AT_decl_file   : 9
    <ca9>   DW_AT_decl_line   : 227
    <caa>   DW_AT_decl_column : 29
    <cab>   DW_AT_type        : <0xbd>
    <caf>   DW_AT_data_member_location: 32
 <2><cb0>: Abbrev Number: 0
 <1><cb1>: Abbrev Number: 4 (DW_TAG_typedef)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x207a0): osThreadAttr_t
    <cb6>   DW_AT_decl_file   : 9
    <cb7>   DW_AT_decl_line   : 228
    <cb8>   DW_AT_decl_column : 3
    <cb9>   DW_AT_type        : <0xc33>
 <1><cbd>: Abbrev Number: 21 (DW_TAG_const_type)
    <cbe>   DW_AT_type        : <0xcb1>
 <1><cc2>: Abbrev Number: 13 (DW_TAG_variable)
    <cc3>   DW_AT_name        : (indirect string, offset: 0xb643b): htim1
    <cc7>   DW_AT_decl_file   : 10
    <cc8>   DW_AT_decl_line   : 35
    <cc9>   DW_AT_decl_column : 26
    <cca>   DW_AT_type        : <0x7dc>
    <cce>   DW_AT_external    : 1
    <cce>   DW_AT_declaration : 1
 <1><cce>: Abbrev Number: 13 (DW_TAG_variable)
    <ccf>   DW_AT_name        : (indirect string, offset: 0xb6459): htim2
    <cd3>   DW_AT_decl_file   : 10
    <cd4>   DW_AT_decl_line   : 37
    <cd5>   DW_AT_decl_column : 26
    <cd6>   DW_AT_type        : <0x7dc>
    <cda>   DW_AT_external    : 1
    <cda>   DW_AT_declaration : 1
 <1><cda>: Abbrev Number: 13 (DW_TAG_variable)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x7c644): htim3
    <cdf>   DW_AT_decl_file   : 10
    <ce0>   DW_AT_decl_line   : 39
    <ce1>   DW_AT_decl_column : 26
    <ce2>   DW_AT_type        : <0x7dc>
    <ce6>   DW_AT_external    : 1
    <ce6>   DW_AT_declaration : 1
 <1><ce6>: Abbrev Number: 13 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x7c64a): htim4
    <ceb>   DW_AT_decl_file   : 10
    <cec>   DW_AT_decl_line   : 41
    <ced>   DW_AT_decl_column : 26
    <cee>   DW_AT_type        : <0x7dc>
    <cf2>   DW_AT_external    : 1
    <cf2>   DW_AT_declaration : 1
 <1><cf2>: Abbrev Number: 13 (DW_TAG_variable)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x7c6eb): htim8
    <cf7>   DW_AT_decl_file   : 10
    <cf8>   DW_AT_decl_line   : 43
    <cf9>   DW_AT_decl_column : 26
    <cfa>   DW_AT_type        : <0x7dc>
    <cfe>   DW_AT_external    : 1
    <cfe>   DW_AT_declaration : 1
 <1><cfe>: Abbrev Number: 13 (DW_TAG_variable)
    <cff>   DW_AT_name        : (indirect string, offset: 0xb16a3): htim15
    <d03>   DW_AT_decl_file   : 10
    <d04>   DW_AT_decl_line   : 45
    <d05>   DW_AT_decl_column : 26
    <d06>   DW_AT_type        : <0x7dc>
    <d0a>   DW_AT_external    : 1
    <d0a>   DW_AT_declaration : 1
 <1><d0a>: Abbrev Number: 13 (DW_TAG_variable)
    <d0b>   DW_AT_name        : (indirect string, offset: 0xb16aa): htim16
    <d0f>   DW_AT_decl_file   : 10
    <d10>   DW_AT_decl_line   : 47
    <d11>   DW_AT_decl_column : 26
    <d12>   DW_AT_type        : <0x7dc>
    <d16>   DW_AT_external    : 1
    <d16>   DW_AT_declaration : 1
 <1><d16>: Abbrev Number: 13 (DW_TAG_variable)
    <d17>   DW_AT_name        : (indirect string, offset: 0x6e276): huart4
    <d1b>   DW_AT_decl_file   : 11
    <d1c>   DW_AT_decl_line   : 35
    <d1d>   DW_AT_decl_column : 27
    <d1e>   DW_AT_type        : <0xa60>
    <d22>   DW_AT_external    : 1
    <d22>   DW_AT_declaration : 1
 <1><d22>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <d23>   DW_AT_encoding    : 7	(unsigned)
    <d24>   DW_AT_byte_size   : 1
    <d25>   DW_AT_type        : <0x59>
    <d29>   DW_AT_decl_file   : 12
    <d2a>   DW_AT_decl_line   : 14
    <d2b>   DW_AT_decl_column : 1
    <d2c>   DW_AT_sibling     : <0xd49>
 <2><d30>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d31>   DW_AT_name        : (indirect string, offset: 0x40cdb): ECU_OK
    <d35>   DW_AT_const_value : 0
 <2><d36>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d37>   DW_AT_name        : (indirect string, offset: 0xa7c7): ECU_ERROR
    <d3b>   DW_AT_const_value : 1
 <2><d3c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d3d>   DW_AT_name        : (indirect string, offset: 0xcbf4b): ECU_BUSY
    <d41>   DW_AT_const_value : 2
 <2><d42>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d43>   DW_AT_name        : (indirect string, offset: 0x7b70a): ECU_TIMEOUT
    <d47>   DW_AT_const_value : 3
 <2><d48>: Abbrev Number: 0
 <1><d49>: Abbrev Number: 4 (DW_TAG_typedef)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x2000): ECU_StatusTypeDef
    <d4e>   DW_AT_decl_file   : 12
    <d4f>   DW_AT_decl_line   : 19
    <d50>   DW_AT_decl_column : 3
    <d51>   DW_AT_type        : <0xd22>
 <1><d55>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d56>   DW_AT_byte_size   : 8
    <d57>   DW_AT_decl_file   : 13
    <d58>   DW_AT_decl_line   : 41
    <d59>   DW_AT_decl_column : 9
    <d59>   DW_AT_sibling     : <0xd78>
 <2><d5d>: Abbrev Number: 1 (DW_TAG_member)
    <d5e>   DW_AT_name        : (indirect string, offset: 0x36bd8): Frequency
    <d62>   DW_AT_decl_file   : 13
    <d63>   DW_AT_decl_line   : 42
    <d64>   DW_AT_decl_column : 11
    <d65>   DW_AT_type        : <0xbd>
    <d69>   DW_AT_data_member_location: 0
 <2><d6a>: Abbrev Number: 1 (DW_TAG_member)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x17654): Duty_Cycle
    <d6f>   DW_AT_decl_file   : 13
    <d70>   DW_AT_decl_line   : 43
    <d71>   DW_AT_decl_column : 8
    <d72>   DW_AT_type        : <0xd78>
    <d76>   DW_AT_data_member_location: 4
 <2><d77>: Abbrev Number: 0
 <1><d78>: Abbrev Number: 9 (DW_TAG_base_type)
    <d79>   DW_AT_byte_size   : 4
    <d7a>   DW_AT_encoding    : 4	(float)
    <d7b>   DW_AT_name        : (indirect string, offset: 0xaff8a): float
 <1><d7f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d80>   DW_AT_name        : (indirect string, offset: 0x4098b): motor_speed_t
    <d84>   DW_AT_decl_file   : 13
    <d85>   DW_AT_decl_line   : 44
    <d86>   DW_AT_decl_column : 2
    <d87>   DW_AT_type        : <0xd55>
 <1><d8b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d8c>   DW_AT_byte_size   : 16
    <d8d>   DW_AT_decl_file   : 13
    <d8e>   DW_AT_decl_line   : 46
    <d8f>   DW_AT_decl_column : 9
    <d8f>   DW_AT_sibling     : <0xdbb>
 <2><d93>: Abbrev Number: 1 (DW_TAG_member)
    <d94>   DW_AT_name        : (indirect string, offset: 0xa0bb4): htim
    <d98>   DW_AT_decl_file   : 13
    <d99>   DW_AT_decl_line   : 47
    <d9a>   DW_AT_decl_column : 21
    <d9b>   DW_AT_type        : <0xdbb>
    <d9f>   DW_AT_data_member_location: 0
 <2><da0>: Abbrev Number: 1 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0xb2c3b): PWM_Channel
    <da5>   DW_AT_decl_file   : 13
    <da6>   DW_AT_decl_line   : 48
    <da7>   DW_AT_decl_column : 11
    <da8>   DW_AT_type        : <0xbd>
    <dac>   DW_AT_data_member_location: 4
 <2><dad>: Abbrev Number: 1 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0x84f19): speed
    <db2>   DW_AT_decl_file   : 13
    <db3>   DW_AT_decl_line   : 49
    <db4>   DW_AT_decl_column : 16
    <db5>   DW_AT_type        : <0xd7f>
    <db9>   DW_AT_data_member_location: 8
 <2><dba>: Abbrev Number: 0
 <1><dbb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbc>   DW_AT_byte_size   : 4
    <dbc>   DW_AT_type        : <0x7dc>
 <1><dc0>: Abbrev Number: 4 (DW_TAG_typedef)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x967bc): motor_obj_t
    <dc5>   DW_AT_decl_file   : 13
    <dc6>   DW_AT_decl_line   : 50
    <dc7>   DW_AT_decl_column : 2
    <dc8>   DW_AT_type        : <0xd8b>
 <1><dcc>: Abbrev Number: 12 (DW_TAG_structure_type)
    <dcd>   DW_AT_byte_size   : 8
    <dce>   DW_AT_decl_file   : 14
    <dcf>   DW_AT_decl_line   : 46
    <dd0>   DW_AT_decl_column : 9
    <dd0>   DW_AT_sibling     : <0xdef>
 <2><dd4>: Abbrev Number: 1 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x7896b): port
    <dd9>   DW_AT_decl_file   : 14
    <dda>   DW_AT_decl_line   : 47
    <ddb>   DW_AT_decl_column : 16
    <ddc>   DW_AT_type        : <0xdef>
    <de0>   DW_AT_data_member_location: 0
 <2><de1>: Abbrev Number: 31 (DW_TAG_member)
    <de2>   DW_AT_name        : pin
    <de6>   DW_AT_decl_file   : 14
    <de7>   DW_AT_decl_line   : 48
    <de8>   DW_AT_decl_column : 11
    <de9>   DW_AT_type        : <0xac>
    <ded>   DW_AT_data_member_location: 4
 <2><dee>: Abbrev Number: 0
 <1><def>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <df0>   DW_AT_byte_size   : 4
    <df0>   DW_AT_type        : <0x217>
 <1><df4>: Abbrev Number: 4 (DW_TAG_typedef)
    <df5>   DW_AT_name        : (indirect string, offset: 0x3f6e6): pin_cfg_t
    <df9>   DW_AT_decl_file   : 14
    <dfa>   DW_AT_decl_line   : 49
    <dfb>   DW_AT_decl_column : 2
    <dfc>   DW_AT_type        : <0xdcc>
 <1><e00>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e01>   DW_AT_byte_size   : 48
    <e02>   DW_AT_decl_file   : 14
    <e03>   DW_AT_decl_line   : 51
    <e04>   DW_AT_decl_column : 9
    <e04>   DW_AT_sibling     : <0xe30>
 <2><e08>: Abbrev Number: 1 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0x639fd): lcd_rs
    <e0d>   DW_AT_decl_file   : 14
    <e0e>   DW_AT_decl_line   : 52
    <e0f>   DW_AT_decl_column : 12
    <e10>   DW_AT_type        : <0xdf4>
    <e14>   DW_AT_data_member_location: 0
 <2><e15>: Abbrev Number: 1 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x5db11): lcd_en
    <e1a>   DW_AT_decl_file   : 14
    <e1b>   DW_AT_decl_line   : 53
    <e1c>   DW_AT_decl_column : 12
    <e1d>   DW_AT_type        : <0xdf4>
    <e21>   DW_AT_data_member_location: 8
 <2><e22>: Abbrev Number: 1 (DW_TAG_member)
    <e23>   DW_AT_name        : (indirect string, offset: 0x2b655): lcd_data
    <e27>   DW_AT_decl_file   : 14
    <e28>   DW_AT_decl_line   : 54
    <e29>   DW_AT_decl_column : 12
    <e2a>   DW_AT_type        : <0xe30>
    <e2e>   DW_AT_data_member_location: 16
 <2><e2f>: Abbrev Number: 0
 <1><e30>: Abbrev Number: 16 (DW_TAG_array_type)
    <e31>   DW_AT_type        : <0xdf4>
    <e35>   DW_AT_sibling     : <0xe40>
 <2><e39>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <e3a>   DW_AT_type        : <0x31>
    <e3e>   DW_AT_upper_bound : 3
 <2><e3f>: Abbrev Number: 0
 <1><e40>: Abbrev Number: 4 (DW_TAG_typedef)
    <e41>   DW_AT_name        : (indirect string, offset: 0x9d953): chr_lcd_4bit_t
    <e45>   DW_AT_decl_file   : 14
    <e46>   DW_AT_decl_line   : 55
    <e47>   DW_AT_decl_column : 2
    <e48>   DW_AT_type        : <0xe00>
 <1><e4c>: Abbrev Number: 16 (DW_TAG_array_type)
    <e4d>   DW_AT_type        : <0xc9>
    <e51>   DW_AT_sibling     : <0xe5c>
 <2><e55>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <e56>   DW_AT_type        : <0x31>
    <e5a>   DW_AT_upper_bound : 5
 <2><e5b>: Abbrev Number: 0
 <1><e5c>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <e5d>   DW_AT_type        : <0xe4c>
 <1><e61>: Abbrev Number: 13 (DW_TAG_variable)
    <e62>   DW_AT_name        : (indirect string, offset: 0x5e384): ultrasonic_Distance_Values
    <e66>   DW_AT_decl_file   : 15
    <e67>   DW_AT_decl_line   : 24
    <e68>   DW_AT_decl_column : 26
    <e69>   DW_AT_type        : <0xe5c>
    <e6d>   DW_AT_external    : 1
    <e6d>   DW_AT_declaration : 1
 <1><e6d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <e6e>   DW_AT_byte_size   : 12
    <e6f>   DW_AT_decl_file   : 15
    <e70>   DW_AT_decl_line   : 29
    <e71>   DW_AT_decl_column : 9
    <e71>   DW_AT_sibling     : <0xe9d>
 <2><e75>: Abbrev Number: 1 (DW_TAG_member)
    <e76>   DW_AT_name        : (indirect string, offset: 0xa0bb4): htim
    <e7a>   DW_AT_decl_file   : 15
    <e7b>   DW_AT_decl_line   : 30
    <e7c>   DW_AT_decl_column : 21
    <e7d>   DW_AT_type        : <0xdbb>
    <e81>   DW_AT_data_member_location: 0
 <2><e82>: Abbrev Number: 1 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0xb2c3b): PWM_Channel
    <e87>   DW_AT_decl_file   : 15
    <e88>   DW_AT_decl_line   : 31
    <e89>   DW_AT_decl_column : 11
    <e8a>   DW_AT_type        : <0xbd>
    <e8e>   DW_AT_data_member_location: 4
 <2><e8f>: Abbrev Number: 1 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0x42078): IC_Channel
    <e94>   DW_AT_decl_file   : 15
    <e95>   DW_AT_decl_line   : 32
    <e96>   DW_AT_decl_column : 11
    <e97>   DW_AT_type        : <0xbd>
    <e9b>   DW_AT_data_member_location: 8
 <2><e9c>: Abbrev Number: 0
 <1><e9d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x38e58): ultrasonic_obj_t
    <ea2>   DW_AT_decl_file   : 15
    <ea3>   DW_AT_decl_line   : 34
    <ea4>   DW_AT_decl_column : 2
    <ea5>   DW_AT_type        : <0xe6d>
 <1><ea9>: Abbrev Number: 13 (DW_TAG_variable)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x72ae9): Bluetooth_RX_Data
    <eae>   DW_AT_decl_file   : 16
    <eaf>   DW_AT_decl_line   : 22
    <eb0>   DW_AT_decl_column : 16
    <eb1>   DW_AT_type        : <0x9b>
    <eb5>   DW_AT_external    : 1
    <eb5>   DW_AT_declaration : 1
 <1><eb5>: Abbrev Number: 12 (DW_TAG_structure_type)
    <eb6>   DW_AT_byte_size   : 8
    <eb7>   DW_AT_decl_file   : 16
    <eb8>   DW_AT_decl_line   : 24
    <eb9>   DW_AT_decl_column : 9
    <eb9>   DW_AT_sibling     : <0xed8>
 <2><ebd>: Abbrev Number: 1 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x91109): huart
    <ec2>   DW_AT_decl_file   : 16
    <ec3>   DW_AT_decl_line   : 25
    <ec4>   DW_AT_decl_column : 22
    <ec5>   DW_AT_type        : <0xed8>
    <ec9>   DW_AT_data_member_location: 0
 <2><eca>: Abbrev Number: 1 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x668b5): Numberofdata
    <ecf>   DW_AT_decl_file   : 16
    <ed0>   DW_AT_decl_line   : 26
    <ed1>   DW_AT_decl_column : 10
    <ed2>   DW_AT_type        : <0x9b>
    <ed6>   DW_AT_data_member_location: 4
 <2><ed7>: Abbrev Number: 0
 <1><ed8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ed9>   DW_AT_byte_size   : 4
    <ed9>   DW_AT_type        : <0xa60>
 <1><edd>: Abbrev Number: 4 (DW_TAG_typedef)
    <ede>   DW_AT_name        : (indirect string, offset: 0x78b02): bluetooth_obj_t
    <ee2>   DW_AT_decl_file   : 16
    <ee3>   DW_AT_decl_line   : 27
    <ee4>   DW_AT_decl_column : 2
    <ee5>   DW_AT_type        : <0xeb5>
 <1><ee9>: Abbrev Number: 32 (DW_TAG_variable)
    <eea>   DW_AT_name        : lcd
    <eee>   DW_AT_decl_file   : 1
    <eef>   DW_AT_decl_line   : 57
    <ef0>   DW_AT_decl_column : 16
    <ef1>   DW_AT_type        : <0xe40>
    <ef5>   DW_AT_external    : 1
    <ef5>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><efb>: Abbrev Number: 8 (DW_TAG_variable)
    <efc>   DW_AT_name        : (indirect string, offset: 0xf9f6): Front_ultrasonic
    <f00>   DW_AT_decl_file   : 1
    <f00>   DW_AT_decl_line   : 77
    <f01>   DW_AT_decl_column : 18
    <f02>   DW_AT_type        : <0xe9d>
    <f06>   DW_AT_external    : 1
    <f06>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><f0c>: Abbrev Number: 8 (DW_TAG_variable)
    <f0d>   DW_AT_name        : (indirect string, offset: 0xc661b): RightFront_ultrasonic
    <f11>   DW_AT_decl_file   : 1
    <f11>   DW_AT_decl_line   : 83
    <f12>   DW_AT_decl_column : 18
    <f13>   DW_AT_type        : <0xe9d>
    <f17>   DW_AT_external    : 1
    <f17>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><f1d>: Abbrev Number: 8 (DW_TAG_variable)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xb09f6): RightRear_ultrasonic
    <f22>   DW_AT_decl_file   : 1
    <f22>   DW_AT_decl_line   : 89
    <f23>   DW_AT_decl_column : 18
    <f24>   DW_AT_type        : <0xe9d>
    <f28>   DW_AT_external    : 1
    <f28>   DW_AT_location    : 5 byte block: 3 18 0 0 20 	(DW_OP_addr: 20000018)
 <1><f2e>: Abbrev Number: 8 (DW_TAG_variable)
    <f2f>   DW_AT_name        : (indirect string, offset: 0xf9f2): LeftFront_ultrasonic
    <f33>   DW_AT_decl_file   : 1
    <f33>   DW_AT_decl_line   : 95
    <f34>   DW_AT_decl_column : 18
    <f35>   DW_AT_type        : <0xe9d>
    <f39>   DW_AT_external    : 1
    <f39>   DW_AT_location    : 5 byte block: 3 24 0 0 20 	(DW_OP_addr: 20000024)
 <1><f3f>: Abbrev Number: 8 (DW_TAG_variable)
    <f40>   DW_AT_name        : (indirect string, offset: 0x3e323): LeftRear_ultrasonic
    <f44>   DW_AT_decl_file   : 1
    <f44>   DW_AT_decl_line   : 101
    <f45>   DW_AT_decl_column : 18
    <f46>   DW_AT_type        : <0xe9d>
    <f4a>   DW_AT_external    : 1
    <f4a>   DW_AT_location    : 5 byte block: 3 30 0 0 20 	(DW_OP_addr: 20000030)
 <1><f50>: Abbrev Number: 8 (DW_TAG_variable)
    <f51>   DW_AT_name        : (indirect string, offset: 0x3e327): Rear_ultrasonic
    <f55>   DW_AT_decl_file   : 1
    <f55>   DW_AT_decl_line   : 107
    <f56>   DW_AT_decl_column : 18
    <f57>   DW_AT_type        : <0xe9d>
    <f5b>   DW_AT_external    : 1
    <f5b>   DW_AT_location    : 5 byte block: 3 3c 0 0 20 	(DW_OP_addr: 2000003c)
 <1><f61>: Abbrev Number: 8 (DW_TAG_variable)
    <f62>   DW_AT_name        : (indirect string, offset: 0xa014d): moving_motor
    <f66>   DW_AT_decl_file   : 1
    <f66>   DW_AT_decl_line   : 120
    <f67>   DW_AT_decl_column : 13
    <f68>   DW_AT_type        : <0xdc0>
    <f6c>   DW_AT_external    : 1
    <f6c>   DW_AT_location    : 5 byte block: 3 48 0 0 20 	(DW_OP_addr: 20000048)
 <1><f72>: Abbrev Number: 8 (DW_TAG_variable)
    <f73>   DW_AT_name        : (indirect string, offset: 0x2caea): bluetooth
    <f77>   DW_AT_decl_file   : 1
    <f77>   DW_AT_decl_line   : 127
    <f78>   DW_AT_decl_column : 17
    <f79>   DW_AT_type        : <0xedd>
    <f7d>   DW_AT_external    : 1
    <f7d>   DW_AT_location    : 5 byte block: 3 58 0 0 20 	(DW_OP_addr: 20000058)
 <1><f83>: Abbrev Number: 8 (DW_TAG_variable)
    <f84>   DW_AT_name        : (indirect string, offset: 0x514e9): defaultTaskHandle
    <f88>   DW_AT_decl_file   : 1
    <f88>   DW_AT_decl_line   : 139
    <f89>   DW_AT_decl_column : 14
    <f8a>   DW_AT_type        : <0xc1b>
    <f8e>   DW_AT_external    : 1
    <f8e>   DW_AT_location    : 5 byte block: 3 ec 0 0 20 	(DW_OP_addr: 200000ec)
 <1><f94>: Abbrev Number: 8 (DW_TAG_variable)
    <f95>   DW_AT_name        : (indirect string, offset: 0x6e21e): defaultTask_attributes
    <f99>   DW_AT_decl_file   : 1
    <f99>   DW_AT_decl_line   : 140
    <f9a>   DW_AT_decl_column : 22
    <f9b>   DW_AT_type        : <0xcbd>
    <f9f>   DW_AT_external    : 1
    <f9f>   DW_AT_location    : 5 byte block: 3 28 b7 0 8 	(DW_OP_addr: 800b728)
 <1><fa5>: Abbrev Number: 8 (DW_TAG_variable)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x722b9): ultrasonics_readHandle
    <faa>   DW_AT_decl_file   : 1
    <faa>   DW_AT_decl_line   : 146
    <fab>   DW_AT_decl_column : 14
    <fac>   DW_AT_type        : <0xc1b>
    <fb0>   DW_AT_external    : 1
    <fb0>   DW_AT_location    : 5 byte block: 3 f0 0 0 20 	(DW_OP_addr: 200000f0)
 <1><fb6>: Abbrev Number: 8 (DW_TAG_variable)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x87034): ultrasonics_read_attributes
    <fbb>   DW_AT_decl_file   : 1
    <fbb>   DW_AT_decl_line   : 147
    <fbc>   DW_AT_decl_column : 22
    <fbd>   DW_AT_type        : <0xcbd>
    <fc1>   DW_AT_external    : 1
    <fc1>   DW_AT_location    : 5 byte block: 3 4c b7 0 8 	(DW_OP_addr: 800b74c)
 <1><fc7>: Abbrev Number: 8 (DW_TAG_variable)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x8d9ee): car_next_stepHandle
    <fcc>   DW_AT_decl_file   : 1
    <fcc>   DW_AT_decl_line   : 153
    <fcd>   DW_AT_decl_column : 14
    <fce>   DW_AT_type        : <0xc1b>
    <fd2>   DW_AT_external    : 1
    <fd2>   DW_AT_location    : 5 byte block: 3 f4 0 0 20 	(DW_OP_addr: 200000f4)
 <1><fd8>: Abbrev Number: 8 (DW_TAG_variable)
    <fd9>   DW_AT_name        : (indirect string, offset: 0xbde3c): car_next_step_attributes
    <fdd>   DW_AT_decl_file   : 1
    <fdd>   DW_AT_decl_line   : 154
    <fde>   DW_AT_decl_column : 22
    <fdf>   DW_AT_type        : <0xcbd>
    <fe3>   DW_AT_external    : 1
    <fe3>   DW_AT_location    : 5 byte block: 3 70 b7 0 8 	(DW_OP_addr: 800b770)
 <1><fe9>: Abbrev Number: 19 (DW_TAG_subprogram)
    <fea>   DW_AT_external    : 1
    <fea>   DW_AT_name        : (indirect string, offset: 0xc0898): ECU_Motor_NextStep
    <fee>   DW_AT_decl_file   : 13
    <fef>   DW_AT_decl_line   : 67
    <ff0>   DW_AT_decl_column : 19
    <ff1>   DW_AT_prototyped  : 1
    <ff1>   DW_AT_type        : <0xd49>
    <ff5>   DW_AT_declaration : 1
    <ff5>   DW_AT_sibling     : <0x1004>
 <2><ff9>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ffa>   DW_AT_type        : <0x1004>
 <2><ffe>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fff>   DW_AT_type        : <0xe0>
 <2><1003>: Abbrev Number: 0
 <1><1004>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1005>   DW_AT_byte_size   : 4
    <1005>   DW_AT_type        : <0xdc0>
 <1><1009>: Abbrev Number: 19 (DW_TAG_subprogram)
    <100a>   DW_AT_external    : 1
    <100a>   DW_AT_name        : (indirect string, offset: 0x754b): printf
    <100e>   DW_AT_decl_file   : 17
    <100f>   DW_AT_decl_line   : 210
    <1010>   DW_AT_decl_column : 5
    <1011>   DW_AT_prototyped  : 1
    <1011>   DW_AT_type        : <0x2a>
    <1015>   DW_AT_declaration : 1
    <1015>   DW_AT_sibling     : <0x1020>
 <2><1019>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <101a>   DW_AT_type        : <0xf1>
 <2><101e>: Abbrev Number: 33 (DW_TAG_unspecified_parameters)
 <2><101f>: Abbrev Number: 0
 <1><1020>: Abbrev Number: 19 (DW_TAG_subprogram)
    <1021>   DW_AT_external    : 1
    <1021>   DW_AT_name        : (indirect string, offset: 0x6034a): ECU_Ultrasonic_Read
    <1025>   DW_AT_decl_file   : 15
    <1026>   DW_AT_decl_line   : 43
    <1027>   DW_AT_decl_column : 19
    <1028>   DW_AT_prototyped  : 1
    <1028>   DW_AT_type        : <0xd49>
    <102c>   DW_AT_declaration : 1
    <102c>   DW_AT_sibling     : <0x1036>
 <2><1030>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <1031>   DW_AT_type        : <0x1036>
 <2><1035>: Abbrev Number: 0
 <1><1036>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1037>   DW_AT_byte_size   : 4
    <1037>   DW_AT_type        : <0xe9d>
 <1><103b>: Abbrev Number: 23 (DW_TAG_subprogram)
    <103c>   DW_AT_external    : 1
    <103c>   DW_AT_name        : (indirect string, offset: 0xb8e48): osDelay
    <1040>   DW_AT_decl_file   : 9
    <1040>   DW_AT_decl_line   : 459
    <1042>   DW_AT_decl_column : 12
